Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: For simple workloads we can start a Flower server and leave all the configuration possibilities at their default values. In a file named :code:`server.py`, import Flower and start the server:
es: Para cargas de trabajo simples podemos iniciar un servidor Flower y dejar todas las posibilidades de configuración en sus valores predeterminados. En un archivo llamado :code:`server.py`, importe Flower e inicie el servidor:

source: Train the model, federated!
es: ¡Entrena al modelo, federado!

source: With both client and server ready, we can now run everything and see federated learning in action. FL systems usually have a server and multiple clients. We therefore have to start the server first:
es: Con el cliente y el servidor listos, ahora podemos ejecutar todo y ver el aprendizaje federado en acción. Los sistemas FL suelen tener un servidor y varios clientes. Por lo tanto primero tenemos que iniciar el servidor:

source: Once the server is running we can start the clients in different terminals. Build and run the client through your Xcode, one through Xcode Simulator and the other by deploying it to your iPhone. To see more about how to deploy your app to iPhone or Simulator visit `here <https://developer.apple.com/documentation/xcode/running-your-app-in-simulator-or-on-a-device>`_.
es: Una vez que el servidor esté funcionando podemos iniciar los clientes en diferentes terminales. Cree y ejecute el cliente a través de su Xcode, uno a través de Xcode Simulator y el otro implementándolo en su iPhone. Para ver más sobre cómo implementar su aplicación en iPhone o simulador, visite `aquí <https://developer.apple.com/documentation/xcode/running-your-app-in-simulator-or-on-a-device>` _.

source: Congratulations! You've successfully built and run your first federated learning system in your ios device. The full `source code <https://github.com/adap/flower/blob/main/examples/ios>`_ for this example can be found in :code:`examples/ios`.
es: ¡Felicidades! Ha creado y ejecutado con éxito su primer sistema de aprendizaje federado en su dispositivo iOS. El `código fuente completo <https://github.com/adap/flower/blob/main/examples/ios>`_ para este ejemplo se puede encontrar en :code:`examples/ios`.

source: Quickstart JAX
es: Inicio rápido JAX

source: Quickstart MXNet
es: Inicio rápido MXNet

source: In this tutorial, we will learn how to train a :code:`Sequential` model on MNIST using Flower and MXNet.
es: En este tutorial, aprenderemos cómo entrenar un modelo :code:`Sequential` en MNIST usando Flower y MXNet.

source: It is recommended to create a virtual environment and run everything within this `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.
es: Se recomienda crear un entorno virtual y ejecutar todo dentro de este `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.

source: *Clients* are responsible for generating individual model parameter updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce an updated global model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of parameters updates is called a *round*.
es: *Los clientes* son responsables de generar actualizaciones de parámetros de modelo individuales para el modelo en función de sus conjuntos de datos locales. Estas actualizaciones luego se envían al *servidor* que las agregará para producir un modelo global actualizado. Finalmente, el *servidor* envía esta versión mejorada del modelo a cada *cliente*. Un ciclo completo de actualizaciones de parámetros se denomina *ronda*.

source: Now that we have a rough idea of what is going on, let's get started. We first need to install Flower. You can do this by running:
es: Ahora que tenemos una idea aproximada de lo que está pasando, comencemos. Primero necesitamos instalar Flower. Puedes hacer esto ejecutando:

source: Since we want to use MXNet, let's go ahead and install it:
es: Como queremos usar MXNet, sigamos adelante e instalémoslo:

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. Our training procedure and network architecture are based on MXNet´s `Hand-written Digit Recognition tutorial <https://mxnet.apache.org/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_.
es: Ahora que tenemos todas nuestras dependencias instaladas, ejecutemos una capacitación distribuida simple con dos clientes y un servidor. Nuestro procedimiento de capacitación y arquitectura de red se basan en el `Tutorial de reconocimiento de dígitos escrito a mano de MXNet <https://mxnet.apache.org/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_ .

source: In a file called :code:`client.py`, import Flower and MXNet related packages:
es: En un archivo llamado :code:`client.py`, importe los paquetes relacionados con Flower y MXNet:

source: In addition, define the device allocation in MXNet with:
es: Además, defina la asignación de dispositivos en MXNet con:

source: We use MXNet to load MNIST, a popular image classification dataset of handwritten digits for machine learning. The MXNet utility :code:`mx.test_utils.get_mnist()` downloads the training and test data.
es: Usamos MXNet para cargar MNIST, un popular conjunto de datos de clasificación de imágenes de dígitos escritos a mano para el aprendizaje automático. La utilidad MXNet :code:`mx.test_utils.get_mnist()` descarga los datos de entrenamiento y prueba.

source: Define the training and loss with MXNet. We train the model by looping over the dataset, measure the corresponding loss, and optimize it.
es: Defina el entrenamiento y la pérdida con MXNet. Entrenamos el modelo recorriendo el conjunto de datos, medimos la pérdida correspondiente y lo optimizamos.

source: Next, we define the validation of our machine learning model. We loop over the test set and measure both loss and accuracy on the test set.
es: A continuación, definimos la validación de nuestro modelo de aprendizaje automático. Recorremos el conjunto de prueba y medimos tanto la pérdida como la precisión en el conjunto de prueba.

source: After defining the training and testing of a MXNet machine learning model, we use these functions to implement a Flower client.
es: Después de definir el entrenamiento y las pruebas de un modelo de aprendizaje automático MXNet, utilizamos estas funciones para implementar un cliente Flower.

source: Our Flower clients will use a simple :code:`Sequential` model:
es: Nuestros clientes de Flower utilizarán un modelo :code:`Sequential` simple:

source: After loading the dataset with :code:`load_data()` we perform one forward propagation to initialize the model and model parameters with :code:`model(init)`. Next, we implement a Flower client.
es: Después de cargar el conjunto de datos con :code:`load_data()`, realizamos una propagación hacia adelante para inicializar el modelo y los parámetros del modelo con :code:`model(init)`. A continuación, implementamos un cliente Flower.

source: The Flower server interacts with clients through an interface called :code:`Client`. When the server selects a particular client for training, it sends training instructions over the network. The client receives those instructions and calls one of the :code:`Client` methods to run your code (i.e., to train the neural network we defined earlier).
es: El servidor Flower interactúa con los clientes a través de una interfaz llamada :code:`Client`. Cuando el servidor selecciona un cliente en particular para entrenar, envía instrucciones de entrenamiento a través de la red. El cliente recibe esas instrucciones y llama a uno de los métodos :code:`Client` para ejecutar su código (es decir, para entrenar la red neuronal que definimos anteriormente).

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses MXNet. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
es: Flower proporciona una clase de conveniencia llamada :code:`NumPyClient` que facilita la implementación de la interfaz :code:`Client` cuando su carga de trabajo usa MXNet. Implementar :code:`NumPyClient` generalmente significa definir los siguientes métodos (aunque:code:`set_parameters` es opcional):

source: return the model weight as a list of NumPy ndarrays
es: devolver el peso del modelo como una lista de NumPy ndarrays

source: :code:`set_parameters` (optional)
es: :código:`set_parameters` (opcional)

source: update the local model weights with the parameters received from the server
es: actualizar los pesos del modelo local con los parámetros recibidos del servidor

source: set the local model weights
es: establecer los pesos del modelo local

source: train the local model
es: entrenar el modelo local

source: receive the updated local model weights
es: recibir los pesos de los modelos locales actualizados

source: test the local model
es: probar el modelo local

source: They can be implemented in the following way:
es: Se pueden implementar de la siguiente manera:

source: We can now create an instance of our class :code:`MNISTClient` and add one line to actually run this client:
es: Ahora podemos crear una instancia de nuestra clase :code:`MNISTClient` y agregar una línea para ejecutar este cliente:

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()` or :code:`fl.client.start_numpy_client()`. The string :code:`"0.0.0.0:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"0.0.0.0:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we pass to the client.
es: Eso es todo para el cliente. Solo tenemos que implementar :code:`Client` o :code:`NumPyClient` y llamar a :code:`fl.client.start_client()` o :code:`fl.client.start_numpy_client()`. La cadena :code:`"0.0.0.0:8080"` le dice al cliente a qué servidor conectarse. En nuestro caso podemos ejecutar el servidor y el cliente en la misma máquina, por lo tanto usamos :code:`"0.0.0.0:8080"`. Si ejecutamos una carga de trabajo verdaderamente federada con el servidor y los clientes ejecutándose en diferentes máquinas, todo lo que necesita cambiar es el :code:`server_address` que le pasamos al cliente.

source: With both client and server ready, we can now run everything and see federated learning in action. Federated learning systems usually have a server and multiple clients. We therefore have to start the server first:
es: Con el cliente y el servidor listos, ahora podemos ejecutar todo y ver el aprendizaje federado en acción. Los sistemas de aprendizaje federados suelen tener un servidor y varios clientes. Por lo tanto primero tenemos que iniciar el servidor:

source: Once the server is running we can start the clients in different terminals. Open a new terminal and start the first client:
es: Una vez que el servidor esté funcionando podemos iniciar los clientes en diferentes terminales. Abra una nueva terminal e inicie el primer cliente:

source: Open another terminal and start the second client:
es: Abra otra terminal e inicie el segundo cliente:

source: Each client will have its own dataset. You should now see how the training does in the very first terminal (the one that started the server):
es: Cada cliente tendrá su propio conjunto de datos. Ahora deberías ver cómo funciona el entrenamiento en la primera terminal (la que inició el servidor):

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/blob/main/examples/quickstart-mxnet/client.py>`_ for this example can be found in :code:`examples/quickstart-mxnet`.
es: ¡Felicidades! Ha creado y ejecutado con éxito su primer sistema de aprendizaje federado. El `código fuente completo <https://github.com/adap/flower/blob/main/examples/quickstart-mxnet/client.py>`_ para este ejemplo se puede encontrar en :code:`examples/quickstart-mxnet `.

source: Quickstart Pandas
es: Pandas de inicio rápido

source: Let's build a federated analytics system using Pandas and Flower!
es: ¡Construyamos un sistema de análisis federado usando Pandas y Flower!

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-pandas>`_ to learn more.
es: Consulte el `ejemplo de código completo <https://github.com/adap/flower/tree/main/examples/quickstart-pandas>`_ para obtener más información.

source: In this tutorial we will learn how to train a Convolutional Neural Network on CIFAR10 using Flower and PyTorch.
es: En este tutorial aprenderemos cómo entrenar una red neuronal convolucional en CIFAR10 usando Flower y PyTorch.

source: First of all, it is recommended to create a virtual environment and run everything within a `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.
es: En primer lugar, se recomienda crear un entorno virtual y ejecutar todo dentro de un `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.

source: Since we want to use PyTorch to solve a computer vision task, let's go ahead and install PyTorch and the **torchvision** library:
es: Como queremos usar PyTorch para resolver una tarea de visión por computadora, sigamos adelante e instalemos PyTorch y la biblioteca **torchvision**:

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. Our training procedure and network architecture are based on PyTorch's `Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_.
es: Ahora que tenemos todas nuestras dependencias instaladas, ejecutemos una capacitación distribuida simple con dos clientes y un servidor. Nuestro procedimiento de capacitación y arquitectura de red se basan en el `Aprendizaje profundo con PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_ de PyTorch.

source: In a file called :code:`client.py`, import Flower and PyTorch related packages:
es: En un archivo llamado :code:`client.py`, importe los paquetes relacionados con Flower y PyTorch:

source: In addition, we define the device allocation in PyTorch with:
es: Además, definimos la asignación de dispositivos en PyTorch con:

source: We use PyTorch to load CIFAR10, a popular colored image classification dataset for machine learning. The PyTorch :code:`DataLoader()` downloads the training and test data that are then normalized.
es: Usamos PyTorch para cargar CIFAR10, un popular conjunto de datos de clasificación de imágenes en color para el aprendizaje automático. PyTorch :code:`DataLoader()` descarga los datos de entrenamiento y prueba que luego se normalizan.

source: Define the loss and optimizer with PyTorch. The training of the dataset is done by looping over the dataset, measure the corresponding loss and optimize it.
es: Defina la pérdida y el optimizador con PyTorch. El entrenamiento del conjunto de datos se realiza recorriendo el conjunto de datos, midiendo la pérdida correspondiente y optimizándolo.

source: Define then the validation of the machine learning network. We loop over the test set and measure the loss and accuracy of the test set.
es: Defina entonces la validación de la red de aprendizaje automático. Recorremos el conjunto de prueba y medimos la pérdida y precisión del conjunto de prueba.

source: After defining the training and testing of a PyTorch machine learning model, we use the functions for the Flower clients.
es: Después de definir el entrenamiento y las pruebas de un modelo de aprendizaje automático de PyTorch, utilizamos las funciones para los clientes de Flower.

source: The Flower clients will use a simple CNN adapted from 'PyTorch: A 60 Minute Blitz':
es: Los clientes de Flower utilizarán una CNN sencilla adaptada de 'PyTorch: A 60 Minute Blitz':

source: After loading the data set with :code:`load_data()` we define the Flower interface.
es: Después de cargar el conjunto de datos con :code:`load_data()` definimos la interfaz Flower.

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses PyTorch. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
es: Flower proporciona una clase de conveniencia llamada :code:`NumPyClient` que facilita la implementación de la interfaz :code:`Client` cuando su carga de trabajo usa PyTorch. Implementar :code:`NumPyClient` generalmente significa definir los siguientes métodos (aunque:code:`set_parameters` es opcional):

source: which can be implemented in the following way:
es: que se puede implementar de la siguiente manera:

source: We can now create an instance of our class :code:`CifarClient` and add one line to actually run this client:
es: Ahora podemos crear una instancia de nuestra clase :code:`CifarClient` y agregar una línea para ejecutar este cliente:

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()` or :code:`fl.client.start_numpy_client()`. The string :code:`"[::]:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"[::]:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we point the client at.
es: Eso es todo para el cliente. Solo tenemos que implementar :code:`Client` o :code:`NumPyClient` y llamar a :code:`fl.client.start_client()` o :code:`fl.client.start_numpy_client()`. La cadena :code:`"[::]:8080"` le dice al cliente a qué servidor conectarse. En nuestro caso podemos ejecutar el servidor y el cliente en la misma máquina, por lo tanto usamos :code:`"[::]:8080"`. Si ejecutamos una carga de trabajo verdaderamente federada con el servidor y los clientes ejecutándose en diferentes máquinas, todo lo que necesita cambiar es el :code:`server_address` al que apuntamos al cliente.

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/blob/main/examples/quickstart-pytorch/client.py>`_ for this example can be found in :code:`examples/quickstart-pytorch`.
es: ¡Felicidades! Ha creado y ejecutado con éxito su primer sistema de aprendizaje federado. El `código fuente completo <https://github.com/adap/flower/blob/main/examples/quickstart-pytorch/client.py>`_ para este ejemplo se puede encontrar en :code:`examples/quickstart-pytorch `.

source: Quickstart PyTorch Lightning
es: Inicio rápido de PyTorch Lightning

source: Let's build a federated learning system using PyTorch Lightning and Flower!
es: ¡Construyamos un sistema de aprendizaje federado usando PyTorch Lightning y Flower!

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch-lightning>`_ to learn more.
es: Consulte el `ejemplo de código completo <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch-lightning>`_ para obtener más información.

source: Quickstart scikit-learn
es: Inicio rápido scikit-learn

source: In this tutorial, we will learn how to train a :code:`Logistic Regression` model on MNIST using Flower and scikit-learn.
es: En este tutorial, aprenderemos cómo entrenar un modelo :code:`Regresión logística` en MNIST usando Flower y scikit-learn.

source: Since we want to use scikt-learn, let's go ahead and install it:
es: Como queremos usar scikt-learn, sigamos adelante e instalémoslo:

source: Or simply install all dependencies using Poetry:
es: O simplemente instale todas las dependencias usando Poetry:

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. However, before setting up the client and server, we will define all functionalities that we need for our federated learning setup within :code:`utils.py`. The :code:`utils.py` contains different functions defining all the machine learning basics:
es: Ahora que tenemos todas nuestras dependencias instaladas, ejecutemos una capacitación distribuida simple con dos clientes y un servidor. Sin embargo, antes de configurar el cliente y el servidor, definiremos todas las funcionalidades que necesitamos para nuestra configuración de aprendizaje federado dentro de :code:`utils.py`. El :code:`utils.py` contiene diferentes funciones que definen todos los conceptos básicos del aprendizaje automático:

source: :code:`get_model_parameters()`
es: :código:`get_model_parameters()`

source: Returns the paramters of a :code:`sklearn` LogisticRegression model
es: Devuelve los parámetros de un modelo :code:`sklearn` LogisticRegression

source: :code:`set_model_params()`
es: :código:`set_model_params()`

source: Sets the parameters of a :code:`sklean` LogisticRegression model
es: Establece los parámetros de un modelo :code:`sklean` LogisticRegression

source: :code:`set_initial_params()`
es: :código:`set_initial_params()`

source: Initializes the model parameters that the Flower server will ask for
es: Inicializa los parámetros del modelo que solicitará el servidor Flower.

source: :code:`load_mnist()`
es: :código:`load_mnist()`

source: Loads the MNIST dataset using OpenML
es: Carga el conjunto de datos MNIST usando OpenML

source: :code:`shuffle()`
es: :código:`barajar()`

source: Shuffles data and its label
es: Mezcla datos y su etiqueta.

source: :code:`partition()`
es: :código:`partición()`

source: Splits datasets into a number of partitions
es: Divide conjuntos de datos en varias particiones

source: Please check out :code:`utils.py` `here <https://github.com/adap/flower/blob/main/examples/sklearn-logreg-mnist/utils.py>`_ for more details. The pre-defined functions are used in the :code:`client.py` and imported. The :code:`client.py` also requires to import several packages such as Flower and scikit-learn:
es: Consulte :code:`utils.py` `aquí <https://github.com/adap/flower/blob/main/examples/sklearn-logreg-mnist/utils.py>`_ para obtener más detalles. Las funciones predefinidas se utilizan en :code:`client.py` y se importan. El :code:`client.py` también requiere importar varios paquetes como Flower y scikit-learn:

source: We load the MNIST dataset from `OpenML <https://www.openml.org/d/554>`_, a popular image classification dataset of handwritten digits for machine learning. The utility :code:`utils.load_mnist()` downloads the training and test data. The training set is split afterwards into 10 partitions with :code:`utils.partition()`.
es: Cargamos el conjunto de datos MNIST desde `OpenML <https://www.openml.org/d/554>`_, un popular conjunto de datos de clasificación de imágenes de dígitos escritos a mano para el aprendizaje automático. La utilidad :code:`utils.load_mnist()` descarga los datos de entrenamiento y prueba. El conjunto de entrenamiento se divide luego en 10 particiones con :code:`utils.partition()`.

source: Next, the logistic regression model is defined and initialized with :code:`utils.set_initial_params()`.
es: A continuación, el modelo de regresión logística se define e inicializa con :code:`utils.set_initial_params()`.
