Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Pair each :code:`ClientProxy` with the same :code:`FitIns` holding the current global model :code:`parameters` and :code:`config` dict
es: Empareje cada :code:`ClientProxy` con el mismo :code:`FitIns` que contiene el modelo global actual :code:`parameters` y :code:`config` dict

source: More sophisticated implementations can use :code:`configure_fit` to implement custom client selection logic. A client will only participate in a round if the corresponding :code:`ClientProxy` is included in the the list returned from :code:`configure_fit`.
es: Implementaciones más sofisticadas pueden usar :code:`configure_fit` para implementar una lógica de selección de cliente personalizada. Un cliente solo participará en una ronda si el :code:`ClientProxy` correspondiente está incluido en la lista devuelta por :code:`configure_fit`.

source: The structure of this return value provides a lot of flexibility to the user. Since instructions are defined on a per-client basis, different instructions can be sent to each client. This enables custom strategies to train, for example, different models on different clients, or use different hyperparameters on different clients (via the :code:`config` dict).
es: La estructura de este valor de retorno proporciona mucha flexibilidad al usuario. Dado que las instrucciones se definen por cliente, se pueden enviar instrucciones diferentes a cada cliente. Esto permite estrategias personalizadas para entrenar, por ejemplo, diferentes modelos en diferentes clientes, o usar diferentes hiperparámetros en diferentes clientes (a través del dictado :code:`config`).

source: The :code:`aggregate_fit` method
es: El método :code:`aggregate_fit`

source: :code:`aggregate_fit` is responsible for aggregating the results returned by the clients that were selected and asked to train in :code:`configure_fit`.
es: :code:`aggregate_fit` es responsable de agregar los resultados devueltos por los clientes que fueron seleccionados y solicitados para entrenar en :code:`configure_fit`.

source: Of course, failures can happen, so there is no guarantee that the server will get results from all the clients it sent instructions to (via :code:`configure_fit`). :code:`aggregate_fit` therefore receives a list of :code:`results`, but also a list of :code:`failures`.
es: Por supuesto, pueden ocurrir fallas, por lo que no hay garantía de que el servidor obtenga resultados de todos los clientes a los que envió instrucciones (a través de :code:`configure_fit`). :code:`aggregate_fit` por lo tanto recibe una lista de :code:`resultados`, pero también una lista de :code:`fallos`.

source: :code:`aggregate_fit` returns an optional :code:`Parameters` object and a dictionary of aggregated metrics. The :code:`Parameters` return value is optional because :code:`aggregate_fit` might decide that the results provided are not sufficient for aggregation (e.g., too many failures).
es: :code:`aggregate_fit` devuelve un objeto :code:`Parameters` opcional y un diccionario de métricas agregadas. El valor de retorno :code:`Parameters` es opcional porque :code:`aggregate_fit` podría decidir que los resultados proporcionados no son suficientes para la agregación (por ejemplo, demasiadas fallas).

source: The :code:`configure_evaluate` method
es: El método :code:`configure_evaluate`

source: :code:`configure_evaluate` is responsible for configuring the upcoming round of evaluation. What does *configure* mean in this context? Configuring a round means selecting clients and deciding what instructions to send to these clients. The signature of :code:`configure_evaluate` makes this clear:
es: :code:`configure_evaluate` es responsable de configurar la próxima ronda de evaluación. ¿Qué significa *configurar* en este contexto? Configurar una ronda significa seleccionar clientes y decidir qué instrucciones enviarles. La firma de :code:`configure_evaluate` deja esto claro:

source: The return value is a list of tuples, each representing the instructions that will be sent to a particular client. Strategy implementations usually perform the following steps in :code:`configure_evaluate`:
es: El valor de retorno es una lista de tuplas, cada una de las cuales representa las instrucciones que se enviarán a un cliente en particular. Las implementaciones de estrategias generalmente realizan los siguientes pasos en :code:`configure_evaluate`:

source: Pair each :code:`ClientProxy` with the same :code:`EvaluateIns` holding the current global model :code:`parameters` and :code:`config` dict
es: Empareje cada :code:`ClientProxy` con el mismo :code:`EvaluateIns` que contiene el modelo global actual :code:`parameters` y :code:`config` dict

source: More sophisticated implementations can use :code:`configure_evaluate` to implement custom client selection logic. A client will only participate in a round if the corresponding :code:`ClientProxy` is included in the the list returned from :code:`configure_evaluate`.
es: Implementaciones más sofisticadas pueden usar :code:`configure_evaluate` para implementar una lógica de selección de cliente personalizada. Un cliente solo participará en una ronda si el :code:`ClientProxy` correspondiente está incluido en la lista devuelta por :code:`configure_evaluate`.

source: The structure of this return value provides a lot of flexibility to the user. Since instructions are defined on a per-client basis, different instructions can be sent to each client. This enables custom strategies to evaluate, for example, different models on different clients, or use different hyperparameters on different clients (via the :code:`config` dict).
es: La estructura de este valor de retorno proporciona mucha flexibilidad al usuario. Dado que las instrucciones se definen por cliente, se pueden enviar instrucciones diferentes a cada cliente. Esto permite que las estrategias personalizadas evalúen, por ejemplo, diferentes modelos en diferentes clientes, o utilicen diferentes hiperparámetros en diferentes clientes (a través del dictado :code:`config`).

source: The :code:`aggregate_evaluate` method
es: El método :code:`aggregate_evaluate`

source: :code:`aggregate_evaluate` is responsible for aggregating the results returned by the clients that were selected and asked to evaluate in :code:`configure_evaluate`.
es: :code:`aggregate_evaluate` es responsable de agregar los resultados devueltos por los clientes que fueron seleccionados y solicitados para evaluar en :code:`configure_evaluate`.

source: Of course, failures can happen, so there is no guarantee that the server will get results from all the clients it sent instructions to (via :code:`configure_evaluate`). :code:`aggregate_evaluate` therefore receives a list of :code:`results`, but also a list of :code:`failures`.
es: Por supuesto, pueden ocurrir fallas, por lo que no hay garantía de que el servidor obtenga resultados de todos los clientes a los que envió instrucciones (a través de :code:`configure_evaluate`). :code:`aggregate_evaluate` por lo tanto recibe una lista de :code:`resultados`, pero también una lista de :code:`fallos`.

source: :code:`aggregate_evaluate` returns an optional :code:`float` (loss) and a dictionary of aggregated metrics. The :code:`float` return value is optional because :code:`aggregate_evaluate` might decide that the results provided are not sufficient for aggregation (e.g., too many failures).
es: :code:`aggregate_evaluate` devuelve un :code:`float` (pérdida) opcional y un diccionario de métricas agregadas. El valor de retorno :code:`float` es opcional porque :code:`aggregate_evaluate` podría decidir que los resultados proporcionados no son suficientes para la agregación (por ejemplo, demasiadas fallas).

source: The :code:`evaluate` method
es: El método :code:`evaluar`

source: :code:`evaluate` is responsible for evaluating model parameters on the server-side. Having :code:`evaluate` in addition to :code:`configure_evaluate`/:code:`aggregate_evaluate` enables strategies to perform both servers-side and client-side (federated) evaluation.
es: :code:`evaluate` es responsable de evaluar los parámetros del modelo en el lado del servidor. Tener :code:`evaluate` además de :code:`configure_evaluate`/:code:`aggregate_evaluate` permite que las estrategias realicen evaluaciones tanto del lado del servidor como del lado del cliente (federado).

source: The return value is again optional because the strategy might not need to implement server-side evaluation or because the user-defined :code:`evaluate` method might not complete successfully (e.g., it might fail to load the server-side evaluation data).
es: El valor de retorno nuevamente es opcional porque es posible que la estrategia no necesite implementar la evaluación del lado del servidor o porque el método :code:`evaluate` definido por el usuario podría no completarse correctamente (por ejemplo, es posible que no se puedan cargar los datos de evaluación del lado del servidor). .

source: Install Flower
es: instalar flor

source: Python version
es: Versión de Python

source: Flower requires at least `Python 3.7 <https://docs.python.org/3.7/>`_, but `Python 3.8 <https://docs.python.org/3.7/>`_ or above is recommended.
es: Flower requiere al menos `Python 3.7 <https://docs.python.org/3.7/>`_, pero se recomienda `Python 3.8 <https://docs.python.org/3.7/>`_ o superior.

source: Install stable release
es: Instalar versión estable

source: Stable releases are available on `PyPI <https://pypi.org/project/flwr/>`_::
es: Las versiones estables están disponibles en `PyPI <https://pypi.org/project/flwr/>`_::

source: For simulations that use the Virtual Client Engine, ``flwr`` should be installed with the ``simulation`` extra::
es: Para simulaciones que utilizan Virtual Client Engine, ``flwr`` debe instalarse con el extra ``simulation``::

source: Verify installation
es: Verificar la instalación

source: The following command can be used to verfiy if Flower was successfully installed. If everything worked, it should print the version of Flower to the command line::
es: El siguiente comando se puede utilizar para verificar si Flower se instaló correctamente. Si todo funcionó, debería imprimir la versión de Flower en la línea de comando::

source: Advanced installation options
es: Opciones de instalación avanzadas

source: Install pre-release
es: Instalar versión preliminar

source: New (possibly unstable) versions of Flower are sometimes available as pre-release versions (alpha, beta, release candidate) before the stable release happens::
es: A veces hay versiones nuevas (posiblemente inestables) de Flower disponibles como versiones preliminares (alfa, beta, versión candidata) antes de que se produzca la versión estable::

source: For simulations that use the Virtual Client Engine, ``flwr`` pre-releases should be installed with the ``simulation`` extra::
es: Para simulaciones que utilizan Virtual Client Engine, las versiones preliminares de ``flwr`` deben instalarse con el extra de ``simulación``::

source: Install nightly release
es: Instalar la versión nocturna

source: The latest (potentially unstable) changes in Flower are available as nightly releases::
es: Los últimos cambios (potencialmente inestables) en Flower están disponibles como publicaciones nocturnas:

source: For simulations that use the Virtual Client Engine, ``flwr-nightly`` should be installed with the ``simulation`` extra::
es: Para simulaciones que utilizan Virtual Client Engine, ``flwr-nightly`` debe instalarse con el ``simulation`` extra::

source: Monitor simulation
es: Simulación de monitor

source: Flower allows you to monitor system resources while running your simulation. Moreover, the Flower simulation engine is powerful and enables you to decide how to allocate resources per client manner and constrain the total usage. Insights from resource consumption can help you make smarter decisions and speed up the execution time.
es: Flower le permite monitorear los recursos del sistema mientras ejecuta su simulación. Además, el motor de simulación de Flower es potente y le permite decidir cómo asignar recursos según el cliente y limitar el uso total. Los conocimientos del consumo de recursos pueden ayudarle a tomar decisiones más inteligentes y acelerar el tiempo de ejecución.

source: The specific instructions assume you are using macOS and have the `Homebrew <https://brew.sh/>`_ package manager installed.
es: Las instrucciones específicas suponen que está utilizando macOS y tiene instalado el administrador de paquetes `Homebrew <https://brew.sh/>`_.

source: Downloads
es: Descargas

source: `Prometheus <https://prometheus.io/>`_ is used for data collection, while `Grafana <https://grafana.com/>`_ will enable you to visualize the collected data. They are both well integrated with `Ray <https://www.ray.io/>`_ which Flower uses under the hood.
es: `Prometheus <https://prometheus.io/>`_ se utiliza para la recopilación de datos, mientras que `Grafana <https://grafana.com/>`_ le permitirá visualizar los datos recopilados. Ambos están bien integrados con `Ray <https://www.ray.io/>`_ que Flower usa bajo el capó.

source: Overwrite the configuration files (depending on your device, it might be installed on a different path).
es: Sobrescriba los archivos de configuración (dependiendo de su dispositivo, es posible que esté instalado en una ruta diferente).

source: If you are on an M1 Mac, it should be:
es: Si tienes una Mac M1, debería ser:

source: On the previous generation Intel Mac devices, it should be:
es: En los dispositivos Intel Mac de la generación anterior, debería ser:

source: Open the respective configuration files and change them. Depending on your device, use one of the two following commands:
es: Abra los respectivos archivos de configuración y cámbielos. Dependiendo de su dispositivo, use uno de los dos comandos siguientes:

source: and then delete all the text in the file and paste a new Prometheus config you see below. You may adjust the time intervals to your requirements:
es: y luego elimine todo el texto del archivo y pegue una nueva configuración de Prometheus que ve a continuación. Podrás ajustar los intervalos de tiempo a tus necesidades:

source: Now after you have edited the Prometheus configuration, do the same with the Grafana configuration files. Open those using one of the following commands as before:
es: Ahora, después de haber editado la configuración de Prometheus, haga lo mismo con los archivos de configuración de Grafana. Ábralos usando uno de los siguientes comandos como antes:

source: Your terminal editor should open and allow you to apply the following configuration as before.
es: Su editor de terminal debería abrirse y permitirle aplicar la siguiente configuración como antes.

source: Congratulations, you just downloaded all the necessary software needed for metrics tracking. Now, let’s start it.
es: Felicitaciones, acaba de descargar todo el software necesario para el seguimiento de métricas. Ahora, comencemos.

source: Tracking metrics
es: Métricas de seguimiento

source: Before running your Flower simulation, you have to start the monitoring tools you have just installed and configured.
es: Antes de ejecutar su simulación de Flower, debe iniciar las herramientas de monitoreo que acaba de instalar y configurar.

source: Please include the following argument in your Python code when starting a simulation.
es: Incluya el siguiente argumento en su código Python al iniciar una simulación.

source: Now, you are ready to start your workload.
es: Ahora está listo para comenzar su carga de trabajo.

source: Shortly after the simulation starts, you should see the following logs in your terminal:
es: Poco después de que comience la simulación, debería ver los siguientes registros en su terminal:

source: You can look at everything at `<http://127.0.0.1:8265>`_ .
es: Puedes ver todo en `<http://127.0.0.1:8265>`_.

source: It's a Ray Dashboard. You can navigate to Metrics (on the left panel, the lowest option).
es: Es un tablero de Ray. Puede navegar a Métricas (en el panel izquierdo, la opción más baja).

source: Or alternatively, you can just see them in Grafana by clicking on the right-up corner, “View in Grafana”. Please note that the Ray dashboard is only accessible during the simulation. After the simulation ends, you can only use Grafana to explore the metrics. You can start Grafana by going to ``http://localhost:3000/``.
es: O, alternativamente, puedes verlos en Grafana haciendo clic en la esquina superior derecha, "Ver en Grafana". Tenga en cuenta que solo se puede acceder al panel de Ray durante la simulación. Una vez finalizada la simulación, solo podrá utilizar Grafana para explorar las métricas. Puede iniciar Grafana yendo a ``http://localhost:3000/``.

source: After you finish the visualization, stop Prometheus and Grafana. This is important as they will otherwise block, for example port :code:`3000` on your machine as long as they are running.
es: Después de terminar la visualización, detén a Prometheus y Grafana. Esto es importante ya que de lo contrario bloquearán, por ejemplo, el puerto :code:`3000` en su máquina mientras se estén ejecutando.

source: Resource allocation
es: Asignación de recursos

source: You must understand how the Ray library works to efficiently allocate system resources to simulation clients on your own.
es: Debe comprender cómo funciona la biblioteca Ray para asignar de manera eficiente los recursos del sistema a los clientes de simulación por su cuenta.

source: Initially, the simulation (which Ray handles under the hood) starts by default with all the available resources on the system, which it shares among the clients. It doesn't mean it divides it equally among all of them, nor that the model training happens at all of them simultaneously. You will learn more about that in the later part of this blog. You can check the system resources by running the following:
es: Inicialmente, la simulación (que Ray maneja internamente) comienza de forma predeterminada con todos los recursos disponibles en el sistema, que comparte entre los clientes. No significa que lo divida equitativamente entre todos, ni que el entrenamiento del modelo se realice en todos simultáneamente. Aprenderá más sobre esto en la última parte de este blog. Puede verificar los recursos del sistema ejecutando lo siguiente:

source: In Google Colab, the result you see might be similar to this:
es: En Google Colab, el resultado que ve puede ser similar a este:

source: However, you can overwrite the defaults. When starting a simulation, do the following (you don't need to overwrite all of them):
es: Sin embargo, puede sobrescribir los valores predeterminados. Al iniciar una simulación, haga lo siguiente (no es necesario sobrescribirlos todos):

source: Let’s also specify the resource for a single client.
es: Especifiquemos también el recurso para un solo cliente.

source: Now comes the crucial part. Ray will start a new client only when it has all the required resources (such that they run in parallel) when the resources allow.
es: Ahora viene la parte crucial. Ray iniciará un nuevo cliente solo cuando tenga todos los recursos necesarios (de modo que se ejecuten en paralelo) cuando los recursos lo permitan.

source: In the example above, only one client will be run, so your clients won't run concurrently. Setting :code:`client_num_gpus = 0.5` would allow running two clients and therefore enable them to run concurrently. Be careful not to require more resources than available. If you specified :code:`client_num_gpus = 2`, the simulation wouldn't start (even if you had 2 GPUs but decided to set 1 in :code:`ray_init_args`).
es: En el ejemplo anterior, solo se ejecutará un cliente, por lo que sus clientes no se ejecutarán simultáneamente. Configurar :code:`client_num_gpus = 0.5` permitiría ejecutar dos clientes y, por lo tanto, permitiría que se ejecuten simultáneamente. Tenga cuidado de no requerir más recursos de los disponibles. Si especificaste :code:`client_num_gpus = 2`, la simulación no comenzaría (incluso si tuvieras 2 GPU pero decidieras configurar 1 en :code:`ray_init_args`).

source: FAQ
es: Preguntas más frecuentes

source: Q: I don't see any metrics logged.
es: P: No veo ninguna métrica registrada.

source: A: The timeframe might not be properly set. The setting is in the top right corner ("Last 30 minutes" by default). Please change the timeframe to reflect the period when the simulation was running.
es: R: Es posible que el plazo no esté establecido correctamente. La configuración se encuentra en la esquina superior derecha ("Últimos 30 minutos" de forma predeterminada). Cambie el período de tiempo para reflejar el período en el que se estaba ejecutando la simulación.

source: Q: I see “Grafana server not detected. Please make sure the Grafana server is running and refresh this page” after going to the Metrics tab in Ray Dashboard.
es: P: Veo “No se detectó el servidor Grafana. Asegúrese de que el servidor Grafana esté ejecutándose y actualice esta página” después de ir a la pestaña Métricas en Ray Dashboard.

source: A: You probably don't have Grafana running. Please check the running services
es: R: Probablemente no tengas Grafana ejecutándose. Por favor verifique los servicios en ejecución.

source: Q: I see "This site can't be reached" when going to `<http://127.0.0.1:8265>`_.
es: P: Veo "No se puede acceder a este sitio" cuando voy a `<http://127.0.0.1:8265>`_.

source: A: Either the simulation has already finished, or you still need to start Prometheus.
es: R: O la simulación ya ha finalizado o aún necesitas iniciar Prometheus.

source: Resources
es: Recursos

source: Ray Dashboard: `<https://docs.ray.io/en/latest/ray-core/ray-dashboard.html>`_
es: Panel de Ray: `<https://docs.ray.io/en/latest/ray-core/ray-dashboard.html>`_

source: Ray Metrics: `<https://docs.ray.io/en/latest/ray-observability/ray-metrics.html>`_
es: Métricas de rayos: `<https://docs.ray.io/en/latest/ray-observability/ray-metrics.html>`_

source: Run simulations
es: Ejecutar simulaciones

source: Simulating Federated Learning workloads is useful for a multitude of use-cases: you might want to run your workload on a large cohort of clients but without having to source, configure and mange a large number of physical devices; you might want to run your FL workloads as fast as possible on the compute systems you have access to without having to go through a complex setup process; you might want to validate your algorithm on different scenarios at varying levels of data and system heterogeneity, client availability, privacy budgets, etc. These are among some of the use-cases where simulating FL workloads makes sense. Flower can accommodate these scenarios by means of its `VirtualClientEngine <contributor-explanation-architecture.html#virtual-client-engine>`_ or VCE.
es: La simulación de cargas de trabajo de Federated Learning es útil para una multitud de casos de uso: es posible que desee ejecutar su carga de trabajo en una gran cohorte de clientes pero sin tener que buscar, configurar y administrar una gran cantidad de dispositivos físicos; es posible que desee ejecutar sus cargas de trabajo FL lo más rápido posible en los sistemas informáticos a los que tiene acceso sin tener que pasar por un proceso de configuración complejo; es posible que desee validar su algoritmo en diferentes escenarios con distintos niveles de datos y heterogeneidad del sistema, disponibilidad del cliente, presupuestos de privacidad, etc. Estos son algunos de los casos de uso en los que tiene sentido simular cargas de trabajo FL. Flower puede adaptarse a estos escenarios mediante su `VirtualClientEngine <contributor-explanation-architecture.html#virtual-client-engine>`_ o VCE.
