Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Flower Architecture
es: Arquitectura Flower

source: `Flower <https://flower.dev>`_ core framework architecture with Edge Client Engine
es: `Flower <https://flower.dev>`_ arquitectura de marco central con Edge Client Engine

source: Virtual Client Engine
es: Motor de cliente virtual

source: `Flower <https://flower.dev>`_ core framework architecture with Virtual Client Engine
es: `Flower <https://flower.dev>`_ arquitectura de marco central con Virtual Client Engine

source: Virtual Client Engine and Edge Client Engine in the same workload
es: Virtual Client Engine y Edge Client Engine en la misma carga de trabajo

source: `Flower <https://flower.dev>`_ core framework architecture with both Virtual Client Engine and Edge Client Engine
es: `Flower <https://flower.dev>`_ arquitectura de marco central con Virtual Client Engine y Edge Client Engine

source: Creating New Messages
es: Crear nuevos mensajes

source: This is a simple guide for creating a new type of message between the server and clients in Flower.
es: Esta es una guía sencilla para crear un nuevo tipo de mensaje entre el servidor y los clientes en Flower.

source: Let's suppose we have the following example functions in :code:`server.py` and :code:`numpy_client.py`...
es: Supongamos que tenemos las siguientes funciones de ejemplo en :code:`server.py` y :code:`numpy_client.py`...

source: Server's side:
es: Lado del servidor:

source: Client's side:
es: Lado del cliente:

source: Let's now see what we need to implement in order to get this simple function between the server and client to work!
es: ¡Veamos ahora qué necesitamos implementar para que funcione esta función simple entre el servidor y el cliente!

source: Message Types for Protocol Buffers
es: Tipos de mensajes para buffers de protocolo

source: The first thing we need to do is to define a message type for the RPC system in :code:`transport.proto`. Note that we have to do it for both the request and response messages. For more details on the syntax of proto3, please see the `official documentation <https://developers.google.com/protocol-buffers/docs/proto3>`_.
es: Lo primero que debemos hacer es definir un tipo de mensaje para el sistema RPC en :code:`transport.proto`. Tenga en cuenta que tenemos que hacerlo tanto para los mensajes de solicitud como para los de respuesta. Para obtener más detalles sobre la sintaxis de proto3, consulte la `documentación oficial <https://developers.google.com/protocol-buffers/docs/proto3>`_.

source: Within the :code:`ServerMessage` block:
es: Dentro del bloque :code:`ServerMessage`:

source: Within the ClientMessage block:
es: Dentro del bloque ClientMessage:

source: Make sure to also add a field of the newly created message type in :code:`oneof msg`.
es: Asegúrese de agregar también un campo del tipo de mensaje recién creado en :code:`oneof msg`.

source: Once that is done, we will compile the file with:
es: Una vez hecho esto, compilaremos el archivo con:

source: If it compiles succesfully, you should see the following message:
es: Si se compila correctamente, debería ver el siguiente mensaje:

source: Serialization and Deserialization Functions
es: Funciones de serialización y deserialización

source: Our next step is to add functions to serialize and deserialize Python datatypes to or from our defined RPC message types. You should add these functions in :code:`serde.py`.
es: Nuestro siguiente paso es agregar funciones para serializar y deserializar tipos de datos de Python hacia o desde nuestros tipos de mensajes RPC definidos. Debes agregar estas funciones en :code:`serde.py`.

source: The four functions:
es: Las cuatro funciones:

source: Sending the Message from the Server
es: Envío del mensaje desde el servidor

source: Now write the request function in your Client Proxy class (e.g., :code:`grpc_client_proxy.py`) using the serde functions you just created:
es: Ahora escriba la función de solicitud en su clase Client Proxy (por ejemplo, :code:`grpc_client_proxy.py`) usando las funciones serde que acaba de crear:

source: Receiving the Message by the Client
es: Recibir el mensaje por parte del cliente

source: Last step! Modify the code in :code:`message_handler.py` to check the field of your message and call the :code:`example_response` function. Remember to use the serde functions!
es: ¡Último paso! Modifique el código en :code:`message_handler.py` para verificar el campo de su mensaje y llame a la función :code:`example_response`. ¡Recuerda usar las funciones serde!

source: Within the handle function:
es: Dentro de la función de manejo:

source: And add a new function:
es: Y agregue una nueva función:

source: Hopefully, when you run your program you will get the intended result!
es: ¡Con suerte, cuando ejecute su programa obtendrá el resultado deseado!

source: Develop in VSCode Dev Containers
es: Desarrollar en contenedores de desarrollo VSCode

source: When working on the Flower framework we want to ensure that all contributors use the same developer environment to format code or run tests. For this purpose we are using the VSCode Remote Containers extension. What is it? Read the following quote:
es: Cuando trabajamos en el marco de Flower, queremos asegurarnos de que todos los contribuyentes utilicen el mismo entorno de desarrollador para formatear el código o ejecutar pruebas. Para ello utilizamos la extensión VSCode Remote Containers. ¿Qué es? Lea la siguiente cita:

source: The Visual Studio Code Remote - Containers extension lets you use a Docker container as a fully-featured development environment. It allows you to open any folder inside (or mounted into) a container and take advantage of Visual Studio Code's full feature set. A :code:`devcontainer.json` file in your project tells VS Code how to access (or create) a development container with a well-defined tool and runtime stack. This container can be used to run an application or to separate tools, libraries, or runtimes needed for working with a codebase.
es: La extensión Visual Studio Code Remote - Containers le permite utilizar un contenedor Docker como un entorno de desarrollo con todas las funciones. Le permite abrir cualquier carpeta dentro (o montada en) un contenedor y aprovechar el conjunto completo de funciones de Visual Studio Code. Un archivo :code:`devcontainer.json` en su proyecto le dice a VS Code cómo acceder (o crear) un contenedor de desarrollo con una herramienta bien definida y una pila de tiempo de ejecución. Este contenedor se puede utilizar para ejecutar una aplicación o para separar herramientas, bibliotecas o tiempos de ejecución necesarios para trabajar con una base de código.

source: Workspace files are mounted from the local file system or copied or cloned into the container. Extensions are installed and run inside the container, where they have full access to the tools, platform, and file system. This means that you can seamlessly switch your entire development environment just by connecting to a different container.
es: Los archivos del espacio de trabajo se montan desde el sistema de archivos local o se copian o clonan en el contenedor. Las extensiones se instalan y ejecutan dentro del contenedor, donde tienen acceso completo a las herramientas, la plataforma y el sistema de archivos. Esto significa que puede cambiar sin problemas todo su entorno de desarrollo simplemente conectándose a un contenedor diferente.

source: Source: `Official VSCode documentation <https://code.visualstudio.com/docs/remote/containers>`_
es: Fuente: `Documentación oficial de VSCode <https://code.visualstudio.com/docs/remote/containers>`_

source: Getting started
es: Empezando

source: Configuring and setting up the :code:`Dockerfile` as well the configuration for the devcontainer can be a bit more involved. The good thing is you want have to do it. Usually it should be enough to install Docker on your system and ensure its available on your command line. Additionally, install the `VSCode Containers Extension <vscode:extension/ms-vscode-remote.remote-containers>`_.
es: Configurar y configurar el :code:`Dockerfile` así como la configuración del devcontainer puede ser un poco más complicado. Lo bueno es que quieres hacerlo. Por lo general, debería ser suficiente instalar Docker en su sistema y asegurarse de que esté disponible en su línea de comando. Además, instale la `Extensión de contenedores VSCode <vscode:extension/ms-vscode-remote.remote-containers>`_.

source: Now you should be good to go. When starting VSCode, it will ask you to run in the container environment and - if you confirm - automatically build the container and use it. To manually instruct VSCode to use the devcontainer, you can, after installing the extension, click the green area in the bottom left corner of your VSCode window and select the option *(Re)Open Folder in Container*.
es: Ahora deberías estar listo para comenzar. Al iniciar VSCode, le pedirá que lo ejecute en el entorno del contenedor y, si lo confirma, compilará automáticamente el contenedor y lo utilizará. Para indicarle manualmente a VSCode que use el devcontainer, puede, después de instalar la extensión, hacer clic en el área verde en la esquina inferior izquierda de la ventana de VSCode y seleccionar la opción *(Re)Abrir carpeta en el contenedor*.

source: In some cases your setup might be more involved. For those cases consult the following sources:
es: En algunos casos, su configuración puede ser más complicada. Para esos casos consultar las siguientes fuentes:

source: `Developing inside a Container <https://code.visualstudio.com/docs/remote/containers#_system-requirements>`_
es: `Desarrollando dentro de un contenedor <https://code.visualstudio.com/docs/remote/containers#_system-requirements>`_

source: `Remote development in Containers <https://code.visualstudio.com/docs/remote/containers-tutorial>`_
es: `Desarrollo remoto en Contenedores <https://code.visualstudio.com/docs/remote/containers-tutorial>`_

source: Install development versions
es: Instalar versiones de desarrollo

source: Install development versions of Flower
es: Instalar versiones de desarrollo de Flower

source: Using Poetry (recommended)
es: Usando poesía (recomendado)

source: Install a ``flwr`` pre-release from PyPI: update the ``flwr`` dependency in ``pyproject.toml`` and then reinstall (don't forget to delete ``poetry.lock`` (``rm poetry.lock``) before running ``poetry install``).
es: Instale una versión preliminar de ``flwr`` desde PyPI: actualice la dependencia ``flwr`` en ``pyproject.toml`` y luego reinstálela (no olvide eliminar ``poetry.lock`` (``rm poetry.lock``) antes de ejecutar ``poetry install``).

source: ``flwr = { version = "1.0.0a0", allow-prereleases = true }`` (without extras)
es: ``flwr = { version = "1.0.0a0", enable-prereleases = true }`` (sin extras)

source: ``flwr = { version = "1.0.0a0", allow-prereleases = true, extras = ["simulation"] }`` (with extras)
es: ``flwr = { version = "1.0.0a0", enable-prereleases = true, extras = ["simulación"] }`` (con extras)

source: Install ``flwr`` from a local copy of the Flower source code via ``pyproject.toml``:
es: Instale ``flwr`` desde una copia local del código fuente de Flower mediante ``pyproject.toml``:

source: ``flwr = { path = "../../", develop = true }`` (without extras)
es: ``flwr = { path = "../../", development = true }`` (sin extras)

source: ``flwr = { path = "../../", develop = true, extras = ["simulation"] }`` (with extras)
es: ``flwr = { ruta = "../../", desarrollo = verdadero, extras = ["simulación"] }`` (con extras)

source: Install ``flwr`` from a local wheel file via ``pyproject.toml``:
es: Instale ``flwr`` desde un archivo de rueda local mediante ``pyproject.toml``:

source: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl" }`` (without extras)
es: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl" }`` (sin extras)

source: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl", extras = ["simulation"] }`` (with extras)
es: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl", extras = ["simulación"] }`` (con extras)

source: Please refer to the Poetry documentation for further details: `Poetry Dependency Specification <https://python-poetry.org/docs/dependency-specification/>`_
es: Consulte la documentación de Poetry para obtener más detalles: `Especificación de dependencia de Poetry <https://python-poetry.org/docs/dependency-specification/>`_

source: Using pip (recommended on Colab)
es: Usando pip (recomendado en Colab)

source: Install a ``flwr`` pre-release from PyPI:
es: Instale una versión preliminar de ``flwr`` desde PyPI:

source: ``pip install -U --pre flwr`` (without extras)
es: ``pip install -U --pre flwr`` (sin extras)

source: ``pip install -U --pre flwr[simulation]`` (with extras)
es: ``pip install -U --pre flwr[simulación]`` (con extras)

source: Python packages can be installed from git repositories. Use one of the following commands to install the Flower directly from GitHub.
es: Los paquetes de Python se pueden instalar desde repositorios de git. Utilice uno de los siguientes comandos para instalar Flower directamente desde GitHub.

source: Install ``flwr`` from the default GitHub branch (``main``):
es: Instale ``flwr`` desde la rama predeterminada de GitHub (``main``):

source: ``pip install flwr@git+https://github.com/adap/flower.git`` (without extras)
es: ``pip install flwr@git+https://github.com/adap/flower.git`` (sin extras)

source: ``pip install flwr[simulation]@git+https://github.com/adap/flower.git`` (with extras)
es: ``pip install flwr[simulación]@git+https://github.com/adap/flower.git`` (con extras)

source: Install ``flwr`` from a specific GitHub branch (``branch-name``):
es: Instale ``flwr`` desde una rama específica de GitHub (``branch-name``):

source: ``pip install flwr@git+https://github.com/adap/flower.git@branch-name`` (without extras)
es: ``pip install flwr@git+https://github.com/adap/flower.git@branch-name`` (sin extras)

source: ``pip install flwr[simulation]@git+https://github.com/adap/flower.git@branch-name`` (with extras)
es: ``pip install flwr[simulación]@git+https://github.com/adap/flower.git@branch-name`` (con extras)

source: Open Jupyter Notebooks on Google Colab
es: Abra Jupyter Notebooks en Google Colab

source: Open the notebook ``doc/source/tutorial-get-started-with-flower-pytorch.ipynb``:
es: Abra el cuaderno ``doc/source/tutorial-get-started-with-flower-pytorch.ipynb``:

source: Open a development version of the same notebook from branch `branch-name` by changing ``main`` to ``branch-name`` (right after ``blob``):
es: Abra una versión de desarrollo del mismo cuaderno desde la rama ``nombre-rama`` cambiando ``principal`` por ``nombre-rama`` (justo después de ``blob``):

source: Release Flower
es: Flor de liberación

source: This document describes the current release process. It may or may not change in the future.
es: Este documento describe el proceso de lanzamiento actual. Puede que cambie o no en el futuro.

source: Before the release
es: antes del lanzamiento

source: Update the changelog (``changelog.md``) with all relevant changes that happened after the last release. If the last release was tagged ``v1.2.0``, you can use the following URL to see all commits that got merged into ``main`` since then:
es: Actualice el registro de cambios (``changelog.md``) con todos los cambios relevantes que ocurrieron después de la última versión. Si la última versión fue etiquetada como ``v1.2.0``, puede usar la siguiente URL para ver todas las confirmaciones que se fusionaron en ``principal`` desde entonces:

source: `GitHub: Compare v1.2.0...main <https://github.com/adap/flower/compare/v1.2.0...main>`_
es: `GitHub: Comparar v1.2.0...main <https://github.com/adap/flower/compare/v1.2.0...main>`_

source: Thank the authors who contributed since the last release. This command helps extract them: ``git log --format='%aN' v1.1.0..HEAD | sort -u``. The command has the same order as ``git shortlog``.
es: Agradezca a los autores que contribuyeron desde la última publicación. Este comando ayuda a extraerlos: ``git log --format='%aN' v1.1.0..HEAD | ordenar -u``. El comando tiene el mismo orden que ``git shortlog``.

source: During the release
es: durante el lanzamiento

source: The version number of a release is stated in ``pyproject.toml``. To release a new version of Flower, the following things need to happen (in that order):
es: El número de versión de una versión se indica en ``pyproject.toml``. Para lanzar una nueva versión de Flower, deben suceder las siguientes cosas (en ese orden):

source: Update the ``changelog.md`` section header ``Unreleased`` to contain the version number and date for the release you are building. Create a pull request with the change.
es: Actualice el encabezado de la sección ``changelog.md`` ``Unreleased`` para que contenga el número de versión y la fecha de la versión que está creando. Cree una solicitud de extracción con el cambio.

source: Tag the release commit with the version number as soon as the PR is merged: ``git tag v0.12.3``, then ``git push --tags``
es: Etiquete la confirmación de lanzamiento con el número de versión tan pronto como se fusione el PR: ``git tag v0.12.3``, luego ``git push --tags``

source: Build the release with ``./dev/build.sh``, then publish it with ``./dev/publish.sh``
es: Compile la versión con ``./dev/build.sh``, luego publíquela con ``./dev/publish.sh``

source: Create an entry in GitHub releases with the release notes for the previously tagged commit and attach the build artifacts (:code:`.whl` and :code:`.tar.gz`).
es: Cree una entrada en las versiones de GitHub con las notas de la versión para la confirmación previamente etiquetada y adjunte los artefactos de compilación (:code:`.whl` y :code:`.tar.gz`).

source: After the release
es: después del lanzamiento

source: Create a pull request which contains the following changes:
es: Cree una solicitud de extracción que contenga los siguientes cambios:

source: Increase the minor version in ``pyproject.toml`` by one.
es: Aumente la versión menor en ``pyproject.toml`` en uno.

source: Update all files which contain the current version number if necessary.
es: Actualice todos los archivos que contengan el número de versión actual si es necesario.

source: Add a new ``Unreleased`` section in ``changelog.md``.
es: Agregue una nueva sección ``Inédito`` en ``changelog.md``.

source: Merge the pull request on the same day (i.e., before a new nighly release gets published to PyPI).
es: Fusione la solicitud de extracción el mismo día (es decir, antes de que se publique una nueva versión cercana en PyPI).

source: Publishing a pre-release
es: Publicar un prelanzamiento

source: Pre-release naming
es: Nomenclatura previa al lanzamiento

source: PyPI supports pre-releases (alpha, beta, release candiate). Pre-releases MUST use one of the following naming patterns:
es: PyPI admite versiones preliminares (alfa, beta, versión candidata). Los prelanzamientos DEBEN utilizar uno de los siguientes patrones de nomenclatura:

source: Alpha: ``MAJOR.MINOR.PATCHaN``
es: Alfa: ``MAJOR.MENOR.PATCHaN``

source: Beta: ``MAJOR.MINOR.PATCHbN``
es: Beta: ``MAJOR.MENOR.PATCHbN``

source: Release candiate (RC): ``MAJOR.MINOR.PATCHrcN``
es: Candidato de liberación (RC): ``MAJOR.MINOR.PATCHrcN``

source: Examples include:
es: Ejemplos incluyen:

source: This is in line with PEP-440 and the recommendations from the Python Packaging Authority (PyPA):
es: Esto está en línea con PEP-440 y las recomendaciones de Python Packaging Authority (PyPA):

source: `PyPA Choosing a versioning scheme <https://packaging.python.org/en/latest/guides/distributing-packages-using-setuptools/#choosing-a-versioning-scheme>`_
es: `PyPA Elección de un esquema de control de versiones <https://packaging.python.org/en/latest/guides/distributing-packages-using-setuptools/#choosing-a-versioning-scheme>`_

source: Note that the approach defined by PyPA is not compatible with SemVer 2.0.0 spec, for details consult the `Semantic Versioning Specification <https://semver.org/spec/v2.0.0.html#spec-item-11>`_ (specifically item 11 on precedence).
es: Tenga en cuenta que el enfoque definido por PyPA no es compatible con la especificación SemVer 2.0.0; para obtener más detalles, consulte la `Especificación de versiones semánticas <https://semver.org/spec/v2.0.0.html#spec-item-11>`_ (específicamente el punto 11 sobre precedencia).

source: Pre-release classification
es: Clasificación previa al lanzamiento

source: Should the next pre-release be called alpha, beta, or release candidate?
es: ¿La próxima versión preliminar debería llamarse alfa, beta o versión candidata?

source: RC: feature complete, no known issues (apart from issues that are classified as "won't fix" for the next stable release) - if no issues surface this will become the next stable release
es: RC: característica completa, no hay problemas conocidos (aparte de los problemas que están clasificados como "no se solucionarán" para la próxima versión estable); si no surgen problemas, esta se convertirá en la próxima versión estable

source: Beta: feature complete, allowed to have known issues
es: Beta: función completa, se permite tener problemas conocidos

source: Alpha: not feature complete, allowed to have known issues
es: Alfa: función no completa, se permite tener problemas conocidos

source: Set up a virtual env
es: Configurar un entorno virtual

source: It is recommended to run your Python setup within a virtual environment. This guide shows three different examples how to create a virtual environment with pyenv virtualenv, poetry, or Anaconda. You can follow the instructions or choose your preferred setup.
es: Se recomienda ejecutar su configuración de Python dentro de un entorno virtual. Esta guía muestra tres ejemplos diferentes de cómo crear un entorno virtual con pyenv virtualenv, poesía o Anaconda. Puede seguir las instrucciones o elegir su configuración preferida.

source: Python Version
es: Versión de Python

source: Flower requires `Python 3.7 <https://docs.python.org/3.7/>`_ or above, we recommend `Python 3.8 <https://docs.python.org/3.8/>`_.
es: Flower requiere `Python 3.7 <https://docs.python.org/3.7/>`_ o superior, recomendamos `Python 3.8 <https://docs.python.org/3.8/>`_.

source: Virutualenv with Pyenv/Virtualenv
es: Virutualenv con Pyenv/Virtualenv

source: One of the recommended virtual environment is `pyenv <https://github.com/pyenv/pyenv>`_/`virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_. Please see `Flower examples <https://github.com/adap/flower/tree/main/examples/>`_ for details.
es: Uno de los entornos virtuales recomendados es `pyenv <https://github.com/pyenv/pyenv>`_/`virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_. Consulte `Ejemplos de flores <https://github.com/adap/flower/tree/main/examples/>`_ para obtener más detalles.

source: Once Pyenv is set up, you can use it to install `Python Version 3.7 <https://docs.python.org/3.7/>`_ or above:
es: Una vez que Pyenv esté configurado, puede usarlo para instalar `Python Versión 3.7 <https://docs.python.org/3.7/>`_ o superior:

source: Create the virtualenv with:
es: Crea el entorno virtual con:

source: Activate the virtualenv by running the following command:
es: Active virtualenv ejecutando el siguiente comando:

source: Virtualenv with Poetry
es: Virtualenv con poesía

source: The Flower examples are based on `Poetry <https://python-poetry.org/docs/>`_ to manage dependencies. After installing Poetry you simply create a virtual environment with:
es: Los ejemplos de Flower se basan en `Poetry <https://python-poetry.org/docs/>`_ para gestionar dependencias. Después de instalar Poetry, simplemente crea un entorno virtual con:
