Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Observe that these functions encapsulate regular training and test loops and provide :code:`fit` and :code:`evaluate` with final statistics for each round. You could substitute them with your custom train and test loops and change the network architecture, and the entire example would still work flawlessly. As a matter of fact, why not try and modify the code to an example of your liking?
es: Observe que estas funciones encapsulan bucles regulares de entrenamiento y prueba y proporcionan :code:`fit` y :code:`evaluate` con estadísticas finales para cada ronda. Podría sustituirlos con su tren personalizado y bucles de prueba y cambiar la arquitectura de la red, y todo el ejemplo seguiría funcionando perfectamente. De hecho, ¿por qué no intentas modificar el código con un ejemplo de tu agrado?

source: Give It a Try
es: Darle una oportunidad

source: Looking through the quickstart code description above will have given a good understanding of how *clients* and *servers* work in Flower, how to run a simple experiment, and the internals of a client wrapper. Here are a few things you could try on your own and get more experience with Flower:
es: Examinar la descripción del código de inicio rápido anterior le habrá proporcionado una buena comprensión de cómo funcionan los *clientes* y los *servidores* en Flower, cómo ejecutar un experimento simple y los aspectos internos de un contenedor de cliente. Aquí hay algunas cosas que puedes probar por tu cuenta y adquirir más experiencia con Flower:

source: Try and change :code:`PytorchMNISTClient` so it can accept different architectures.
es: Intente cambiar :code:`PytorchMNISTClient` para que pueda aceptar diferentes arquitecturas.

source: Modify the :code:`train` function so that it accepts different optimizers
es: Modifique la función :code:`train` para que acepte diferentes optimizadores

source: Modify the :code:`test` function so that it proves not only the top-1 (regular accuracy) but also the top-5 accuracy?
es: ¿Modificar la función :code:`test` para que demuestre no solo la precisión del top 1 (precisión regular) sino también la del top 5?

source: Go larger! Try to adapt the code to larger images and datasets. Why not try training on ImageNet with a ResNet-50?
es: ¡Vaya más grande! Intente adaptar el código a imágenes y conjuntos de datos más grandes. ¿Por qué no intentar entrenar en ImageNet con un ResNet-50?

source: You are ready now. Enjoy learning in a federated way!
es: Ya estás listo. ¡Disfruta aprendiendo de forma federada!

source: Differential privacy
es: Privacidad diferencial

source: Flower provides differential privacy (DP) wrapper classes for the easy integration of the central DP guarantees provided by DP-FedAvg into training pipelines defined in any of the various ML frameworks that Flower is compatible with.
es: Flower proporciona clases contenedoras de privacidad diferencial (DP) para la fácil integración de las garantías de DP centrales proporcionadas por DP-FedAvg en canales de capacitación definidos en cualquiera de los diversos marcos de aprendizaje automático con los que Flower es compatible.

source: Please note that these components are still experimental, the correct configuration of DP for a specific task is still an unsolved problem.
es: Tenga en cuenta que estos componentes aún son experimentales y la configuración correcta de DP para una tarea específica aún es un problema sin resolver.

source: The name DP-FedAvg is misleading since it can be applied on top of any FL algorithm that conforms to the general structure prescribed by the FedOpt family of algorithms.
es: El nombre DP-FedAvg es engañoso ya que puede aplicarse sobre cualquier algoritmo FL que se ajuste a la estructura general prescrita por la familia de algoritmos FedOpt.

source: DP-FedAvg, originally proposed by McMahan et al. [mcmahan]_ and extended by Andrew et al. [andrew]_, is essentially FedAvg with the following modifications.
es: DP-FedAvg, propuesto originalmente por McMahan et al. [mcmahan]_ y ampliado por Andrew et al. [andrew]_, es esencialmente FedAvg con las siguientes modificaciones.

source: **Clipping** : The influence of each client's update is bounded by clipping it. This is achieved by enforcing a cap on the L2 norm of the update, scaling it down if needed.
es: **Recorte**: La influencia de la actualización de cada cliente está limitada por su recorte. Esto se logra imponiendo un límite a la norma L2 de la actualización, reduciéndola si es necesario.

source: **Noising** : Gaussian noise, calibrated to the clipping threshold, is added to the average computed at the server.
es: **Ruido**: el ruido gaussiano, calibrado según el umbral de recorte, se suma al promedio calculado en el servidor.

source: The distribution of the update norm has been shown to vary from task-to-task and to evolve as training progresses. Therefore, we use an adaptive approach [andrew]_ that continuously adjusts the clipping threshold to track a prespecified quantile of the update norm distribution.
es: Se ha demostrado que la distribución de la norma de actualización varía de una tarea a otra y evoluciona a medida que avanza la capacitación. Por lo tanto, utilizamos un enfoque adaptativo [andrew]_ que ajusta continuamente el umbral de recorte para rastrear un cuantil preespecificado de la distribución de la norma de actualización.

source: Simplifying Assumptions
es: Supuestos simplificadores

source: We make (and attempt to enforce) a number of assumptions that must be satisfied to ensure that the training process actually realises the :math:`(\epsilon, \delta)` guarantees the user has in mind when configuring the setup.
es: Hacemos (e intentamos hacer cumplir) una serie de suposiciones que deben cumplirse para garantizar que el proceso de capacitación realmente cumpla con las garantías :math:`(\epsilon, \delta)` que el usuario tiene en mente al configurar la configuración.

source: **Fixed-size subsampling** :Fixed-size subsamples of the clients must be taken at each round, as opposed to variable-sized Poisson subsamples.
es: **Submuestra de tamaño fijo**: Se deben tomar submuestras de tamaño fijo de los clientes en cada ronda, a diferencia de las submuestras de Poisson de tamaño variable.

source: **Unweighted averaging** : The contributions from all the clients must weighted equally in the aggregate to eliminate the requirement for the server to know in advance the sum of the weights of all clients available for selection.
es: **Promedio no ponderado**: Las contribuciones de todos los clientes deben ponderarse igualmente en conjunto para eliminar el requisito de que el servidor conozca de antemano la suma de los pesos de todos los clientes disponibles para su selección.

source: **No client failures** : The set of available clients must stay constant across all rounds of training. In other words, clients cannot drop out or fail.
es: **Sin fallas de clientes**: el conjunto de clientes disponibles debe permanecer constante en todas las rondas de capacitación. En otras palabras, los clientes no pueden abandonar ni fracasar.

source: The first two are useful for eliminating a multitude of complications associated with calibrating the noise to the clipping threshold while the third one is required to comply with the assumptions of the privacy analysis.
es: Los dos primeros son útiles para eliminar multitud de complicaciones asociadas con la calibración del ruido al umbral de recorte, mientras que el tercero debe cumplir con los supuestos del análisis de privacidad.

source: These restrictions are in line with constraints imposed by Andrew et al. [andrew]_.
es: Estas restricciones están en línea con las restricciones impuestas por Andrew et al. [Andrés]_.

source: Customizable Responsibility for Noise injection
es: Responsabilidad personalizable para la inyección de ruido

source: In contrast to other implementations where the addition of noise is performed at the server, you can configure the site of noise injection to better match your threat model. We provide users with the flexibility to set up the training such that each client independently adds a small amount of noise to the clipped update, with the result that simply aggregating the noisy updates is equivalent to the explicit addition of noise to the non-noisy aggregate at the server.
es: A diferencia de otras implementaciones en las que la adición de ruido se realiza en el servidor, puede configurar el sitio de inyección de ruido para que coincida mejor con su modelo de amenaza. Brindamos a los usuarios la flexibilidad de configurar la capacitación de modo que cada cliente agregue de forma independiente una pequeña cantidad de ruido a la actualización recortada, con el resultado de que simplemente agregar las actualizaciones ruidosas equivale a agregar explícitamente ruido al agregado no ruidoso. en el servidor.

source: To be precise, if we let :math:`m` be the number of clients sampled each round and :math:`\sigma_\Delta` be the scale of the total Gaussian noise that needs to be added to the sum of the model updates, we can use simple maths to show that this is equivalent to each client adding noise with scale :math:`\sigma_\Delta/\sqrt{m}`.
es: Para ser precisos, si dejamos que :math:`m` sea el número de clientes muestreados en cada ronda y :math:`\sigma_\Delta` sea la escala del ruido gaussiano total que debe agregarse a la suma del modelo actualizaciones, podemos usar matemáticas simples para mostrar que esto es equivalente a que cada cliente agregue ruido con escala :math:`\sigma_\Delta/\sqrt{m}`.

source: Wrapper-based approach
es: Enfoque basado en contenedor

source: Introducing DP to an existing workload can be thought of as adding an extra layer of security around it. This inspired us to provide the additional server and client-side logic needed to make the training process differentially private as wrappers for instances of the :code:`Strategy` and :code:`NumPyClient` abstract classes respectively. This wrapper-based approach has the advantage of being easily composable with other wrappers that someone might contribute to the Flower library in the future, e.g., for secure aggregation. Using Inheritance instead can be tedious because that would require the creation of new sub- classes every time a new class implementing :code:`Strategy` or :code:`NumPyClient` is defined.
es: Se puede considerar que la introducción de DP a una carga de trabajo existente agrega una capa adicional de seguridad a su alrededor. Esto nos inspiró a proporcionar la lógica adicional del lado del servidor y del cliente necesaria para hacer que el proceso de capacitación sea diferencialmente privado como envoltorios para instancias de las clases abstractas :code:`Strategy` y :code:`NumPyClient` respectivamente. Este enfoque basado en contenedores tiene la ventaja de ser fácilmente componible con otros contenedores que alguien podría contribuir a la biblioteca Flower en el futuro, por ejemplo, para una agregación segura. Usar Herencia en su lugar puede ser tedioso porque requeriría la creación de nuevas subclases cada vez que se define una nueva clase que implemente :code:`Strategy` o :code:`NumPyClient`.

source: Server-side logic
es: Lógica del lado del servidor

source: The first version of our solution was to define a decorator whose constructor accepted, among other things, a boolean valued variable indicating whether adaptive clipping was to be enabled or not. We quickly realized that this would clutter its :code:`__init__()` function with variables corresponding to hyperparameters of adaptive clipping that would remain unused when it was disabled. A cleaner implementation could be achieved by splitting the functionality into two decorators, :code:`DPFedAvgFixed` and :code:`DPFedAvgAdaptive`, with the latter sub- classing the former. The constructors for both classes accept a boolean parameter :code:`server_side_noising`, which, as the name suggests, determines where noising is to be performed.
es: La primera versión de nuestra solución fue definir un decorador cuyo constructor aceptara, entre otras cosas, una variable con valor booleano que indicaba si el recorte adaptativo debía habilitarse o no. Rápidamente nos dimos cuenta de que esto saturaría su función :code:`__init__()` con variables correspondientes a hiperparámetros de recorte adaptativo que permanecerían sin uso cuando estuviera deshabilitado. Se podría lograr una implementación más limpia dividiendo la funcionalidad en dos decoradores, :code:`DPFedAvgFixed` y :code:`DPFedAvgAdaptive`, siendo el último una subclasificación del primero. Los constructores de ambas clases aceptan un parámetro booleano :code:`server_side_noising`, que, como sugiere el nombre, determina dónde se realizará el ruido.

source: DPFedAvgFixed
es: DPFedPromedioFijo

source: The server-side capabilities required for the original version of DP-FedAvg, i.e., the one which performed fixed clipping, can be completely captured with the help of wrapper logic for just the following two methods of the :code:`Strategy` abstract class.
es: Las capacidades del lado del servidor requeridas para la versión original de DP-FedAvg, es decir, la que realizaba un recorte fijo, se pueden capturar completamente con la ayuda de la lógica contenedora solo para los dos métodos siguientes de la clase abstracta :code:`Strategy` .

source: :code:`configure_fit()` : The config dictionary being sent by the wrapped :code:`Strategy` to each client needs to be augmented with an additional value equal to the clipping threshold (keyed under :code:`dpfedavg_clip_norm`) and, if :code:`server_side_noising=true`, another one equal to the scale of the Gaussian noise that needs to be added at the client (keyed under :code:`dpfedavg_noise_stddev`). This entails *post*-processing of the results returned by the wrappee's implementation of :code:`configure_fit()`.
es: :code:`configure_fit()`: El diccionario de configuración que envía la :code:`Strategy` empaquetada a cada cliente debe aumentarse con un valor adicional igual al umbral de recorte (ingresado en :code:`dpfedavg_clip_norm`) y , si :code:`server_side_noising=true`, otro igual a la escala del ruido gaussiano que debe agregarse en el cliente (ingresado en :code:`dpfedavg_noise_stddev`). Esto implica un *post* procesamiento de los resultados devueltos por la implementación de wrappee de :code:`configure_fit()`.

source: :code:`aggregate_fit()`: We check whether any of the sampled clients dropped out or failed to upload an update before the round timed out. In that case, we need to abort the current round, discarding any successful updates that were received, and move on to the next one. On the other hand, if all clients responded successfully, we must force the averaging of the updates to happen in an unweighted manner by intercepting the :code:`parameters` field of :code:`FitRes` for each received update and setting it to 1. Furthermore, if :code:`server_side_noising=true`, each update is perturbed with an amount of noise equal to what it would have been subjected to had client-side noising being enabled. This entails *pre*-processing of the arguments to this method before passing them on to the wrappee's implementation of :code:`aggregate_fit()`.
es: :code:`aggregate_fit()`: Comprobamos si alguno de los clientes de la muestra abandonó o no pudo cargar una actualización antes de que se agotara el tiempo de espera de la ronda. En ese caso, debemos cancelar la ronda actual, descartar cualquier actualización exitosa que se haya recibido y pasar a la siguiente. Por otro lado, si todos los clientes respondieron exitosamente, debemos forzar que el promedio de las actualizaciones se realice de manera no ponderada interceptando el campo :code:`parameters` de :code:`FitRes` para cada actualización recibida y configurándolo en 1. Además, si :code:`server_side_noising=true`, cada actualización se perturba con una cantidad de ruido igual a la que habría estado sujeta si el ruido del lado del cliente estuviera habilitado. Esto implica *pre* procesamiento de los argumentos de este método antes de pasarlos a la implementación del wrappee de :code:`aggregate_fit()`.

source: We can't directly change the aggregation function of the wrapped strategy to force it to add noise to the aggregate, hence we simulate client-side noising to implement server-side noising.
es: No podemos cambiar directamente la función de agregación de la estrategia empaquetada para obligarla a agregar ruido al agregado, por lo tanto, simulamos el ruido del lado del cliente para implementar el ruido del lado del servidor.

source: These changes have been put together into a class called :code:`DPFedAvgFixed`, whose constructor accepts the strategy being decorated, the clipping threshold and the number of clients sampled every round as compulsory arguments. The user is expected to specify the clipping threshold since the order of magnitude of the update norms is highly dependent on the model being trained and providing a default value would be misleading. The number of clients sampled at every round is required to calculate the amount of noise that must be added to each individual update, either by the server or the clients.
es: Estos cambios se han reunido en una clase llamada :code:`DPFedAvgFixed`, cuyo constructor acepta la estrategia que se está decorando, el umbral de recorte y el número de clientes muestreados en cada ronda como argumentos obligatorios. Se espera que el usuario especifique el umbral de recorte, ya que el orden de magnitud de las normas de actualización depende en gran medida del modelo que se está entrenando y proporcionar un valor predeterminado sería engañoso. Se requiere la cantidad de clientes muestreados en cada ronda para calcular la cantidad de ruido que se debe agregar a cada actualización individual, ya sea por parte del servidor o de los clientes.

source: DPFedAvgAdaptive
es: DPFedAvgAdaptable

source: The additional functionality required to facilitate adaptive clipping has been provided in :code:`DPFedAvgAdaptive`, a subclass of :code:`DPFedAvgFixed`. It overrides the above-mentioned methods to do the following.
es: La funcionalidad adicional necesaria para facilitar el recorte adaptativo se proporciona en :code:`DPFedAvgAdaptive`, una subclase de :code:`DPFedAvgFixed`. Anula los métodos mencionados anteriormente para realizar lo siguiente.

source: :code:`configure_fit()` : It intercepts the config dict returned by :code:`super.configure_fit()` to add the key-value pair :code:`dpfedavg_adaptive_clip_enabled:True` to it, which the client interprets as an instruction to include an indicator bit (1 if update norm <= clipping threshold, 0 otherwise) in the results returned by it.
es: :code:`configure_fit()`: intercepta el dictado de configuración devuelto por :code:`super.configure_fit()` para agregarle el par clave-valor :code:`dpfedavg_adaptive_clip_enabled:True`, que el cliente interpreta como un instrucción para incluir un bit indicador (1 si la norma de actualización <= umbral de recorte, 0 en caso contrario) en los resultados que devuelve.

source: :code:`aggregate_fit()` : It follows a call to :code:`super.aggregate_fit()` with one to :code:`__update_clip_norm__()`, a procedure which adjusts the clipping threshold on the basis of the indicator bits received from the sampled clients.
es: :code:`aggregate_fit()` : Sigue una llamada a :code:`super.aggregate_fit()` con uno a :code:`__update_clip_norm__()`, un procedimiento que ajusta el umbral de recorte en base a los bits indicadores recibidos de los clientes de la muestra.

source: Client-side logic
es: Lógica del lado del cliente

source: The client-side capabilities required can be completely captured through wrapper logic for just the :code:`fit()` method of the :code:`NumPyClient` abstract class. To be precise, we need to *post-process* the update computed by the wrapped client to clip it, if necessary, to the threshold value supplied by the server as part of the config dictionary. In addition to this, it may need to perform some extra work if either (or both) of the following keys are also present in the dict.
es: Las capacidades del lado del cliente requeridas se pueden capturar completamente a través de la lógica contenedora solo para el método :code:`fit()` de la clase abstracta :code:`NumPyClient`. Para ser precisos, necesitamos *postprocesar* la actualización calculada por el cliente empaquetado para recortarla, si es necesario, al valor umbral proporcionado por el servidor como parte del diccionario de configuración. Además de esto, es posible que deba realizar algún trabajo adicional si alguna (o ambas) de las siguientes claves también están presentes en el dict.

source: :code:`dpfedavg_noise_stddev` : Generate and add the specified amount of noise to the clipped update.
es: :code:`dpfedavg_noise_stddev`: genera y agrega la cantidad especificada de ruido a la actualización recortada.

source: :code:`dpfedavg_adaptive_clip_enabled` : Augment the metrics dict in the :code:`FitRes` object being returned to the server with an indicator bit, calculated as described earlier.
es: :code:`dpfedavg_adaptive_clip_enabled`: aumenta las métricas dictadas en el :code:`FitRes` objeto que se devuelve al servidor con un bit indicador, calculado como se describió anteriormente.

source: Performing the :math:`(\epsilon, \delta)` analysis
es: Realizar el análisis :math:`(\epsilon, \delta)`

source: Assume you have trained for :math:`n` rounds with sampling fraction :math:`q` and noise multiplier :math:`z`. In order to calculate the :math:`\epsilon` value this would result in for a particular :math:`\delta`, the following script may be used.
es: Suponga que ha entrenado para :math:`n` rondas con fracción de muestreo :math:`q` y multiplicador de ruido :math:`z`. Para calcular el valor :math:`\epsilon` que esto daría como resultado para un :math:`\delta` en particular, se puede utilizar el siguiente script.

source: McMahan, H. Brendan, et al. "Learning differentially private recurrent language models." arXiv preprint arXiv:1710.06963 (2017).
es: McMahan, H. Brendan y col. "Aprendizaje de modelos de lenguaje recurrentes diferencialmente privados". Preimpresión de arXiv arXiv:1710.06963 (2017).

source: Andrew, Galen, et al. "Differentially private learning with adaptive clipping." Advances in Neural Information Processing Systems 34 (2021): 17455-17466.
es: Andrew, Galeno y otros. "Aprendizaje diferencialmente privado con recorte adaptativo". Avances en sistemas de procesamiento de información neuronal 34 (2021): 17455-17466.

source: Federated evaluation
es: Evaluación federada

source: There are two main approaches to evaluating models in federated learning systems: centralized (or server-side) evaluation and federated (or client-side) evaluation.
es: Hay dos enfoques principales para evaluar modelos en sistemas de aprendizaje federados: evaluación centralizada (o del lado del servidor) y evaluación federada (o del lado del cliente).

source: Centralized Evaluation
es: Evaluación Centralizada

source: Built-In Strategies
es: Estrategias integradas

source: All built-in strategies support centralized evaluation by providing an evaluation function during initialization. An evaluation function is any function that can take the current global model parameters as input and return evaluation results:
es: Todas las estrategias integradas admiten la evaluación centralizada al proporcionar una función de evaluación durante la inicialización. Una función de evaluación es cualquier función que pueda tomar los parámetros del modelo global actual como entrada y devolver resultados de evaluación:

source: Custom Strategies
es: Estrategias personalizadas
