Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: The evaluation instructions containing (global) model parameters received from the server and a dictionary of configuration values used to customize the local evaluation process.
es: Las instrucciones de evaluación contienen parámetros del modelo (globales) recibidos del servidor y un diccionario de valores de configuración utilizados para personalizar el proceso de evaluación local.

source: Returns
es: Devoluciones

source: The evaluation result containing the loss on the local dataset and other details such as the number of local data examples used for evaluation.
es: El resultado de la evaluación contiene la pérdida en el conjunto de datos local y otros detalles, como la cantidad de ejemplos de datos locales utilizados para la evaluación.

source: Return type
es: Tipo de devolución

source: Refine the provided parameters using the locally held dataset.
es: Refine los parámetros proporcionados utilizando el conjunto de datos local.

source: The training instructions containing (global) model parameters received from the server and a dictionary of configuration values used to customize the local training process.
es: Las instrucciones de capacitación contienen parámetros del modelo (globales) recibidos del servidor y un diccionario de valores de configuración utilizados para personalizar el proceso de capacitación local.

source: The training result containing updated parameters and other details such as the number of local training examples used for training.
es: El resultado del entrenamiento contiene parámetros actualizados y otros detalles, como la cantidad de ejemplos de entrenamiento locales utilizados para el entrenamiento.

source: Return the current local model parameters.
es: Devuelve los parámetros del modelo local actual.

source: The get parameters instructions received from the server containing a dictionary of configuration values.
es: Las instrucciones de obtención de parámetros recibidas del servidor contienen un diccionario de valores de configuración.

source: The current local model parameters.
es: Los parámetros del modelo local actual.

source: Return set of client's properties.
es: Devuelve el conjunto de propiedades del cliente.

source: The get properties instructions received from the server containing a dictionary of configuration values.
es: Las instrucciones de obtención de propiedades recibidas del servidor contienen un diccionario de valores de configuración.

source: The current client properties.
es: Las propiedades del cliente actual.

source: start_client
es: cliente_inicial

source: Start a Flower client node which connects to a Flower server.
es: Inicie un nodo cliente Flower que se conecte a un servidor Flower.

source: The IPv4 or IPv6 address of the server. If the Flower server runs on the same machine on port 8080, then `server_address` would be `"[::]:8080"`.
es: La dirección IPv4 o IPv6 del servidor. Si el servidor Flower se ejecuta en la misma máquina en el puerto 8080, entonces `server_address` sería `"[::]:8080"`.

source: An implementation of the abstract base class `flwr.client.Client`.
es: Una implementación de la clase base abstracta `flwr.client.Client`.

source: The maximum length of gRPC messages that can be exchanged with the Flower server. The default should be sufficient for most models. Users who train very large models might need to increase this value. Note that the Flower server needs to be started with the same value (see `flwr.server.start_server`), otherwise it will not know about the increased limit and block larger messages.
es: La longitud máxima de los mensajes gRPC que se pueden intercambiar con el servidor Flower. El valor predeterminado debería ser suficiente para la mayoría de los modelos. Es posible que los usuarios que entrenan modelos muy grandes necesiten aumentar este valor. Tenga en cuenta que el servidor Flower debe iniciarse con el mismo valor (consulte `flwr.server.start_server`); de lo contrario, no sabrá sobre el límite aumentado y bloqueará mensajes más grandes.

source: The PEM-encoded root certificates as a byte string or a path string. If provided, a secure connection using the certificates will be established to an SSL-enabled Flower server.
es: Los certificados raíz codificados en PEM como una cadena de bytes o una cadena de ruta. Si se proporciona, se establecerá una conexión segura utilizando los certificados a un servidor Flower habilitado para SSL.

source: DEPRECATED - USE 'transport' INSTEAD. Defines whether or not the client is interacting with the server using the experimental REST API. This feature is experimental, it might change considerably in future versions of Flower.
es: DESPRECADO: UTILICE 'transporte' EN SU LUGAR. Define si el cliente interactúa o no con el servidor mediante la API REST experimental. Esta característica es experimental y podría cambiar considerablemente en futuras versiones de Flower.

source: Configure the transport layer. Allowed values: - 'grpc-bidi': gRPC, bidirectional streaming - 'grpc-rere': gRPC, request-response (experimental) - 'rest': HTTP (experimental)
es: Configurar la capa de transporte. Valores permitidos: - 'grpc-bidi': gRPC, transmisión bidireccional - 'grpc-rere': gRPC, solicitud-respuesta (experimental) - 'rest': HTTP (experimental)

source: Examples
es: Ejemplos

source: Starting a gRPC client with an insecure server connection:
es: Iniciar un cliente gRPC con una conexión de servidor insegura:

source: Starting an SSL-enabled gRPC client:
es: Iniciar un cliente gRPC habilitado para SSL:

source: NumPyClient
es: ClienteNumPy

source: Abstract base class for Flower clients using NumPy.
es: Clase base abstracta para clientes Flower que usan NumPy.

source: The current (global) model parameters.
es: Los parámetros del modelo actual (global).

source: Configuration parameters which allow the server to influence evaluation on the client. It can be used to communicate arbitrary values from the server to the client, for example, to influence the number of examples used for evaluation.
es: Parámetros de configuración que permiten al servidor influir en la evaluación del cliente. Se puede utilizar para comunicar valores arbitrarios del servidor al cliente, por ejemplo, para influir en el número de ejemplos utilizados para la evaluación.

source: * **loss** (*float*) -- The evaluation loss of the model on the local dataset. * **num_examples** (*int*) -- The number of examples used for evaluation. * **metrics** (*Dict[str, Scalar]*) -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary values back to the server.
es: * **pérdida** (*flotación*): la pérdida de evaluación del modelo en el conjunto de datos local. * **num_examples** (*int*) -- El número de ejemplos utilizados para la evaluación. * **metrics** (*Dict[str, Scalar]*): un diccionario que asigna claves de cadena arbitrarias a valores de tipo bool, bytes, float, int o str. Se puede utilizar para comunicar valores arbitrarios al servidor.

source: **loss** (*float*) -- The evaluation loss of the model on the local dataset.
es: **pérdida** (*flotación*): la pérdida de evaluación del modelo en el conjunto de datos local.

source: **num_examples** (*int*) -- The number of examples used for evaluation.
es: **num_examples** (*int*) -- El número de ejemplos utilizados para la evaluación.

source: **metrics** (*Dict[str, Scalar]*) -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary values back to the server.
es: **metrics** (*Dict[str, Scalar]*): un diccionario que asigna claves de cadena arbitrarias a valores de tipo bool, bytes, float, int o str. Se puede utilizar para comunicar valores arbitrarios al servidor.

source: The previous return type format (int, float, float) and the extended format (int, float, float, Dict[str, Scalar]) have been deprecated and removed since Flower 0.19.
es: El formato de tipo de retorno anterior (int, float, float) y el formato extendido (int, float, float, Dict[str, Scalar]) han quedado obsoletos y eliminados desde Flower 0.19.

source: Train the provided parameters using the locally held dataset.
es: Entrene los parámetros proporcionados utilizando el conjunto de datos local.

source: Configuration parameters which allow the server to influence training on the client. It can be used to communicate arbitrary values from the server to the client, for example, to set the number of (local) training epochs.
es: Parámetros de configuración que permiten al servidor influir en el entrenamiento del cliente. Se puede utilizar para comunicar valores arbitrarios desde el servidor al cliente, por ejemplo, para establecer el número de épocas de entrenamiento (locales).

source: * **parameters** (*NDArrays*) -- The locally updated model parameters. * **num_examples** (*int*) -- The number of examples used for training. * **metrics** (*Dict[str, Scalar]*) -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary values back to the server.
es: * **parámetros** (*NDArrays*): los parámetros del modelo actualizados localmente. * **num_examples** (*int*) -- El número de ejemplos utilizados para el entrenamiento. * **metrics** (*Dict[str, Scalar]*): un diccionario que asigna claves de cadena arbitrarias a valores de tipo bool, bytes, float, int o str. Se puede utilizar para comunicar valores arbitrarios al servidor.

source: **parameters** (*NDArrays*) -- The locally updated model parameters.
es: **parámetros** (*NDArrays*): los parámetros del modelo actualizados localmente.

source: **num_examples** (*int*) -- The number of examples used for training.
es: **num_examples** (*int*) -- El número de ejemplos utilizados para el entrenamiento.

source: Configuration parameters requested by the server. This can be used to tell the client which parameters are needed along with some Scalar attributes.
es: Parámetros de configuración solicitados por el servidor. Esto se puede utilizar para indicarle al cliente qué parámetros se necesitan junto con algunos atributos escalares.

source: **parameters** -- The local model parameters as a list of NumPy ndarrays.
es: **parámetros**: los parámetros del modelo local como una lista de NumPy ndarrays.

source: Return a client's set of properties.
es: Devuelve el conjunto de propiedades de un cliente.

source: Configuration parameters requested by the server. This can be used to tell the client which properties are needed along with some Scalar attributes.
es: Parámetros de configuración solicitados por el servidor. Esto se puede utilizar para indicarle al cliente qué propiedades se necesitan junto con algunos atributos escalares.

source: **properties** -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary property values back to the server.
es: **propiedades**: un diccionario que asigna claves de cadena arbitrarias a valores de tipo bool, bytes, float, int o str. Se puede utilizar para comunicar valores de propiedad arbitrarios al servidor.

source: start_numpy_client
es: inicio_numpy_cliente

source: Start a Flower NumPyClient which connects to a gRPC server.
es: Inicie un Flower NumPyClient que se conecte a un servidor gRPC.

source: An implementation of the abstract base class `flwr.client.NumPyClient`.
es: Una implementación de la clase base abstracta `flwr.client.NumPyClient`.

source: Starting a client with an insecure server connection:
es: Iniciar un cliente con una conexión de servidor insegura:

source: Starting a SSL-enabled client:
es: Iniciar un cliente habilitado para SSL:

source: start_simulation
es: inicio_simulación

source: Start a Ray-based Flower simulation server.
es: Inicie un servidor de simulación de flores basado en Ray.

source: A function creating client instances. The function must take a single `str` argument called `cid`. It should return a single client instance of type ClientLike. Note that the created client instances are ephemeral and will often be destroyed after a single method invocation. Since client instances are not long-lived, they should not attempt to carry state over method invocations. Any state required by the instance (model, dataset, hyperparameters, ...) should be (re-)created in either the call to `client_fn` or the call to any of the client methods (e.g., load evaluation data in the `evaluate` method itself).
es: Una función que crea instancias de cliente. La función debe tomar un único argumento `str` llamado `cid`. Debería devolver una única instancia de cliente de tipo ClientLike. Tenga en cuenta que las instancias de cliente creadas son efímeras y, a menudo, se destruirán después de una única invocación de método. Dado que las instancias de cliente no tienen una vida útil prolongada, no deben intentar transferir el estado a través de invocaciones de métodos. Cualquier estado requerido por la instancia (modelo, conjunto de datos, hiperparámetros, ...) debe (re)crearse ya sea en la llamada a `client_fn` o en la llamada a cualquiera de los métodos del cliente (por ejemplo, cargar datos de evaluación en ` método de evaluación en sí).

source: The total number of clients in this simulation. This must be set if `clients_ids` is not set and vice-versa.
es: El número total de clientes en esta simulación. Esto debe configurarse si `clients_ids` no está configurado y viceversa.

source: List `client_id`s for each client. This is only required if `num_clients` is not set. Setting both `num_clients` and `clients_ids` with `len(clients_ids)` not equal to `num_clients` generates an error.
es: Enumere los `client_id` para cada cliente. Esto solo es necesario si no se establece `num_clients`. Configurar `num_clients` y `clients_ids` con `len(clients_ids)` distinto de `num_clients` genera un error.

source: "num_gpus": 0.0}` CPU and GPU resources for a single client. Supported keys are `num_cpus` and `num_gpus`. To understand the GPU utilization caused by `num_gpus`, as well as using custom resources, please consult the Ray documentation.
es: "num_gpus": 0.0}` Recursos de CPU y GPU para un solo cliente. Las claves admitidas son `num_cpus` y `num_gpus`. Para comprender la utilización de GPU causada por `num_gpus`, así como el uso de recursos personalizados, consulte la documentación de Ray.

source: An implementation of the abstract base class `flwr.server.Server`. If no instance is provided, then `start_server` will create one.
es: Una implementación de la clase base abstracta `flwr.server.Server`. Si no se proporciona ninguna instancia, entonces `start_server` creará una.

source: Currently supported values are `num_rounds` (int, default: 1) and `round_timeout` in seconds (float, default: None).
es: Los valores admitidos actualmente son `num_rounds` (int, predeterminado: 1) y `round_timeout` en segundos (flotante, predeterminado: Ninguno).

source: An implementation of the abstract base class `flwr.server.Strategy`. If no strategy is provided, then `start_server` will use `flwr.server.strategy.FedAvg`.
es: Una implementación de la clase base abstracta `flwr.server.Strategy`. Si no se proporciona ninguna estrategia, entonces `start_server` usará `flwr.server.strategy.FedAvg`.

source: An implementation of the abstract base class `flwr.server.ClientManager`. If no implementation is provided, then `start_simulation` will use `flwr.server.client_manager.SimpleClientManager`.
es: Una implementación de la clase base abstracta `flwr.server.ClientManager`. Si no se proporciona ninguna implementación, entonces `start_simulation` usará `flwr.server.client_manager.SimpleClientManager`.

source: Optional dictionary containing arguments for the call to `ray.init`. If ray_init_args is None (the default), Ray will be initialized with the following default args: { "ignore_reinit_error": True, "include_dashboard": False } An empty dictionary can be used (ray_init_args={}) to prevent any arguments from being passed to ray.init.
es: Diccionario opcional que contiene argumentos para la llamada a `ray.init`. Si ray_init_args es Ninguno (el valor predeterminado), Ray se inicializará con los siguientes argumentos predeterminados: { "ignore_reinit_error": True, "include_dashboard": False } Se puede usar un diccionario vacío (ray_init_args={}) para evitar que se modifiquen los argumentos. pasado a ray.init.

source: Optional dictionary containing arguments for the call to `ray.init`. If ray_init_args is None (the default), Ray will be initialized with the following default args:
es: Diccionario opcional que contiene argumentos para la llamada a `ray.init`. Si ray_init_args es Ninguno (el valor predeterminado), Ray se inicializará con los siguientes argumentos predeterminados:

source: { "ignore_reinit_error": True, "include_dashboard": False }
es: { "ignore_reinit_error": Verdadero, "include_dashboard": Falso }

source: An empty dictionary can be used (ray_init_args={}) to prevent any arguments from being passed to ray.init.
es: Se puede usar un diccionario vacío (ray_init_args={}) para evitar que se pasen argumentos a ray.init.

source: Set to True to prevent `ray.shutdown()` in case `ray.is_initialized()=True`.
es: Establezca en True para evitar `ray.shutdown()` en caso de `ray.is_initialized()=True`.

source: Optionally specify the type of actor to use. The actor object, which persists throughout the simulation, will be the process in charge of running the clients' jobs (i.e. their `fit()` method).
es: Opcionalmente, especifique el tipo de actor que se utilizará. El objeto actor, que persiste durante toda la simulación, será el proceso encargado de ejecutar los trabajos de los clientes (es decir, su método `fit()`).

source: If you want to create your own Actor classes, you might need to pass some input argument. You can use this dictionary for such purpose.
es: Si desea crear sus propias clases de Actor, es posible que necesite pasar algún argumento de entrada. Puede utilizar este diccionario para tal fin.

source: (default: "DEFAULT") Optional string ("DEFAULT" or "SPREAD") for the VCE to choose in which node the actor is placed. If you are an advanced user needed more control you can use lower-level scheduling strategies to pin actors to specific compute nodes (e.g. via NodeAffinitySchedulingStrategy). Please note this is an advanced feature. For all details, please refer to the Ray documentation: https://docs.ray.io/en/latest/ray-core/scheduling/index.html
es: (predeterminado: "DEFAULT") Cadena opcional ("DEFAULT" o "SPREAD") para que el VCE elija en qué nodo se coloca el actor. Si es un usuario avanzado y necesita más control, puede utilizar estrategias de programación de nivel inferior para fijar actores a nodos informáticos específicos (por ejemplo, a través de NodeAffinitySchedulingStrategy). Tenga en cuenta que esta es una característica avanzada. Para obtener todos los detalles, consulte la documentación de Ray: https://docs.ray.io/en/latest/ray-core/scheduling/index.html

source: **hist** -- Object containing metrics from training.
es: **hist** -- Objeto que contiene métricas del entrenamiento.

source: server
es: servidor

source: Flower server.
es: Servidor de flores.

source: server.start_server
es: servidor.start_server

source: Start a Flower server using the gRPC transport layer.
es: Inicie un servidor Flower utilizando la capa de transporte gRPC.

source: The IPv4 or IPv6 address of the server. Defaults to `"[::]:8080"`.
es: La dirección IPv4 o IPv6 del servidor. El valor predeterminado es `"[::]:8080"`.

source: A server implementation, either `flwr.server.Server` or a subclass thereof. If no instance is provided, then `start_server` will create one.
es: Una implementación de servidor, ya sea `flwr.server.Server` o una subclase del mismo. Si no se proporciona ninguna instancia, entonces `start_server` creará una.

source: An implementation of the abstract base class `flwr.server.strategy.Strategy`. If no strategy is provided, then `start_server` will use `flwr.server.strategy.FedAvg`.
es: Una implementación de la clase base abstracta `flwr.server.strategy.Strategy`. Si no se proporciona ninguna estrategia, entonces `start_server` usará `flwr.server.strategy.FedAvg`.

source: An implementation of the abstract base class `flwr.server.ClientManager`. If no implementation is provided, then `start_server` will use `flwr.server.client_manager.SimpleClientManager`.
es: Una implementación de la clase base abstracta `flwr.server.ClientManager`. Si no se proporciona ninguna implementación, entonces `start_server` usará `flwr.server.client_manager.SimpleClientManager`.

source: The maximum length of gRPC messages that can be exchanged with the Flower clients. The default should be sufficient for most models. Users who train very large models might need to increase this value. Note that the Flower clients need to be started with the same value (see `flwr.client.start_client`), otherwise clients will not know about the increased limit and block larger messages.
es: La longitud máxima de los mensajes gRPC que se pueden intercambiar con los clientes de Flower. El valor predeterminado debería ser suficiente para la mayoría de los modelos. Es posible que los usuarios que entrenan modelos muy grandes necesiten aumentar este valor. Tenga en cuenta que los clientes Flower deben iniciarse con el mismo valor (consulte `flwr.client.start_client`); de lo contrario, los clientes no sabrán sobre el límite aumentado y bloquearán mensajes más grandes.

source: Tuple containing root certificate, server certificate, and private key to start a secure SSL-enabled server. The tuple is expected to have three bytes elements in the following order: * CA certificate. * server certificate. * server private key.
es: Tupla que contiene certificado raíz, certificado de servidor y clave privada para iniciar un servidor seguro habilitado para SSL. Se espera que la tupla tenga elementos de tres bytes en el siguiente orden: * Certificado CA. * certificado de servidor. * clave privada del servidor.

source: Tuple containing root certificate, server certificate, and private key to start a secure SSL-enabled server. The tuple is expected to have three bytes elements in the following order:
es: Tupla que contiene certificado raíz, certificado de servidor y clave privada para iniciar un servidor seguro habilitado para SSL. Se espera que la tupla tenga elementos de tres bytes en el siguiente orden:

source: CA certificate.
es: Certificado de CA.

source: server certificate.
es: certificado del servidor.

source: server private key.
es: clave privada del servidor.

source: **hist** -- Object containing training and evaluation metrics.
es: **hist** -- Objeto que contiene métricas de capacitación y evaluación.

source: Starting an insecure server:
es: Iniciar un servidor inseguro:

source: Starting an SSL-enabled server:
es: Iniciar un servidor habilitado para SSL:

source: server.strategy
es: estrategia.servidor

source: Contains the strategy abstraction and different implementations.
es: Contiene la abstracción de la estrategia y diferentes implementaciones.

source: server.strategy.Strategy
es: servidor.estrategia.estrategia

source: Abstract base class for server strategy implementations.
es: Clase base abstracta para implementaciones de estrategias de servidor.

source: Aggregate evaluation results.
es: Resultados agregados de la evaluación.

source: The current round of federated learning.
es: La ronda actual de aprendizaje federado.
