Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Let's create a new file called :code:`jax_training.py` with all the components required for a traditional (centralized) linear regression training. First, the JAX packages :code:`jax` and :code:`jaxlib` need to be imported. In addition, we need to import :code:`sklearn` since we use :code:`make_regression` for the dataset and :code:`train_test_split` to split the dataset into a training and test set. You can see that we do not yet import the :code:`flwr` package for federated learning. This will be done later.
es: Creemos un nuevo archivo llamado :code:`jax_training.py` con todos los componentes necesarios para un entrenamiento de regresión lineal tradicional (centralizado). Primero, es necesario importar los paquetes JAX :code:`jax` y :code:`jaxlib`. Además, necesitamos importar :code:`sklearn` ya que usamos :code:`make_regression` para el conjunto de datos y :code:`train_test_split` para dividir el conjunto de datos en un conjunto de entrenamiento y prueba. Puede ver que todavía no importamos el paquete :code:`flwr` para el aprendizaje federado. Esto se hará más tarde.

source: The :code:`load_data()` function loads the mentioned training and test sets.
es: La función :code:`load_data()` carga los conjuntos de entrenamiento y prueba mencionados.

source: The model architecture (a very simple :code:`Linear Regression` model) is defined in :code:`load_model()`.
es: La arquitectura del modelo (un modelo :code:`Regresión lineal` muy simple) se define en :code:`load_model()`.

source: We now need to define the training (function :code:`train()`), which loops over the training set and measures the loss (function :code:`loss_fn()`) for each batch of training examples. The loss function is separate since JAX takes derivatives with a :code:`grad()` function (defined in the :code:`main()` function and called in :code:`train()`).
es: Ahora necesitamos definir el entrenamiento (función :code:`train()`), que recorre el conjunto de entrenamiento y mide la pérdida (función :code:`loss_fn()`) para cada lote de ejemplos de entrenamiento. La función de pérdida está separada ya que JAX toma derivadas con una función :code:`grad()` (definida en la función :code:`main()` y llamada en :code:`train()`).

source: The evaluation of the model is defined in the function :code:`evaluation()`. The function takes all test examples and measures the loss of the linear regression model.
es: La evaluación del modelo se define en la función :code:`evaluación()`. La función toma todos los ejemplos de prueba y mide la pérdida del modelo de regresión lineal.

source: Having defined the data loading, model architecture, training, and evaluation we can put everything together and train our model using JAX. As already mentioned, the :code:`jax.grad()` function is defined in :code:`main()` and passed to :code:`train()`.
es: Una vez definida la carga de datos, la arquitectura del modelo, el entrenamiento y la evaluación, podemos juntar todo y entrenar nuestro modelo usando JAX. Como ya se mencionó, la función :code:`jax.grad()` se define en :code:`main()` y se pasa a :code:`train()`.

source: You can now run your (centralized) JAX linear regression workload:
es: Ahora puede ejecutar su carga de trabajo de regresión lineal JAX (centralizada):

source: So far this should all look fairly familiar if you've used JAX before. Let's take the next step and use what we've built to create a simple federated learning system consisting of one server and two clients.
es: Hasta ahora, todo esto debería resultarle bastante familiar si ha utilizado JAX antes. Demos el siguiente paso y usemos lo que hemos creado para crear un sistema de aprendizaje federado simple que consta de un servidor y dos clientes.

source: JAX meets Flower
es: JAX se encuentra con Flor

source: The concept of federating an existing workload is always the same and easy to understand. We have to start a *server* and then use the code in :code:`jax_training.py` for the *clients* that are connected to the *server*. The *server* sends model parameters to the clients. The *clients* run the training and update the parameters. The updated parameters are sent back to the *server*, which averages all received parameter updates. This describes one round of the federated learning process, and we repeat this for multiple rounds.
es: El concepto de federar una carga de trabajo existente es siempre el mismo y fácil de entender. Tenemos que iniciar un *servidor* y luego usar el código en :code:`jax_training.py` para los *clientes* que están conectados al *servidor*. El *servidor* envía parámetros del modelo a los clientes. Los *clientes* ejecutan la capacitación y actualizan los parámetros. Los parámetros actualizados se envían de vuelta al *servidor*, que promedia todas las actualizaciones de parámetros recibidas. Esto describe una ronda del proceso de aprendizaje federado y lo repetimos en varias rondas.

source: Our example consists of one *server* and two *clients*. Let's set up :code:`server.py` first. The *server* needs to import the Flower package :code:`flwr`. Next, we use the :code:`start_server` function to start a server and tell it to perform three rounds of federated learning.
es: Nuestro ejemplo consta de un *servidor* y dos *clientes*. Primero configuremos :code:`server.py`. El *servidor* necesita importar el paquete Flower :code:`flwr`. A continuación, usamos la función :code:`start_server` para iniciar un servidor y decirle que realice tres rondas de aprendizaje federado.

source: We can already start the *server*:
es: Ya podemos iniciar el *servidor*:

source: Finally, we will define our *client* logic in :code:`client.py` and build upon the previously defined JAX training in :code:`jax_training.py`. Our *client* needs to import :code:`flwr`, but also :code:`jax` and :code:`jaxlib` to update the parameters on our JAX model:
es: Finalmente, definiremos nuestra lógica de *cliente* en :code:`client.py` y nos basaremos en el entrenamiento JAX previamente definido en :code:`jax_training.py`. Nuestro *cliente* necesita importar :code:`flwr`, pero también :code:`jax` y :code:`jaxlib` para actualizar los parámetros en nuestro modelo JAX:

source: Implementing a Flower *client* basically means implementing a subclass of either :code:`flwr.client.Client` or :code:`flwr.client.NumPyClient`. Our implementation will be based on :code:`flwr.client.NumPyClient` and we'll call it :code:`FlowerClient`. :code:`NumPyClient` is slightly easier to implement than :code:`Client` if you use a framework with good NumPy interoperability (like JAX) because it avoids some of the boilerplate that would otherwise be necessary. :code:`FlowerClient` needs to implement four methods, two methods for getting/setting model parameters, one method for training the model, and one method for testing the model:
es: Implementar un *cliente* Flower básicamente significa implementar una subclase de :code:`flwr.client.Client` o :code:`flwr.client.NumPyClient`. Nuestra implementación se basará en :code:`flwr.client.NumPyClient` y lo llamaremos :code:`FlowerClient`. :code:`NumPyClient` es un poco más fácil de implementar que :code:`Client` si usa un marco con buena interoperabilidad NumPy (como JAX) porque evita parte del texto estándar que de otro modo sería necesario. :code:`FlowerClient` necesita implementar cuatro métodos, dos métodos para obtener/establecer parámetros del modelo, un método para entrenar el modelo y un método para probar el modelo:

source: :code:`set_parameters (optional)`
es: :código:`set_parameters (opcional)`

source: set the model parameters on the local model that are received from the server
es: establecer los parámetros del modelo en el modelo local que se reciben del servidor

source: transform parameters to NumPy :code:`ndarray`'s
es: transformar parámetros a NumPy :code:`ndarray`s

source: loop over the list of model parameters received as NumPy :code:`ndarray`'s (think list of neural network layers)
es: recorra la lista de parámetros del modelo recibidos como NumPy :code:`ndarray` (piense en la lista de capas de redes neuronales)

source: :code:`get_parameters`
es: :código:`get_parameters`

source: get the model parameters and return them as a list of NumPy :code:`ndarray`'s (which is what :code:`flwr.client.NumPyClient` expects)
es: obtener los parámetros del modelo y devolverlos como una lista de NumPy :code:`ndarray` (que es lo que :code:`flwr.client.NumPyClient` espera)

source: :code:`fit`
es: :código:`encajar`

source: update the parameters of the local model with the parameters received from the server
es: actualizar los parámetros del modelo local con los parámetros recibidos del servidor

source: train the model on the local training set
es: entrenar el modelo en el conjunto de entrenamiento local

source: get the updated local model parameters and return them to the server
es: obtener los parámetros del modelo local actualizados y devolverlos al servidor

source: :code:`evaluate`
es: :código:`evaluar`

source: evaluate the updated model on the local test set
es: evaluar el modelo actualizado en el conjunto de prueba local

source: return the local loss to the server
es: devolver la pérdida local al servidor

source: The challenging part is to transform the JAX model parameters from :code:`DeviceArray` to :code:`NumPy ndarray` to make them compatible with `NumPyClient`.
es: La parte desafiante es transformar los parámetros del modelo JAX de :code:`DeviceArray` a :code:`NumPy ndarray` para hacerlos compatibles con `NumPyClient`.

source: The two :code:`NumPyClient` methods :code:`fit` and :code:`evaluate` make use of the functions :code:`train()` and :code:`evaluate()` previously defined in :code:`jax_training.py`. So what we really do here is we tell Flower through our :code:`NumPyClient` subclass which of our already defined functions to call for training and evaluation. We included type annotations to give you a better understanding of the data types that get passed around.
es: Los dos métodos :code:`NumPyClient` :code:`fit` y :code:`evaluate` hacen uso de las funciones :code:`train()` y :code:`evaluate()` previamente definidas en :code: `jax_training.py`. Entonces, lo que realmente hacemos aquí es decirle a Flower a través de nuestra subclase :code:`NumPyClient` cuál de nuestras funciones ya definidas llamar para entrenamiento y evaluación. Incluimos anotaciones de tipo para brindarle una mejor comprensión de los tipos de datos que se transmiten.

source: Having defined the federation process, we can run it.
es: Habiendo definido el proceso de federación, podemos ejecutarlo.

source: And that's it. You can now open two additional terminal windows and run
es: Y eso es. Ahora puede abrir dos ventanas de terminal adicionales y ejecutar

source: in each window (make sure that the server is still running before you do so) and see your JAX project run federated learning across two clients. Congratulations!
es: en cada ventana (asegúrese de que el servidor aún esté ejecutándose antes de hacerlo) y vea cómo su proyecto JAX ejecuta el aprendizaje federado en dos clientes. ¡Felicidades!

source: The source code of this example was improved over time and can be found here: `Quickstart JAX <https://github.com/adap/flower/blob/main/examples/quickstart-jax>`_. Our example is somewhat over-simplified because both clients load the same dataset.
es: El código fuente de este ejemplo se mejoró con el tiempo y se puede encontrar aquí: `Quickstart JAX <https://github.com/adap/flower/blob/main/examples/quickstart-jax>`_. Nuestro ejemplo está algo demasiado simplificado porque ambos clientes cargan el mismo conjunto de datos.

source: You're now prepared to explore this topic further. How about using a more sophisticated model or using a different dataset? How about adding more clients?
es: Ahora está preparado para explorar este tema más a fondo. ¿Qué tal utilizar un modelo más sofisticado o utilizar un conjunto de datos diferente? ¿Qué tal agregar más clientes?

source: Example: MXNet - Run MXNet Federated
es: Ejemplo: MXNet: ejecutar MXNet federado

source: This tutorial will show you how to use Flower to build a federated version of an existing MXNet workload. We are using MXNet to train a Sequential model on the MNIST dataset. We will structure the example similar to our `PyTorch - From Centralized To Federated <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ walkthrough. MXNet and PyTorch are very similar and a very good comparison between MXNet and PyTorch is given `here <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/getting-started/to-mxnet/pytorch.html>`_. First, we build a centralized training approach based on the `Handwritten Digit Recognition <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_ tutorial. Then, we build upon the centralized training code to run the training in a federated fashion.
es: Este tutorial le mostrará cómo utilizar Flower para crear una versión federada de una carga de trabajo MXNet existente. Estamos utilizando MXNet para entrenar un modelo secuencial en el conjunto de datos MNIST. Estructuraremos el ejemplo de manera similar a nuestro tutorial `PyTorch - De centralizado a federado <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. MXNet y PyTorch son muy similares y se ofrece una muy buena comparación entre MXNet y PyTorch "aquí <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/getting-started/to- mxnet/pytorch.html>`_. Primero, creamos un enfoque de capacitación centralizado basado en el `Reconocimiento de dígitos escritos a mano <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/packages/gluon/image/mnist.html> `_tutorial. Luego, nos basamos en el código de capacitación centralizado para ejecutar la capacitación de forma federada.

source: Before we start setting up our MXNet example, we install the :code:`mxnet` and :code:`flwr` packages:
es: Antes de comenzar a configurar nuestro ejemplo MXNet, instalamos los paquetes :code:`mxnet` y :code:`flwr`:

source: MNIST Training with MXNet
es: Entrenamiento MNIST con MXNet

source: We begin with a brief description of the centralized training code based on a :code:`Sequential` model. If you want a more in-depth explanation of what's going on then have a look at the official `MXNet tutorial <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/>`_.
es: Comenzamos con una breve descripción del código de entrenamiento centralizado basado en un modelo :code:`Sequential`. Si desea una explicación más detallada de lo que está sucediendo, consulte el `tutorial oficial de MXNet <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/>` _.

source: Let's create a new file called:code:`mxnet_mnist.py` with all the components required for a traditional (centralized) MNIST training. First, the MXNet package :code:`mxnet` needs to be imported. You can see that we do not yet import the :code:`flwr` package for federated learning. This will be done later.
es: Creemos un nuevo archivo llamado: código:`mxnet_mnist.py` con todos los componentes necesarios para una capacitación MNIST tradicional (centralizada). Primero, es necesario importar el paquete MXNet :code:`mxnet`. Puede ver que todavía no importamos el paquete :code:`flwr` para el aprendizaje federado. Esto se hará más tarde.

source: The :code:`load_data()` function loads the MNIST training and test sets.
es: La función :code:`load_data()` carga los conjuntos de prueba y entrenamiento MNIST.

source: As already mentioned, we will use the MNIST dataset for this machine learning workload. The model architecture (a very simple :code:`Sequential` model) is defined in :code:`model()`.
es: Como ya se mencionó, utilizaremos el conjunto de datos MNIST para esta carga de trabajo de aprendizaje automático. La arquitectura del modelo (un modelo :code:`Sequential` muy simple) se define en :code:`model()`.

source: We now need to define the training (function :code:`train()`) which loops over the training set and measures the loss for each batch of training examples.
es: Ahora necesitamos definir el entrenamiento (función :code:`train()`) que recorre el conjunto de entrenamiento y mide la pérdida para cada lote de ejemplos de entrenamiento.

source: The evaluation of the model is defined in function :code:`test()`. The function loops over all test samples and measures the loss and accuracy of the model based on the test dataset.
es: La evaluación del modelo se define en la función :code:`test()`. La función recorre todas las muestras de prueba y mide la pérdida y precisión del modelo en función del conjunto de datos de prueba.

source: Having defined the data loading, model architecture, training, and evaluation we can put everything together and train our model on MNIST. Note that the GPU/CPU device for the training and testing is defined within the :code:`ctx` (context).
es: Una vez definida la carga de datos, la arquitectura del modelo, el entrenamiento y la evaluación, podemos juntar todo y entrenar nuestro modelo en MNIST. Tenga en cuenta que el dispositivo GPU/CPU para el entrenamiento y las pruebas se define dentro del :code:`ctx` (contexto).

source: You can now run your (centralized) MXNet machine learning workload:
es: Ahora puede ejecutar su carga de trabajo de aprendizaje automático MXNet (centralizada):

source: So far this should all look fairly familiar if you've used MXNet (or even PyTorch) before. Let's take the next step and use what we've built to create a simple federated learning system consisting of one server and two clients.
es: Hasta ahora, todo esto debería resultarle bastante familiar si ha utilizado MXNet (o incluso PyTorch) antes. Demos el siguiente paso y usemos lo que hemos creado para crear un sistema de aprendizaje federado simple que consta de un servidor y dos clientes.

source: MXNet meets Flower
es: MXNet se encuentra con Flor

source: So far, it was not easily possible to use MXNet workloads for federated learning because federated learning is not supported in MXNet. Since Flower is fully agnostic towards the underlying machine learning framework, it can be used to federated arbitrary machine learning workloads. This section will show you how Flower can be used to federate our centralized MXNet workload.
es: Hasta ahora, no era posible utilizar cargas de trabajo MXNet para el aprendizaje federado porque el aprendizaje federado no es compatible con MXNet. Dado que Flower es totalmente independiente del marco de aprendizaje automático subyacente, se puede utilizar para cargas de trabajo de aprendizaje automático federadas y arbitrarias. Esta sección le mostrará cómo se puede utilizar Flower para federar nuestra carga de trabajo MXNet centralizada.

source: The concept to federate an existing workload is always the same and easy to understand. We have to start a *server* and then use the code in :code:`mxnet_mnist.py` for the *clients* that are connected to the *server*. The *server* sends model parameters to the clients. The *clients* run the training and update the parameters. The updated parameters are sent back to the *server* which averages all received parameter updates. This describes one round of the federated learning process and we repeat this for multiple rounds.
es: El concepto de federar una carga de trabajo existente es siempre el mismo y fácil de entender. Tenemos que iniciar un *servidor* y luego usar el código en :code:`mxnet_mnist.py` para los *clientes* que están conectados al *servidor*. El *servidor* envía parámetros del modelo a los clientes. Los *clientes* ejecutan la capacitación y actualizan los parámetros. Los parámetros actualizados se envían de vuelta al *servidor* que promedia todas las actualizaciones de parámetros recibidas. Esto describe una ronda del proceso de aprendizaje federado y lo repetimos en varias rondas.

source: Finally, we will define our *client* logic in :code:`client.py` and build upon the previously defined MXNet training in :code:`mxnet_mnist.py`. Our *client* needs to import :code:`flwr`, but also :code:`mxnet` to update the parameters on our MXNet model:
es: Finalmente, definiremos nuestra lógica de *cliente* en :code:`client.py` y nos basaremos en el entrenamiento MXNet previamente definido en :code:`mxnet_mnist.py`. Nuestro *cliente* necesita importar :code:`flwr`, pero también :code:`mxnet` para actualizar los parámetros en nuestro modelo MXNet:

source: Implementing a Flower *client* basically means implementing a subclass of either :code:`flwr.client.Client` or :code:`flwr.client.NumPyClient`. Our implementation will be based on :code:`flwr.client.NumPyClient` and we'll call it :code:`MNISTClient`. :code:`NumPyClient` is slighly easier to implement than :code:`Client` if you use a framework with good NumPy interoperability (like PyTorch or MXNet) because it avoids some of the boilerplate that would otherwise be necessary. :code:`MNISTClient` needs to implement four methods, two methods for getting/setting model parameters, one method for training the model, and one method for testing the model:
es: Implementar un *cliente* Flower básicamente significa implementar una subclase de :code:`flwr.client.Client` o :code:`flwr.client.NumPyClient`. Nuestra implementación se basará en :code:`flwr.client.NumPyClient` y lo llamaremos :code:`MNISTClient`. :code:`NumPyClient` es un poco más fácil de implementar que :code:`Client` si usa un marco con buena interoperabilidad de NumPy (como PyTorch o MXNet) porque evita parte del texto estándar que de otro modo sería necesario. :code:`MNISTClient` necesita implementar cuatro métodos, dos métodos para obtener/establecer parámetros del modelo, un método para entrenar el modelo y un método para probar el modelo:

source: transform MXNet :code:`NDArray`'s to NumPy :code:`ndarray`'s
es: transformar MXNet :código:`NDArray`'s a NumPy :código:`ndarray`s

source: get the updated local model weights and return them to the server
es: obtener los pesos del modelo local actualizados y devolverlos al servidor

source: return the local loss and accuracy to the server
es: devolver la pérdida local y la precisión al servidor

source: The challenging part is to transform the MXNet parameters from :code:`NDArray` to :code:`NumPy Arrays` to make it readable for Flower.
es: La parte desafiante es transformar los parámetros MXNet de :code:`NDArray` a :code:`NumPy Arrays` para que sean legibles para Flower.

source: The two :code:`NumPyClient` methods :code:`fit` and :code:`evaluate` make use of the functions :code:`train()` and :code:`test()` previously defined in :code:`mxnet_mnist.py`. So what we really do here is we tell Flower through our :code:`NumPyClient` subclass which of our already defined functions to call for training and evaluation. We included type annotations to give you a better understanding of the data types that get passed around.
es: Los dos métodos :code:`NumPyClient` :code:`fit` y :code:`evaluate` hacen uso de las funciones :code:`train()` y :code:`test()` previamente definidas en :code: `mxnet_mnist.py`. Entonces, lo que realmente hacemos aquí es decirle a Flower a través de nuestra subclase :code:`NumPyClient` cuál de nuestras funciones ya definidas llamar para entrenamiento y evaluación. Incluimos anotaciones de tipo para brindarle una mejor comprensión de los tipos de datos que se transmiten.

source: Having defined data loading, model architecture, training, and evaluation we can put everything together and train our :code:`Sequential` model on MNIST.
es: Habiendo definido la carga de datos, la arquitectura del modelo, el entrenamiento y la evaluación, podemos juntar todo y entrenar nuestro modelo :code:`Sequential` en MNIST.
