Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Python 3.10 is the latest stable release of Python and Python 3.11 is due to be released in October. This Flower release adds experimental support for both Python versions.
es: Python 3.10 es la última versión estable de Python y Python 3.11 se lanzará en octubre. Esta versión de Flower agrega soporte experimental para ambas versiones de Python.

source: **Aggregate custom metrics through user-provided functions** ([#1144](https://github.com/adap/flower/pull/1144))
es: **Agregue métricas personalizadas a través de funciones proporcionadas por el usuario** ([#1144](https://github.com/adap/flower/pull/1144))

source: Custom metrics (e.g., `accuracy`) can now be aggregated without having to customize the strategy. Built-in strategies support two new arguments, `fit_metrics_aggregation_fn` and `evaluate_metrics_aggregation_fn`, that allow passing custom metric aggregation functions.
es: Ahora se pueden agregar métricas personalizadas (por ejemplo, "precisión") sin tener que personalizar la estrategia. Las estrategias integradas admiten dos nuevos argumentos, `fit_metrics_aggregation_fn` y `evaluate_metrics_aggregation_fn`, que permiten pasar funciones de agregación de métricas personalizadas.

source: **User-configurable round timeout** ([#1162](https://github.com/adap/flower/pull/1162))
es: **Tiempo de espera de ronda configurable por el usuario** ([#1162](https://github.com/adap/flower/pull/1162))

source: A new configuration value allows the round timeout to be set for `start_server` and `start_simulation`. If the `config` dictionary contains a `round_timeout` key (with a `float` value in seconds), the server will wait *at least* `round_timeout` seconds before it closes the connection.
es: Un nuevo valor de configuración permite establecer el tiempo de espera de la ronda para `start_server` y `start_simulation`. Si el diccionario `config` contiene una clave `round_timeout` (con un valor `float` en segundos), el servidor esperará *al menos* segundos `round_timeout` antes de cerrar la conexión.

source: **Enable both federated evaluation and centralized evaluation to be used at the same time in all built-in strategies** ([#1091](https://github.com/adap/flower/pull/1091))
es: **Habilite el uso de la evaluación federada y la evaluación centralizada al mismo tiempo en todas las estrategias integradas** ([#1091](https://github.com/adap/flower/pull/1091))

source: Built-in strategies can now perform both federated evaluation (i.e., client-side) and centralized evaluation (i.e., server-side) in the same round. Federated evaluation can be disabled by setting `fraction_eval` to `0.0`.
es: Las estrategias integradas ahora pueden realizar tanto una evaluación federada (es decir, del lado del cliente) como una evaluación centralizada (es decir, del lado del servidor) en la misma ronda. La evaluación federada se puede deshabilitar configurando `fraction_eval` en `0.0`.

source: **Two new Jupyter Notebook tutorials** ([#1141](https://github.com/adap/flower/pull/1141))
es: **Dos nuevos tutoriales de Jupyter Notebook** ([#1141](https://github.com/adap/flower/pull/1141))

source: Two Jupyter Notebook tutorials (compatible with Google Colab) explain basic and intermediate Flower features:
es: Dos tutoriales de Jupyter Notebook (compatibles con Google Colab) explican las características básicas e intermedias de Flower:

source: *An Introduction to Federated Learning*: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-1-Intro-to-FL-PyTorch.ipynb)
es: *Introducción al aprendizaje federado*: [Abrir en Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-1-Intro-to-FL-PyTorch. ipynb)

source: *Using Strategies in Federated Learning*: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-2-Strategies-in-FL-PyTorch.ipynb)
es: *Uso de estrategias en aprendizaje federado*: [Abrir en Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-2-Strategies-in-FL-PyTorch. ipynb)

source: **New FedAvgM strategy (Federated Averaging with Server Momentum)** ([#1076](https://github.com/adap/flower/pull/1076))
es: **Nueva estrategia FedAvgM (Promedio federado con Server Momentum)** ([#1076](https://github.com/adap/flower/pull/1076))

source: The new `FedAvgM` strategy implements Federated Averaging with Server Momentum \[Hsu et al., 2019\].
es: La nueva estrategia `FedAvgM` implementa el promedio federado con Server Momentum \[Hsu et al., 2019\].

source: **New advanced PyTorch code example** ([#1007](https://github.com/adap/flower/pull/1007))
es: **Nuevo ejemplo de código avanzado de PyTorch** ([#1007](https://github.com/adap/flower/pull/1007))

source: A new code example (`advanced_pytorch`) demonstrates advanced Flower concepts with PyTorch.
es: Un nuevo ejemplo de código (`advanced_pytorch`) demuestra conceptos avanzados de Flower con PyTorch.

source: **New JAX code example** ([#906](https://github.com/adap/flower/pull/906), [#1143](https://github.com/adap/flower/pull/1143))
es: **Nuevo ejemplo de código JAX** ([#906](https://github.com/adap/flower/pull/906), [#1143](https://github.com/adap/flower/pull/ 1143))

source: A new code example (`jax_from_centralized_to_federated`) shows federated learning with JAX and Flower.
es: Un nuevo ejemplo de código (`jax_from_centralized_to_federated`) muestra el aprendizaje federado con JAX y Flower.

source: New option to keep Ray running if Ray was already initialized in `start_simulation` ([#1177](https://github.com/adap/flower/pull/1177))
es: Nueva opción para mantener a Ray ejecutándose si Ray ya estaba inicializado en `start_simulation` ([#1177](https://github.com/adap/flower/pull/1177))

source: Add support for custom `ClientManager` as a `start_simulation` parameter ([#1171](https://github.com/adap/flower/pull/1171))
es: Agregue soporte para `ClientManager` personalizado como parámetro `start_simulation` ([#1171](https://github.com/adap/flower/pull/1171))

source: New documentation for [implementing strategies](https://flower.dev/docs/implementing-strategies.html) ([#1097](https://github.com/adap/flower/pull/1097), [#1175](https://github.com/adap/flower/pull/1175))
es: Nueva documentación para [implementar estrategias](https://flower.dev/docs/implementing-strategies.html) ([#1097](https://github.com/adap/flower/pull/1097), [#1175 ](https://github.com/adap/flower/pull/1175))

source: New mobile-friendly documentation theme ([#1174](https://github.com/adap/flower/pull/1174))
es: Nuevo tema de documentación compatible con dispositivos móviles ([#1174](https://github.com/adap/flower/pull/1174))

source: Limit version range for (optional) `ray` dependency to include only compatible releases (`>=1.9.2,<1.12.0`) ([#1205](https://github.com/adap/flower/pull/1205))
es: Limite el rango de versiones para la dependencia (opcional) de `ray` para incluir solo versiones compatibles (`>=1.9.2,<1.12.0`) ([#1205](https://github.com/adap/flower/pull/ 1205))

source: **Remove deprecated support for Python 3.6** ([#871](https://github.com/adap/flower/pull/871))
es: **Eliminar el soporte obsoleto para Python 3.6** ([#871](https://github.com/adap/flower/pull/871))

source: **Remove deprecated KerasClient** ([#857](https://github.com/adap/flower/pull/857))
es: **Eliminar KerasClient en desuso** ([#857](https://github.com/adap/flower/pull/857))

source: **Remove deprecated no-op extra installs** ([#973](https://github.com/adap/flower/pull/973))
es: **Eliminar instalaciones adicionales obsoletas y no operativas** ([#973](https://github.com/adap/flower/pull/973))

source: **Remove deprecated proto fields from** `FitRes` **and** `EvaluateRes` ([#869](https://github.com/adap/flower/pull/869))
es: **Elimine los campos proto obsoletos de** `FitRes` **y** `EvaluateRes` ([#869](https://github.com/adap/flower/pull/869))

source: **Remove deprecated QffedAvg strategy (replaced by QFedAvg)** ([#1107](https://github.com/adap/flower/pull/1107))
es: **Eliminar la estrategia QffedAvg obsoleta (reemplazada por QFedAvg)** ([#1107](https://github.com/adap/flower/pull/1107))

source: **Remove deprecated DefaultStrategy strategy** ([#1142](https://github.com/adap/flower/pull/1142))
es: **Eliminar la estrategia DefaultStrategy obsoleta** ([#1142](https://github.com/adap/flower/pull/1142))

source: **Remove deprecated support for eval_fn accuracy return value** ([#1142](https://github.com/adap/flower/pull/1142))
es: **Eliminar la compatibilidad obsoleta con el valor de retorno de precisión de eval_fn** ([#1142](https://github.com/adap/flower/pull/1142))

source: **Remove deprecated support for passing initial parameters as NumPy ndarrays** ([#1142](https://github.com/adap/flower/pull/1142))
es: **Eliminar la compatibilidad obsoleta para pasar parámetros iniciales como NumPy ndarrays** ([#1142](https://github.com/adap/flower/pull/1142))

source: **Improved Virtual Client Engine compatibility with Jupyter Notebook / Google Colab** ([#866](https://github.com/adap/flower/pull/866), [#872](https://github.com/adap/flower/pull/872), [#833](https://github.com/adap/flower/pull/833), [#1036](https://github.com/adap/flower/pull/1036))
es: **Compatibilidad mejorada de Virtual Client Engine con Jupyter Notebook/Google Colab** ([#866](https://github.com/adap/flower/pull/866), [#872](https://github.com /adap/flower/pull/872), [#833](https://github.com/adap/flower/pull/833), [#1036](https://github.com/adap/flower/pull /1036))

source: Simulations (using the Virtual Client Engine through `start_simulation`) now work more smoothly on Jupyter Notebooks (incl. Google Colab) after installing Flower with the `simulation` extra (`pip install flwr[simulation]`).
es: Las simulaciones (que utilizan Virtual Client Engine a través de `start_simulation`) ahora funcionan mejor en Jupyter Notebooks (incluido Google Colab) después de instalar Flower con el extra de `simulación` (`pip install flwr[simulación]`).

source: **New Jupyter Notebook code example** ([#833](https://github.com/adap/flower/pull/833))
es: **Nuevo ejemplo de código de Jupyter Notebook** ([#833](https://github.com/adap/flower/pull/833))

source: A new code example (`quickstart_simulation`) demonstrates Flower simulations using the Virtual Client Engine through Jupyter Notebook (incl. Google Colab).
es: Un nuevo ejemplo de código (`quickstart_simulation`) demuestra simulaciones de Flower utilizando Virtual Client Engine a través de Jupyter Notebook (incluido Google Colab).

source: **Client properties (feature preview)** ([#795](https://github.com/adap/flower/pull/795))
es: **Propiedades del cliente (vista previa de la función)** ([#795](https://github.com/adap/flower/pull/795))

source: Clients can implement a new method `get_properties` to enable server-side strategies to query client properties.
es: Los clientes pueden implementar un nuevo método `get_properties` para habilitar estrategias del lado del servidor para consultar las propiedades del cliente.

source: **Experimental Android support with TFLite** ([#865](https://github.com/adap/flower/pull/865))
es: **Soporte experimental de Android con TFLite** ([#865](https://github.com/adap/flower/pull/865))

source: Android support has finally arrived in `main`! Flower is both client-agnostic and framework-agnostic by design. One can integrate arbitrary client platforms and with this release, using Flower on Android has become a lot easier.
es: ¡El soporte para Android finalmente ha llegado a "principal"! Flower es independiente del cliente y del marco por diseño. Se pueden integrar plataformas de clientes arbitrarias y, con esta versión, usar Flower en Android se ha vuelto mucho más fácil.

source: The example uses TFLite on the client side, along with a new `FedAvgAndroid` strategy. The Android client and `FedAvgAndroid` are still experimental, but they are a first step towards a fully-fledged Android SDK and a unified `FedAvg` implementation that integrated the new functionality from `FedAvgAndroid`.
es: El ejemplo utiliza TFLite en el lado del cliente, junto con una nueva estrategia "FedAvgAndroid". El cliente de Android y `FedAvgAndroid` aún son experimentales, pero son un primer paso hacia un SDK de Android completo y una implementación unificada de `FedAvg` que integra la nueva funcionalidad de `FedAvgAndroid`.

source: **Make gRPC keepalive time user-configurable and decrease default keepalive time** ([#1069](https://github.com/adap/flower/pull/1069))
es: **Haga que el tiempo de mantenimiento de actividad de gRPC sea configurable por el usuario y reduzca el tiempo de mantenimiento de actividad predeterminado** ([#1069](https://github.com/adap/flower/pull/1069))

source: The default gRPC keepalive time has been reduced to increase the compatibility of Flower with more cloud environments (for example, Microsoft Azure). Users can configure the keepalive time to customize the gRPC stack based on specific requirements.
es: El tiempo de mantenimiento de actividad predeterminado de gRPC se ha reducido para aumentar la compatibilidad de Flower con más entornos de nube (por ejemplo, Microsoft Azure). Los usuarios pueden configurar el tiempo de actividad para personalizar la pila gRPC según requisitos específicos.

source: **New differential privacy example using Opacus and PyTorch** ([#805](https://github.com/adap/flower/pull/805))
es: **Nuevo ejemplo de privacidad diferencial usando Opacus y PyTorch** ([#805](https://github.com/adap/flower/pull/805))

source: A new code example (`opacus`) demonstrates differentially-private federated learning with Opacus, PyTorch, and Flower.
es: Un nuevo ejemplo de código ("opacus") demuestra el aprendizaje federado diferencialmente privado con Opacus, PyTorch y Flower.

source: **New Hugging Face Transformers code example** ([#863](https://github.com/adap/flower/pull/863))
es: **Nuevo ejemplo de código de Hugging Face Transformers** ([#863](https://github.com/adap/flower/pull/863))

source: A new code example (`quickstart_huggingface`) demonstrates usage of Hugging Face Transformers with Flower.
es: Un nuevo ejemplo de código (`quickstart_huggingface`) demuestra el uso de Hugging Face Transformers con Flower.

source: **New MLCube code example** ([#779](https://github.com/adap/flower/pull/779), [#1034](https://github.com/adap/flower/pull/1034), [#1065](https://github.com/adap/flower/pull/1065), [#1090](https://github.com/adap/flower/pull/1090))
es: **Nuevo ejemplo de código MLCube** ([#779](https://github.com/adap/flower/pull/779), [#1034](https://github.com/adap/flower/pull/ 1034), [#1065](https://github.com/adap/flower/pull/1065), [#1090](https://github.com/adap/flower/pull/1090))

source: A new code example (`quickstart_mlcube`) demonstrates usage of MLCube with Flower.
es: Un nuevo ejemplo de código (`quickstart_mlcube`) demuestra el uso de MLCube con Flower.

source: **SSL-enabled server and client** ([#842](https://github.com/adap/flower/pull/842), [#844](https://github.com/adap/flower/pull/844), [#845](https://github.com/adap/flower/pull/845), [#847](https://github.com/adap/flower/pull/847), [#993](https://github.com/adap/flower/pull/993), [#994](https://github.com/adap/flower/pull/994))
es: **Servidor y cliente habilitados para SSL** ([#842](https://github.com/adap/flower/pull/842), [#844](https://github.com/adap/flower/ pull/844), [#845](https://github.com/adap/flower/pull/845), [#847](https://github.com/adap/flower/pull/847), [ #993](https://github.com/adap/flower/pull/993), [#994](https://github.com/adap/flower/pull/994))

source: SSL enables secure encrypted connections between clients and servers. This release open-sources the Flower secure gRPC implementation to make encrypted communication channels accessible to all Flower users.
es: SSL permite conexiones cifradas seguras entre clientes y servidores. Esta versión abre la implementación gRPC segura de Flower para que los canales de comunicación cifrados sean accesibles para todos los usuarios de Flower.

source: **Updated** `FedAdam` **and** `FedYogi` **strategies** ([#885](https://github.com/adap/flower/pull/885), [#895](https://github.com/adap/flower/pull/895))
es: **Actualizado** `FedAdam` **y** `FedYogi` **estrategias** ([#885](https://github.com/adap/flower/pull/885), [#895](https //github.com/adap/flower/pull/895))

source: `FedAdam` and `FedAdam` match the latest version of the Adaptive Federated Optimization paper.
es: `FedAdam` y `FedAdam` coinciden con la última versión del documento de optimización federada adaptativa.

source: **Initialize** `start_simulation` **with a list of client IDs** ([#860](https://github.com/adap/flower/pull/860))
es: **Inicializar** `start_simulation` **con una lista de ID de clientes** ([#860](https://github.com/adap/flower/pull/860))

source: `start_simulation` can now be called with a list of client IDs (`clients_ids`, type: `List[str]`). Those IDs will be passed to the `client_fn` whenever a client needs to be initialized, which can make it easier to load data partitions that are not accessible through `int` identifiers.
es: Ahora se puede llamar a `start_simulation` con una lista de ID de clientes (`clients_ids`, tipo: `List[str]`). Esos ID se pasarán a `client_fn` siempre que sea necesario inicializar un cliente, lo que puede facilitar la carga de particiones de datos a las que no se puede acceder a través de identificadores `int`.

source: Update `num_examples` calculation in PyTorch code examples in ([#909](https://github.com/adap/flower/pull/909))
es: Actualice el cálculo de `num_examples` en los ejemplos de código de PyTorch en ([#909](https://github.com/adap/flower/pull/909))

source: Expose Flower version through `flwr.__version__` ([#952](https://github.com/adap/flower/pull/952))
es: Exponer la versión de Flower a través de `flwr.__version__` ([#952](https://github.com/adap/flower/pull/952))

source: `start_server` in `app.py` now returns a `History` object containing metrics from training ([#974](https://github.com/adap/flower/pull/974))
es: `start_server` en `app.py` ahora devuelve un objeto `History` que contiene métricas del entrenamiento ([#974](https://github.com/adap/flower/pull/974))

source: Make `max_workers` (used by `ThreadPoolExecutor`) configurable ([#978](https://github.com/adap/flower/pull/978))
es: Haga que `max_workers` (usado por `ThreadPoolExecutor`) sea configurable ([#978](https://github.com/adap/flower/pull/978))

source: Increase sleep time after server start to three seconds in all code examples ([#1086](https://github.com/adap/flower/pull/1086))
es: Aumente el tiempo de suspensión después del inicio del servidor a tres segundos en todos los ejemplos de código ([#1086](https://github.com/adap/flower/pull/1086))

source: Added a new FAQ section to the documentation ([#948](https://github.com/adap/flower/pull/948))
es: Se agregó una nueva sección de preguntas frecuentes a la documentación ([#948](https://github.com/adap/flower/pull/948))

source: And many more under-the-hood changes, library updates, documentation changes, and tooling improvements!
es: ¡Y muchos más cambios internos, actualizaciones de biblioteca, cambios de documentación y mejoras de herramientas!

source: **Removed** `flwr_example` **and** `flwr_experimental` **from release build** ([#869](https://github.com/adap/flower/pull/869))
es: **Eliminado** `flwr_example` **y** `flwr_experimental` **de la versión de lanzamiento** ([#869](https://github.com/adap/flower/pull/869))

source: The packages `flwr_example` and `flwr_experimental` have been deprecated since Flower 0.12.0 and they are not longer included in Flower release builds. The associated extras (`baseline`, `examples-pytorch`, `examples-tensorflow`, `http-logger`, `ops`) are now no-op and will be removed in an upcoming release.
es: Los paquetes `flwr_example` y `flwr_experimental` han quedado obsoletos desde Flower 0.12.0 y ya no se incluyen en las versiones de lanzamiento de Flower. Los extras asociados (`baseline`, `examples-pytorch`, `examples-tensorflow`, `http-logger`, `ops`) ahora no están operativos y se eliminarán en una próxima versión.

source: **Experimental virtual client engine** ([#781](https://github.com/adap/flower/pull/781) [#790](https://github.com/adap/flower/pull/790) [#791](https://github.com/adap/flower/pull/791))
es: **Motor de cliente virtual experimental** ([#781](https://github.com/adap/flower/pull/781) [#790](https://github.com/adap/flower/pull/790 ) [#791](https://github.com/adap/flower/pull/791))

source: One of Flower's goals is to enable research at scale. This release enables a first (experimental) peek at a major new feature, codenamed the virtual client engine. Virtual clients enable simulations that scale to a (very) large number of clients on a single machine or compute cluster. The easiest way to test the new functionality is to look at the two new code examples called `quickstart_simulation` and `simulation_pytorch`.
es: Uno de los objetivos de Flower es permitir la investigación a escala. Esta versión permite un primer vistazo (experimental) a una nueva característica importante, cuyo nombre en código es motor de cliente virtual. Los clientes virtuales permiten simulaciones que se escalan a una (muy) gran cantidad de clientes en una sola máquina o clúster de cómputo. La forma más sencilla de probar la nueva funcionalidad es mirar los dos nuevos ejemplos de código llamados `quickstart_simulation` y `simulation_pytorch`.

source: The feature is still experimental, so there's no stability guarantee for the API. It's also not quite ready for prime time and comes with a few known caveats. However, those who are curious are encouraged to try it out and share their thoughts.
es: La característica aún es experimental, por lo que no hay garantía de estabilidad para la API. Tampoco está listo para el horario de máxima audiencia y viene con algunas advertencias conocidas. Sin embargo, se anima a aquellos que tengan curiosidad a que lo prueben y compartan sus opiniones.

source: **New built-in strategies** ([#828](https://github.com/adap/flower/pull/828) [#822](https://github.com/adap/flower/pull/822))
es: **Nuevas estrategias integradas** ([#828](https://github.com/adap/flower/pull/828) [#822](https://github.com/adap/flower/pull/ 822))

source: FedYogi - Federated learning strategy using Yogi on server-side. Implementation based on https://arxiv.org/abs/2003.00295
es: FedYogi: estrategia de aprendizaje federado que utiliza Yogi en el lado del servidor. Implementación basada en https://arxiv.org/abs/2003.00295

source: FedAdam - Federated learning strategy using Adam on server-side. Implementation based on https://arxiv.org/abs/2003.00295
es: FedAdam: estrategia de aprendizaje federado que utiliza Adam en el lado del servidor. Implementación basada en https://arxiv.org/abs/2003.00295

source: **New PyTorch Lightning code example** ([#617](https://github.com/adap/flower/pull/617))
es: **Nuevo ejemplo de código PyTorch Lightning** ([#617](https://github.com/adap/flower/pull/617))

source: **New Variational Auto-Encoder code example** ([#752](https://github.com/adap/flower/pull/752))
es: **Nuevo ejemplo de código de codificador automático variacional** ([#752](https://github.com/adap/flower/pull/752))

source: **New scikit-learn code example** ([#748](https://github.com/adap/flower/pull/748))
es: **Nuevo ejemplo de código scikit-learn** ([#748](https://github.com/adap/flower/pull/748))

source: **New experimental TensorBoard strategy** ([#789](https://github.com/adap/flower/pull/789))
es: **Nueva estrategia experimental de TensorBoard** ([#789](https://github.com/adap/flower/pull/789))

source: Improved advanced TensorFlow code example ([#769](https://github.com/adap/flower/pull/769))
es: Ejemplo de código avanzado de TensorFlow mejorado ([#769](https://github.com/adap/flower/pull/769))
