Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Successful updates from the previously selected and configured clients. Each pair of `(ClientProxy, FitRes` constitutes a successful update from one of the previously selected clients. Not that not all previously selected clients are necessarily included in this list: a client might drop out and not submit a result. For each client that did not submit an update, there should be an `Exception` in `failures`.
es: Actualizaciones exitosas de los clientes previamente seleccionados y configurados. Cada par de `(ClientProxy, FitRes` constituye una actualización exitosa de uno de los clientes previamente seleccionados. No es que no todos los clientes previamente seleccionados estén necesariamente incluidos en esta lista: un cliente podría abandonar y no enviar un resultado. Para cada cliente que no envió una actualización, debería haber una "Excepción" en "fallos".

source: Exceptions that occurred while the server was waiting for client updates.
es: Excepciones que ocurrieron mientras el servidor esperaba actualizaciones del cliente.

source: **aggregation_result** -- The aggregated evaluation result. Aggregation typically uses some variant of a weighted average.
es: **aggregation_result**: el resultado de la evaluación agregada. La agregación suele utilizar alguna variante de un promedio ponderado.

source: Aggregate training results.
es: Resultados agregados del entrenamiento.

source: Successful updates from the previously selected and configured clients. Each pair of `(ClientProxy, FitRes)` constitutes a successful update from one of the previously selected clients. Not that not all previously selected clients are necessarily included in this list: a client might drop out and not submit a result. For each client that did not submit an update, there should be an `Exception` in `failures`.
es: Actualizaciones exitosas de los clientes previamente seleccionados y configurados. Cada par de `(ClientProxy, FitRes)` constituye una actualización exitosa de uno de los clientes previamente seleccionados. No es que no todos los clientes previamente seleccionados estén necesariamente incluidos en esta lista: un cliente podría abandonar y no enviar un resultado. Para cada cliente que no envió una actualización, debería haber una "Excepción" en "Fallas".

source: **parameters** -- If parameters are returned, then the server will treat these as the new global model parameters (i.e., it will replace the previous parameters with the ones returned from this method). If `None` is returned (e.g., because there were only failures and no viable results) then the server will no update the previous model parameters, the updates received in this round are discarded, and the global model parameters remain the same.
es: **parámetros**: si se devuelven parámetros, el servidor los tratará como los nuevos parámetros del modelo global (es decir, reemplazará los parámetros anteriores con los devueltos por este método). Si se devuelve "Ninguno" (por ejemplo, porque solo hubo fallas y no hubo resultados viables), entonces el servidor no actualizará los parámetros del modelo anterior, las actualizaciones recibidas en esta ronda se descartan y los parámetros del modelo global siguen siendo los mismos.

source: Configure the next round of evaluation.
es: Configurar la siguiente ronda de evaluación.

source: The client manager which holds all currently connected clients.
es: El administrador de clientes que contiene todos los clientes actualmente conectados.

source: **evaluate_configuration** -- A list of tuples. Each tuple in the list identifies a `ClientProxy` and the `EvaluateIns` for this particular `ClientProxy`. If a particular `ClientProxy` is not included in this list, it means that this `ClientProxy` will not participate in the next round of federated evaluation.
es: **evaluate_configuration**: una lista de tuplas. Cada tupla en la lista identifica un `ClientProxy` y los `EvaluateIns` para este `ClientProxy` en particular. Si un `ClientProxy` en particular no está incluido en esta lista, significa que este `ClientProxy` no participará en la siguiente ronda de evaluación federada.

source: Configure the next round of training.
es: Configura la siguiente ronda de entrenamiento.

source: **fit_configuration** -- A list of tuples. Each tuple in the list identifies a `ClientProxy` and the `FitIns` for this particular `ClientProxy`. If a particular `ClientProxy` is not included in this list, it means that this `ClientProxy` will not participate in the next round of federated learning.
es: **fit_configuration** -- Una lista de tuplas. Cada tupla en la lista identifica un `ClientProxy` y los `FitIns` para este `ClientProxy` en particular. Si un "ClientProxy" en particular no está incluido en esta lista, significa que este "ClientProxy" no participará en la siguiente ronda de aprendizaje federado.

source: Evaluate the current model parameters.
es: Evaluar los parámetros del modelo actual.

source: This function can be used to perform centralized (i.e., server-side) evaluation of model parameters.
es: Esta función se puede utilizar para realizar una evaluación centralizada (es decir, del lado del servidor) de los parámetros del modelo.

source: **evaluation_result** -- The evaluation result, usually a Tuple containing loss and a dictionary containing task-specific metrics (e.g., accuracy).
es: **evaluación_resultado**: el resultado de la evaluación, generalmente una tupla que contiene pérdida y un diccionario que contiene métricas específicas de la tarea (por ejemplo, precisión).

source: Initialize the (global) model parameters.
es: Inicialice los parámetros del modelo (global).

source: **parameters** -- If parameters are returned, then the server will treat these as the initial global model parameters.
es: **parámetros**: si se devuelven parámetros, el servidor los tratará como los parámetros del modelo global inicial.

source: server.strategy.FedAvg
es: servidor.estrategia.FedAvg

source: Configurable FedAvg strategy implementation.
es: Implementación de estrategia FedAvg configurable.

source: Federated Averaging strategy.
es: Estrategia de promedio federado.

source: Implementation based on https://arxiv.org/abs/1602.05629
es: Implementación basada en https://arxiv.org/abs/1602.05629

source: Fraction of clients used during training. In case `min_fit_clients` is larger than `fraction_fit * available_clients`, `min_fit_clients` will still be sampled. Defaults to 1.0.
es: Fracción de clientes utilizados durante la formación. En caso de que `min_fit_clients` sea mayor que `fraction_fit * available_clients`, se seguirá muestreando `min_fit_clients`. El valor predeterminado es 1.0.

source: Fraction of clients used during validation. In case `min_evaluate_clients` is larger than `fraction_evaluate * available_clients`, `min_evaluate_clients` will still be sampled. Defaults to 1.0.
es: Fracción de clientes utilizados durante la validación. En caso de que `min_evaluate_clients` sea mayor que `fraction_evaluate * available_clients`, se seguirá muestreando `min_evaluate_clients`. El valor predeterminado es 1.0.

source: Minimum number of clients used during training. Defaults to 2.
es: Número mínimo de clientes utilizados durante la formación. El valor predeterminado es 2.

source: Minimum number of clients used during validation. Defaults to 2.
es: Número mínimo de clientes utilizados durante la validación. El valor predeterminado es 2.

source: Minimum number of total clients in the system. Defaults to 2.
es: Número mínimo de clientes totales en el sistema. El valor predeterminado es 2.

source: Optional function used for validation. Defaults to None.
es: Función opcional utilizada para la validación. El valor predeterminado es Ninguno.

source: Function used to configure training. Defaults to None.
es: Función utilizada para configurar el entrenamiento. El valor predeterminado es Ninguno.

source: Function used to configure validation. Defaults to None.
es: Función utilizada para configurar la validación. El valor predeterminado es Ninguno.

source: Whether or not accept rounds containing failures. Defaults to True.
es: Si aceptar o no rondas que contengan fallas. El valor predeterminado es Verdadero.

source: Initial global model parameters.
es: Parámetros iniciales del modelo global.

source: Metrics aggregation function, optional.
es: Función de agregación de métricas, opcional.

source: Aggregate evaluation losses using weighted average.
es: Pérdidas agregadas de evaluación utilizando el promedio ponderado.

source: Aggregate fit results using weighted average.
es: Resultados de ajuste agregados utilizando el promedio ponderado.

source: Evaluate model parameters using an evaluation function.
es: Evalúe los parámetros del modelo utilizando una función de evaluación.

source: Initialize global model parameters.
es: Inicialice los parámetros del modelo global.

source: Use a fraction of available clients for evaluation.
es: Utilice una fracción de los clientes disponibles para la evaluación.

source: Return the sample size and the required number of available clients.
es: Devuelve el tamaño de la muestra y el número requerido de clientes disponibles.

source: server.strategy.FedAvgM
es: servidor.estrategia.FedAvgM

source: Configurable FedAvg with Momentum strategy implementation.
es: FedAvg configurable con implementación de estrategia Momentum.

source: Federated Averaging with Momentum strategy.
es: Promedio federado con estrategia Momentum.

source: Implementation based on https://arxiv.org/pdf/1909.06335.pdf
es: Implementación basada en https://arxiv.org/pdf/1909.06335.pdf

source: Fraction of clients used during training. Defaults to 0.1.
es: Fracción de clientes utilizados durante la formación. El valor predeterminado es 0,1.

source: Fraction of clients used during validation. Defaults to 0.1.
es: Fracción de clientes utilizados durante la validación. El valor predeterminado es 0,1.

source: Server-side learning rate used in server-side optimization. Defaults to 1.0.
es: Tasa de aprendizaje del lado del servidor utilizada en la optimización del lado del servidor. El valor predeterminado es 1.0.

source: Server-side momentum factor used for FedAvgM. Defaults to 0.0.
es: Factor de impulso del lado del servidor utilizado para FedAvgM. El valor predeterminado es 0,0.

source: server.strategy.QFedAvg
es: servidor.estrategia.QFedAvg

source: Configurable QFedAvg strategy implementation.
es: Implementación de estrategia QFedAvg configurable.

source: server.strategy.FaultTolerantFedAvg
es: servidor.estrategia.FaultTolerantFedAvg

source: Configurable fault-tolerant FedAvg strategy implementation.
es: Implementación de la estrategia FedAvg configurable y tolerante a fallas.

source: server.strategy.FedOpt
es: servidor.estrategia.FedOpt

source: Configurable FedAdagrad strategy implementation.
es: Implementación de la estrategia configurable de FedAdagrad.

source: Federated Optim strategy interface.
es: Interfaz de estrategia Optim federada.

source: Implementation based on https://arxiv.org/abs/2003.00295v5
es: Implementación basada en https://arxiv.org/abs/2003.00295v5

source: Fraction of clients used during training. Defaults to 1.0.
es: Fracción de clientes utilizados durante la formación. El valor predeterminado es 1.0.

source: Fraction of clients used during validation. Defaults to 1.0.
es: Fracción de clientes utilizados durante la validación. El valor predeterminado es 1.0.

source: Server-side learning rate. Defaults to 1e-1.
es: Tasa de aprendizaje del lado del servidor. El valor predeterminado es 1e-1.

source: Client-side learning rate. Defaults to 1e-1.
es: Tasa de aprendizaje del lado del cliente. El valor predeterminado es 1e-1.

source: Momentum parameter. Defaults to 0.0.
es: Parámetro de impulso. El valor predeterminado es 0,0.

source: Second moment parameter. Defaults to 0.0.
es: Parámetro del segundo momento. El valor predeterminado es 0,0.

source: Controls the algorithm's degree of adaptability. Defaults to 1e-9.
es: Controla el grado de adaptabilidad del algoritmo. El valor predeterminado es 1e-9.

source: server.strategy.FedProx
es: servidor.estrategia.FedProx

source: Configurable FedProx strategy implementation.
es: Implementación de estrategia FedProx configurable.

source: Federated Optimization strategy.
es: Estrategia de optimización federada.

source: Implementation based on https://arxiv.org/abs/1812.06127
es: Implementación basada en https://arxiv.org/abs/1812.06127

source: The strategy in itself will not be different than FedAvg, the client needs to be adjusted. A proximal term needs to be added to the loss function during the training:
es: La estrategia en sí no será diferente a FedAvg, el cliente necesita ser adaptada. Es necesario agregar un término proximal a la función de pérdida durante el entrenamiento:

source: Where $w^t$ are the global parameters and $w$ are the local weights the function will be optimized with.
es: Donde $w^t$ son los parámetros globales y $w$ son los pesos locales con los que se optimizará la función.

source: In PyTorch, for example, the loss would go from:
es: En PyTorch, por ejemplo, la pérdida iría desde:

source: To:
es: A:

source: With `global_params` being a copy of the parameters before the training takes place.
es: Siendo `global_params` una copia de los parámetros antes de que se lleve a cabo el entrenamiento.

source: The weight of the proximal term used in the optimization. 0.0 makes this strategy equivalent to FedAvg, and the higher the coefficient, the more regularization will be used (that is, the client parameters will need to be closer to the server parameters during training).
es: El peso del término proximal utilizado en la optimización. 0.0 hace que esta estrategia sea equivalente a FedAvg, y cuanto mayor sea el coeficiente, más regularización se utilizará (es decir, los parámetros del cliente deberán estar más cerca de los parámetros del servidor durante el entrenamiento).

source: Sends the proximal factor mu to the clients
es: Envía el factor proximal mu a los clientes.

source: server.strategy.FedAdagrad
es: servidor.estrategia.FedAdagrad

source: FedAdagrad strategy - Adaptive Federated Optimization using Adagrad.
es: Estrategia FedAdagrad: optimización federada adaptativa utilizando Adagrad.

source: Paper: https://arxiv.org/abs/2003.00295
es: Documento: https://arxiv.org/abs/2003.00295

source: Federated learning strategy using Adagrad on server-side.
es: Estrategia de aprendizaje federado utilizando Adagrad en el lado del servidor.

source: server.strategy.FedAdam
es: servidor.estrategia.FedAdam

source: FedAdam - Adaptive Federated Optimization using Adam.
es: FedAdam: optimización federada adaptativa utilizando Adam.

source: Momentum parameter. Defaults to 0.9.
es: Parámetro de impulso. El valor predeterminado es 0,9.

source: Second moment parameter. Defaults to 0.99.
es: Parámetro del segundo momento. El valor predeterminado es 0,99.

source: server.strategy.FedYogi
es: servidor.estrategia.FedYogi

source: FedYogi [Reddi et al., 2020] strategy.
es: Estrategia FedYogi [Reddi et al., 2020].

source: Adaptive Federated Optimization using Yogi.
es: Optimización federada adaptativa utilizando Yogi.

source: Federated learning strategy using Yogi on server-side.
es: Estrategia de aprendizaje federado utilizando Yogi en el lado del servidor.

source: common
es: común

source: Common components shared between server and client.
es: Componentes comunes compartidos entre servidor y cliente.

source: ClientMessage is a container used to hold one result message.
es: ClientMessage es un contenedor que se utiliza para contener un mensaje de resultado.

source: Client status codes.
es: Códigos de estado del cliente.

source: DisconnectRes message from client to server.
es: Mensaje DisconnectRes del cliente al servidor.

source: Evaluate instructions for a client.
es: Evaluar instrucciones para un cliente.

source: Evaluate response from a client.
es: Evaluar la respuesta de un cliente.

source: Types of telemetry events.
es: Tipos de eventos de telemetría.

source: Fit instructions for a client.
es: Instrucciones de ajuste para un cliente.

source: Fit response from a client.
es: Respuesta adecuada de un cliente.

source: Parameters request for a client.
es: Solicitud de parámetros para un cliente.

source: Response when asked to return parameters.
es: Respuesta cuando se le solicita que devuelva parámetros.

source: Properties request for a client.
es: Solicitud de propiedades para un cliente.

source: Properties response from a client.
es: Respuesta de propiedades de un cliente.

source: Model parameters.
es: Parámetros del modelo.

source: ReconnectIns message from server to client.
es: Mensaje ReconnectIns del servidor al cliente.

source: ServerMessage is a container used to hold one instruction message.
es: ServerMessage es un contenedor que se utiliza para contener un mensaje de instrucción.

source: Client status.
es: Estado del cliente.

source: Deserialize NumPy ndarray from bytes.
es: Deserializar NumPy ndarray de bytes.

source: Configure logging to file and/or remote log server.
es: Configure el registro en un archivo y/o en un servidor de registro remoto.

source: Log 'msg % args' with the integer severity 'level'.
es: Registre 'msg % args' con el 'nivel' de gravedad entero.

source: To pass exception information, use the keyword argument exc_info with a true value, e.g.
es: Para pasar información de excepción, utilice el argumento de palabra clave exc_info con un valor verdadero, p.

source: logger.log(level, "We have a %s", "mysterious problem", exc_info=1)
es: logger.log(nivel, "Tenemos un %s", "problema misterioso", exc_info=1)

source: Serialize NumPy ndarray to bytes.
es: Serializar NumPy ndarray a bytes.

source: Convert NumPy ndarrays to parameters object.
es: Convierta NumPy ndarrays en un objeto de parámetros.

source: Construct a datetime from time.time() with time zone set to UTC.
es: Construya una fecha y hora a partir de time.time() con la zona horaria configurada en UTC.

source: Convert parameters object to NumPy ndarrays.
es: Convierta el objeto de parámetros a NumPy ndarrays.

source: Changelog
es: Registro de cambios

source: Unreleased
es: Inédito

source: What's new?
es: ¿Qué hay de nuevo?

source: **Deprecate Python 3.7**
es: **Python 3.7 obsoleto**

source: Since Python 3.7 reached its end of life (EOL) on 2023-06-27, support for Python 3.7 is now deprecated and will be removed in an upcoming release.
es: Dado que Python 3.7 llegó al final de su vida útil (EOL) el 27 de junio de 2023, la compatibilidad con Python 3.7 ahora está obsoleta y se eliminará en una próxima versión.

source: **Add new** `FedTrimmedAvg` **strategy** ([#1769](https://github.com/adap/flower/pull/1769), [#1853](https://github.com/adap/flower/pull/1853))
es: **Agregar nueva** `FedTrimmedAvg` **estrategia** ([#1769](https://github.com/adap/flower/pull/1769), [#1853](https://github.com/ adaptar/flor/tirar/1853))

source: The new `FedTrimmedAvg` strategy implements Trimmed Mean by [Dong Yin, 2018](https://arxiv.org/abs/1803.01498)
es: La nueva estrategia `FedTrimmedAvg` implementa Trimmed Mean por [Dong Yin, 2018](https://arxiv.org/abs/1803.01498)

source: **Add parameter aggregation to** `mt-pytorch` **code example** ([#1785](https://github.com/adap/flower/pull/1785))
es: **Agregar agregación de parámetros a** `mt-pytorch` **ejemplo de código** ([#1785](https://github.com/adap/flower/pull/1785))

source: The `mt-pytorch` example shows how to aggregate parameters when writing a driver script. The included `driver.py` and `server.py` have been aligned to demonstrate both the low-level way and the high-level way of building server-side logic.
es: El ejemplo `mt-pytorch` muestra cómo agregar parámetros al escribir un script de controlador. Los `driver.py` y `server.py` incluidos se han alineado para demostrar tanto la forma de bajo nivel como la forma de alto nivel de construir lógica del lado del servidor.

source: **Introduce (experimental) gRPC request-response API** ([#1867](https://github.com/adap/flower/pull/1867), [#1901](https://github.com/adap/flower/pull/1901))
es: **Introducir API de solicitud-respuesta de gRPC (experimental)** ([#1867](https://github.com/adap/flower/pull/1867), [#1901](https://github.com/adap /flor/pull/1901))

source: In addition to the existing gRPC API (based on bidirectional streaming) and the experimental REST API, there is now a new gRPC API that uses a request-response model to communicate with client nodes.
es: Además de la API gRPC existente (basada en transmisión bidireccional) y la API REST experimental, ahora hay una nueva API gRPC que utiliza un modelo de solicitud-respuesta para comunicarse con los nodos cliente.

source: Please note: The gRPC request-response API is still experimental and will likely change significantly over time.
es: Tenga en cuenta: la API de solicitud y respuesta de gRPC aún es experimental y probablemente cambiará significativamente con el tiempo.

source: **Replace the eperimental** `start_client(rest=True)` **with the new** `start_client(transport="rest")` ([#1880](https://github.com/adap/flower/pull/1880))
es: **Reemplace el experimental** `start_client(rest=True)` **con el nuevo** `start_client(transport="rest")` ([#1880](https://github.com/adap/flower/ tirar/1880))

source: The (experimental) `start_client` argument `rest` was deprecated in favor of a new argument `transport`. `start_client(transport="rest")` will yield the same behaviour as `start_client(rest=True)` did before. All code should migrate to the new argument `transport`. The deprecated argument `rest` will be removed in a future release.
es: El argumento (experimental) `start_client` `rest` quedó obsoleto en favor de un nuevo argumento `transport`. `start_client(transport="rest")` producirá el mismo comportamiento que `start_client(rest=True)` tuvo antes. Todo el código debería migrar al nuevo argumento "transporte". El argumento obsoleto "rest" se eliminará en una versión futura.

source: **Migrate experimental REST API to Starlette** ([2171](https://github.com/adap/flower/pull/2171))
es: **Migrar API REST experimental a Starlette** ([2171](https://github.com/adap/flower/pull/2171))

source: The (experimental) REST API used to be implemented in [FastAPI](https://fastapi.tiangolo.com/), but it has now been migrated to use [Starlette](https://www.starlette.io/) directly.
es: La API REST (experimental) solía implementarse en [FastAPI](https://fastapi.tiangolo.com/), pero ahora se ha migrado para usar [Starlette](https://www.starlette.io/) directamente.

source: **Add a new gRPC option** ([#2197](https://github.com/adap/flower/pull/2197))
es: **Agregue una nueva opción de gRPC** ([#2197](https://github.com/adap/flower/pull/2197))

source: We now start a gRPC server with the `grpc.keepalive_permit_without_calls` option set to 0 by default. This prevents the clients from sending keepalive pings when there is no outstanding stream.
es: Ahora iniciamos un servidor gRPC con la opción `grpc.keepalive_permit_ without_calls` configurada en 0 de forma predeterminada. Esto evita que los clientes envíen pings de mantenimiento cuando no hay una transmisión pendiente.

source: **General improvements** ([#1872](https://github.com/adap/flower/pull/1872), [#1866](https://github.com/adap/flower/pull/1866), [#1884](https://github.com/adap/flower/pull/1884))
es: **Mejoras generales** ([#1872](https://github.com/adap/flower/pull/1872), [#1866](https://github.com/adap/flower/pull/1866) , [#1884](https://github.com/adap/flower/pull/1884))

source: Incompatible changes
es: Cambios incompatibles

source: None
es: Ninguno

source: Thanks to our contributors
es: Gracias a nuestros colaboradores
