Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: The :code:`Strategy` abstraction provides a method called :code:`evaluate` that can directly be used to evaluate the current global model parameters. The current server implementation calls :code:`evaluate` after parameter aggregation and before federated evaluation (see next paragraph).
es: La abstracción :code:`Strategy` proporciona un método llamado :code:`evaluate` que puede usarse directamente para evaluar los parámetros del modelo global actual. La implementación actual del servidor llama a :code:`evaluate` después de la agregación de parámetros y antes de la evaluación federada (consulte el siguiente párrafo).

source: Federated Evaluation
es: Evaluación federada

source: Implementing Federated Evaluation
es: Implementación de la evaluación federada

source: Client-side evaluation happens in the :code:`Client.evaluate` method and can be configured from the server side.
es: La evaluación del lado del cliente ocurre en el método :code:`Client.evaluate` y se puede configurar desde el lado del servidor.

source: Configuring Federated Evaluation
es: Configuración de la evaluación federada

source: Federated evaluation can be configured from the server side. Built-in strategies support the following arguments:
es: La evaluación federada se puede configurar desde el lado del servidor. Las estrategias integradas respaldan los siguientes argumentos:

source: :code:`fraction_evaluate`: a :code:`float` defining the fraction of clients that will be selected for evaluation. If :code:`fraction_evaluate` is set to :code:`0.1` and :code:`100` clients are connected to the server, then :code:`10` will be randomly selected for evaluation. If :code:`fraction_evaluate` is set to :code:`0.0`, federated evaluation will be disabled.
es: :code:`fraction_evaluate`: a :code:`float` que define la fracción de clientes que serán seleccionados para la evaluación. Si :code:`fraction_evaluate` está configurado en :code:`0.1` y :code:`100` clientes están conectados al servidor, entonces :code:`10` se seleccionará aleatoriamente para la evaluación. Si :code:`fraction_evaluate` se establece en :code:`0.0`, la evaluación federada se deshabilitará.

source: :code:`min_evaluate_clients`: an :code:`int`: the minimum number of clients to be selected for evaluation. If :code:`fraction_evaluate` is set to :code:`0.1`, :code:`min_evaluate_clients` is set to 20, and :code:`100` clients are connected to the server, then :code:`20` clients will be selected for evaluation.
es: :code:`min_evaluate_clients`: un :code:`int`: el número mínimo de clientes que se seleccionarán para la evaluación. Si :code:`fraction_evaluate` está configurado en :code:`0.1`, :code:`min_evaluate_clients` está configurado en 20 y :code:`100` clientes están conectados al servidor, entonces :code:`20` clientes serán seleccionados para su evaluación.

source: :code:`min_available_clients`: an :code:`int` that defines the minimum number of clients which need to be connected to the server before a round of federated evaluation can start. If fewer than :code:`min_available_clients` are connected to the server, the server will wait until more clients are connected before it continues to sample clients for evaluation.
es: :code:`min_available_clients`: un :code:`int` que define el número mínimo de clientes que deben conectarse al servidor antes de que pueda comenzar una ronda de evaluación federada. Si hay menos de :code:`min_available_clients` conectados al servidor, el servidor esperará hasta que se conecten más clientes antes de continuar tomando muestras de clientes para su evaluación.

source: :code:`on_evaluate_config_fn`: a function that returns a configuration dictionary which will be sent to the selected clients. The function will be called during each round and provides a convenient way to customize client-side evaluation from the server side, for example, to configure the number of validation steps performed.
es: :code:`on_evaluate_config_fn`: una función que devuelve un diccionario de configuración que será enviado a los clientes seleccionados. La función se llamará durante cada ronda y proporciona una manera conveniente de personalizar la evaluación del lado del cliente desde el lado del servidor, por ejemplo, para configurar la cantidad de pasos de validación realizados.

source: Evaluating Local Model Updates During Training
es: Evaluación de actualizaciones del modelo local durante la capacitación

source: Model parameters can also be evaluated during training. :code:`Client.fit` can return arbitrary evaluation results as a dictionary:
es: Los parámetros del modelo también se pueden evaluar durante el entrenamiento. :code:`Client.fit` puede devolver resultados de evaluación arbitrarios como un diccionario:

source: Full Code Example
es: Ejemplo de código completo

source: For a full code example that uses both centralized and federated evaluation, see the *Advanced TensorFlow Example* (the same approach can be applied to workloads implemented in any other framework): https://github.com/adap/flower/tree/main/examples/advanced-tensorflow
es: Para ver un ejemplo de código completo que utiliza evaluación centralizada y federada, consulte el *Ejemplo avanzado de TensorFlow* (el mismo enfoque se puede aplicar a cargas de trabajo implementadas en cualquier otro marco): https://github.com/adap/flower/tree/ principal/ejemplos/tensorflow avanzado

source: FED Template
es: Plantilla FED

source: Table of Contents
es: Tabla de contenido

source: [Table of Contents](#table-of-contents)
es: [Tabla de contenido](#tabla de contenido)

source: [Summary](#summary)
es: [Resumen](#resumen)

source: [Motivation](#motivation)
es: [Motivación](#motivación)

source: [Goals](#goals)
es: [Goles](#goles)

source: [Non-Goals](#non-goals)
es: [Sin objetivos](#sin objetivos)

source: [Proposal](#proposal)
es: [Propuesta](#propuesta)

source: [Drawbacks](#drawbacks)
es: [Inconvenientes](#inconvenientes)

source: [Alternatives Considered](#alternatives-considered)
es: [Alternativas consideradas](#alternativas-consideradas)

source: [Appendix](#appendix)
es: [Apéndice](#apéndice)

source: Summary
es: Resumen

source: \[TODO - sentence 1: summary of the problem\]
es: \[TODO - frase 1: resumen del problema\]

source: \[TODO - sentence 2: summary of the solution\]
es: \[TODO - frase 2: resumen de la solución\]

source: Motivation
es: Motivación

source: \[TODO\]
es: \[HACER\]

source: Goals
es: Objetivos

source: Non-Goals
es: No metas

source: Proposal
es: Propuesta

source: Drawbacks
es: Desventajas

source: Alternatives Considered
es: Alternativas consideradas

source: \[Alternative 1\]
es: \[Alternativa 1\]

source: \[Alternative 2\]
es: \[Alternativa 2\]

source: Appendix
es: Apéndice

source: Flower Enhancement Doc
es: Doc de mejora de flores

source: [Enhancement Doc Template](#enhancement-doc-template)
es: [Plantilla de documento de mejora](#enhancement-doc-template)

source: [Metadata](#metadata)
es: [Metadatos](#metadatos)

source: [Workflow](#workflow)
es: [Flujo de trabajo](#flujo de trabajo)

source: [GitHub Issues](#github-issues)
es: [Problemas de GitHub](#github-issues)

source: [Google Docs](#google-docs)
es: [Documentos de Google](#google-docs)

source: A Flower Enhancement is a standardized development process to
es: Un Flower Enhancement es un proceso de desarrollo estandarizado para

source: provide a common structure for proposing larger changes
es: Proporcionar una estructura común para proponer cambios más importantes.

source: ensure that the motivation for a change is clear
es: Asegurar que la motivación para un cambio sea clara.

source: persist project information in a version control system
es: conservar la información del proyecto en un sistema de control de versiones

source: document the motivation for impactful user-facing changes
es: documentar la motivación para cambios impactantes de cara al usuario

source: reserve GitHub issues for tracking work in flight
es: reserve problemas de GitHub para rastrear el trabajo en vuelo

source: ensure community participants can successfully drive changes to completion across one or more releases while stakeholders are adequately represented throughout the process
es: Garantizar que los participantes de la comunidad puedan impulsar con éxito los cambios hasta su finalización en una o más versiones mientras las partes interesadas estén adecuadamente representadas durante todo el proceso.

source: Hence, an Enhancement Doc combines aspects of
es: Por lo tanto, un documento de mejora combina aspectos de

source: a feature, and effort-tracking document
es: un documento de seguimiento de características y esfuerzos

source: a product requirements document
es: un documento de requisitos del producto

source: a design document
es: un documento de diseño

source: into one file, which is created incrementally in collaboration with the community.
es: en un archivo, que se crea de forma incremental en colaboración con la comunidad.

source: For far-fetching changes or features proposed to Flower, an abstraction beyond a single GitHub issue or pull request is required to understand and communicate upcoming changes to the project.
es: Para cambios o funciones descabellados propuestos a Flower, se requiere una abstracción más allá de un solo problema de GitHub o solicitud de extracción para comprender y comunicar los próximos cambios en el proyecto.

source: The purpose of this process is to reduce the amount of "tribal knowledge" in our community. By moving decisions from Slack threads, video calls, and hallway conversations into a well-tracked artifact, this process aims to enhance communication and discoverability.
es: El propósito de este proceso es reducir la cantidad de "conocimiento tribal" en nuestra comunidad. Al trasladar las decisiones de los hilos de Slack, las videollamadas y las conversaciones en los pasillos a un artefacto bien rastreado, este proceso tiene como objetivo mejorar la comunicación y la capacidad de descubrimiento.

source: Roughly any larger, user-facing enhancement should follow the Enhancement process. If an enhancement would be described in either written or verbal communication to anyone besides the author or developer, then consider creating an Enhancement Doc.
es: Básicamente, cualquier mejora más importante orientada al usuario debe seguir el proceso de mejora. Si una mejora se describiría en comunicación escrita o verbal a cualquier persona además del autor o desarrollador, considere crear un documento de mejora.

source: Similarly, any technical effort (refactoring, major architectural change) that will impact a large section of the development community should also be communicated widely. The Enhancement process is suited for this even if it will have zero impact on the typical user or operator.
es: De manera similar, cualquier esfuerzo técnico (refactorización, cambio arquitectónico importante) que afectará a una gran parte de la comunidad de desarrollo también debe comunicarse ampliamente. El proceso de mejora es adecuado para esto incluso si no tendrá ningún impacto en el usuario u operador típico.

source: For small changes and additions, going through the Enhancement process would be time-consuming and unnecessary. This includes, for example, adding new Federated Learning algorithms, as these only add features without changing how Flower works or is used.
es: Para pequeños cambios y adiciones, pasar por el proceso de mejora llevaría mucho tiempo y sería innecesario. Esto incluye, por ejemplo, agregar nuevos algoritmos de aprendizaje federado, ya que estos solo agregan funciones sin cambiar la forma en que funciona o se utiliza Flower.

source: Enhancements are different from feature requests, as they are already providing a laid-out path for implementation and are championed by members of the community.
es: Las mejoras son diferentes de las solicitudes de funciones, ya que ya proporcionan un camino establecido para la implementación y son defendidas por miembros de la comunidad.

source: An Enhancement is captured in a Markdown file that follows a defined template and a workflow to review and store enhancement docs for reference — the Enhancement Doc.
es: Una mejora se captura en un archivo Markdown que sigue una plantilla definida y un flujo de trabajo para revisar y almacenar documentos de mejora como referencia: el documento de mejora.

source: Enhancement Doc Template
es: Plantilla de documento de mejora

source: Each enhancement doc is provided as a Markdown file having the following structure
es: Cada documento de mejora se proporciona como un archivo Markdown que tiene la siguiente estructura

source: Metadata (as [described below](#metadata) in form of a YAML preamble)
es: Metadatos (como [se describe a continuación](#metadata) en forma de preámbulo YAML)

source: Title (same as in metadata)
es: Título (igual que en metadatos)

source: Table of Contents (if needed)
es: Tabla de contenidos (si es necesario)

source: Notes/Constraints/Caveats (optional)
es: Notas/Restricciones/Advertencias (opcional)

source: Design Details (optional)
es: Detalles de diseño (opcional)

source: Graduation Criteria
es: Criterios de graduación

source: Upgrade/Downgrade Strategy (if applicable)
es: Estrategia de actualización/baja de categoría (si corresponde)

source: As a reference, this document follows the above structure.
es: Como referencia, este documento sigue la estructura anterior.

source: Metadata
es: Metadatos

source: **fed-number** (Required) The `fed-number` of the last Flower Enhancement Doc + 1. With this number, it becomes easy to reference other proposals.
es: **número-federal** (Obligatorio) El `número-federal` del último documento de mejora de flores + 1. Con este número, resulta fácil hacer referencia a otras propuestas.

source: **title** (Required) The title of the proposal in plain language.
es: **título** (Obligatorio) El título de la propuesta en lenguaje sencillo.

source: **status** (Required) The current status of the proposal. See [workflow](#workflow) for the possible states.
es: **status** (Obligatorio) El estado actual de la propuesta. Consulte [flujo de trabajo](#flujo de trabajo) para conocer los posibles estados.

source: **authors** (Required) A list of authors of the proposal. This is simply the GitHub ID.
es: **autores** (Obligatorio) Una lista de autores de la propuesta. Este es simplemente el ID de GitHub.

source: **creation-date** (Required) The date that the proposal was first submitted in a PR.
es: **fecha-creación** (Obligatorio) La fecha en que la propuesta se envió por primera vez en un PR.

source: **last-updated** (Optional) The date that the proposal was last changed significantly.
es: **última actualización** (Opcional) La fecha en la que la propuesta cambió significativamente por última vez.

source: **see-also** (Optional) A list of other proposals that are relevant to this one.
es: **ver también** (Opcional) Una lista de otras propuestas que son relevantes para esta.

source: **replaces** (Optional) A list of proposals that this one replaces.
es: **reemplaza** (Opcional) Una lista de propuestas que ésta reemplaza.

source: **superseded-by** (Optional) A list of proposals that this one supersedes.
es: **reemplazado por** (Opcional) Una lista de propuestas que ésta reemplaza.

source: Workflow
es: Flujo de trabajo

source: The idea forming the enhancement should already have been discussed or pitched in the community. As such, it needs a champion, usually the author, who shepherds the enhancement. This person also has to find committers to Flower willing to review the proposal.
es: La idea de la mejora ya debería haberse discutido o presentado en la comunidad. Como tal, necesita un defensor, generalmente el autor, que guíe la mejora. Esta persona también tiene que encontrar personas comprometidas con Flower que estén dispuestas a revisar la propuesta.

source: New enhancements are checked in with a file name in the form of `NNNN-YYYYMMDD-enhancement-title.md`, with `NNNN` being the Flower Enhancement Doc number, to `enhancements`. All enhancements start in `provisional` state as part of a pull request. Discussions are done as part of the pull request review.
es: Las nuevas mejoras se registran con un nombre de archivo con el formato "NNNN-AAAAMMDD-enhancement-title.md", donde "NNNN" es el número del documento de mejora de flores, en "mejoras". Todas las mejoras comienzan en estado "provisional" como parte de una solicitud de extracción. Las discusiones se realizan como parte de la revisión de la solicitud de extracción.

source: Once an enhancement has been reviewed and approved, its status is changed to `implementable`. The actual implementation is then done in separate pull requests. These pull requests should mention the respective enhancement as part of their description. After the implementation is done, the proposal status is changed to `implemented`.
es: Una vez que una mejora ha sido revisada y aprobada, su estado cambia a "implementable". Luego, la implementación real se realiza en solicitudes de extracción separadas. Estas solicitudes de extracción deben mencionar la mejora respectiva como parte de su descripción. Una vez finalizada la implementación, el estado de la propuesta cambia a "implementada".

source: Under certain conditions, other states are possible. An Enhancement has the following states:
es: Bajo ciertas condiciones, son posibles otros estados. Una mejora tiene los siguientes estados:

source: `provisional`: The enhancement has been proposed and is actively being defined. This is the starting state while the proposal is being fleshed out and actively defined and discussed.
es: `provisional`: La mejora ha sido propuesta y se está definiendo activamente. Este es el estado de partida mientras la propuesta se desarrolla y se define y discute activamente.

source: `implementable`: The enhancement has been reviewed and approved.
es: `implementable`: la mejora ha sido revisada y aprobada.

source: `implemented`: The enhancement has been implemented and is no longer actively changed.
es: `implementado`: la mejora se ha implementado y ya no se modifica activamente.

source: `deferred`: The enhancement is proposed but not actively being worked on.
es: `diferido`: se propone la mejora, pero no se está trabajando activamente en ella.

source: `rejected`: The authors and reviewers have decided that this enhancement is not moving forward.
es: `rechazado`: Los autores y revisores han decidido que esta mejora no avanza.

source: `withdrawn`: The authors have withdrawn the enhancement.
es: `retirado`: Los autores han retirado la mejora.

source: `replaced`: The enhancement has been replaced by a new enhancement.
es: `reemplazado`: la mejora ha sido reemplazada por una nueva mejora.

source: Adding an additional process to the ones already provided by GitHub (Issues and Pull Requests) adds more complexity and can be a barrier for potential first-time contributors.
es: Agregar un proceso adicional a los que ya proporciona GitHub (problemas y solicitudes de extracción) agrega más complejidad y puede ser una barrera para posibles contribuyentes por primera vez.

source: Expanding the proposal template beyond the single-sentence description currently required in the features issue template may be a heavy burden for non-native English speakers.
es: Ampliar la plantilla de propuesta más allá de la descripción de una sola oración que actualmente se requiere en la plantilla de temas de características puede ser una carga pesada para los hablantes no nativos de inglés.

source: GitHub Issues
es: Problemas de GitHub

source: Using GitHub Issues for these kinds of enhancements is doable. One could use, for example, tags, to differentiate and filter them from other issues. The main issue is in discussing and reviewing an enhancement: GitHub issues only have a single thread for comments. Enhancements usually have multiple threads of discussion at the same time for various parts of the doc. Managing these multiple discussions can be confusing when using GitHub Issues.
es: Es posible utilizar GitHub Issues para este tipo de mejoras. Se podrían utilizar, por ejemplo, etiquetas para diferenciarlas y filtrarlas de otras cuestiones. El problema principal está en discutir y revisar una mejora: los problemas de GitHub solo tienen un hilo para comentarios. Las mejoras suelen tener varios hilos de discusión al mismo tiempo para varias partes del documento. Administrar estas múltiples discusiones puede resultar confuso cuando se utilizan GitHub Issues.

source: Google Docs
es: Documentos de Google

source: Google Docs allow for multiple threads of discussions. But as Google Docs are hosted outside the project, their discoverability by the community needs to be taken care of. A list of links to all proposals has to be managed and made available for the community. Compared to shipping proposals as part of Flower's repository, the potential for missing links is much higher.
es: Google Docs permite múltiples hilos de discusión. Pero como Google Docs está alojado fuera del proyecto, es necesario cuidar su visibilidad por parte de la comunidad. Se debe gestionar y poner a disposición de la comunidad una lista de enlaces a todas las propuestas. En comparación con las propuestas de envío como parte del repositorio de Flower, la posibilidad de que falten enlaces es mucho mayor.

source: FED - Flower Enhancement Doc
es: FED - Documento sobre mejora de flores

source: Aggregate evaluation results
es: Resultados agregados de la evaluación

source: The Flower server does not prescribe a way to aggregate evaluation results, but it enables the user to fully customize result aggregation.
es: El servidor Flower no prescribe una forma de agregar resultados de evaluación, pero permite al usuario personalizar completamente la agregación de resultados.

source: Aggregate Custom Evaluation Results
es: Resultados agregados de evaluación personalizada

source: The same :code:`Strategy`-customization approach can be used to aggregate custom evaluation results coming from individual clients. Clients can return custom metrics to the server by returning a dictionary:
es: El mismo enfoque de personalización :code:`Strategy` se puede utilizar para agregar resultados de evaluación personalizados provenientes de clientes individuales. Los clientes pueden devolver métricas personalizadas al servidor devolviendo un diccionario:

source: The server can then use a customized strategy to aggregate the metrics provided in these dictionaries:
es: Luego, el servidor puede utilizar una estrategia personalizada para agregar las métricas proporcionadas en estos diccionarios:

source: Configure clients
es: Configurar clientes

source: Along with model parameters, Flower can send configuration values to clients. Configuration values can be used for various purposes. They are, for example, a popular way to control client-side hyperparameters from the server.
es: Junto con los parámetros del modelo, Flower puede enviar valores de configuración a los clientes. Los valores de configuración se pueden utilizar para diversos fines. Son, por ejemplo, una forma popular de controlar los hiperparámetros del lado del cliente desde el servidor.

source: Configuration values
es: Valores de configuración
