Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: The Flower server interacts with clients through an interface called :code:`Client`. When the server selects a particular client for training, it sends training instructions over the network. The client receives those instructions and calls one of the :code:`Client` methods to run your code (i.e., to fit the logistic regression we defined earlier).
es: El servidor Flower interactúa con los clientes a través de una interfaz llamada :code:`Client`. Cuando el servidor selecciona un cliente en particular para entrenar, envía instrucciones de entrenamiento a través de la red. El cliente recibe esas instrucciones y llama a uno de los métodos :code:`Client` para ejecutar su código (es decir, para ajustarse a la regresión logística que definimos anteriormente).

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses scikit-learn. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
es: Flower proporciona una clase de conveniencia llamada :code:`NumPyClient` que facilita la implementación de la interfaz :code:`Client` cuando su carga de trabajo usa scikit-learn. Implementar :code:`NumPyClient` generalmente significa definir los siguientes métodos (aunque:code:`set_parameters` es opcional):

source: is directly imported with :code:`utils.set_model_params()`
es: se importa directamente con :code:`utils.set_model_params()`

source: The methods can be implemented in the following way:
es: Los métodos se pueden implementar de la siguiente manera:

source: We can now create an instance of our class :code:`MnistClient` and add one line to actually run this client:
es: Ahora podemos crear una instancia de nuestra clase :code:`MnistClient` y agregar una línea para ejecutar este cliente:

source: The following Flower server is a little bit more advanced and returns an evaluation function for the server-side evaluation. First, we import again all required libraries such as Flower and scikit-learn.
es: El siguiente servidor Flower es un poco más avanzado y devuelve una función de evaluación para la evaluación del lado del servidor. Primero, importamos nuevamente todas las bibliotecas necesarias, como Flower y scikit-learn.

source: :code:`server.py`, import Flower and start the server:
es: :code:`server.py`, importa Flower e inicia el servidor:

source: The number of federated learning rounds is set in :code:`fit_round()` and the evaluation is defined in :code:`get_evaluate_fn()`. The evaluation function is called after each federated learning round and gives you information about loss and accuracy.
es: El número de rondas de aprendizaje federadas se establece en :code:`fit_round()` y la evaluación se define en :code:`get_evaluate_fn()`. La función de evaluación se llama después de cada ronda de aprendizaje federado y le brinda información sobre la pérdida y la precisión.

source: The :code:`main` contains the server-side parameter initialization :code:`utils.set_initial_params()` as well as the aggregation strategy :code:`fl.server.strategy:FedAvg()`. The strategy is the default one, federated averaging (or FedAvg), with two clients and evaluation after each federated learning round. The server can be started with the command :code:`fl.server.start_server(server_address="0.0.0.0:8080", strategy=strategy, config=fl.server.ServerConfig(num_rounds=3))`.
es: El :code:`main` contiene la inicialización del parámetro del lado del servidor :code:`utils.set_initial_params()` así como la estrategia de agregación :code:`fl.server.strategy:FedAvg()`. La estrategia es la predeterminada, promedio federado (o FedAvg), con dos clientes y evaluación después de cada ronda de aprendizaje federado. El servidor se puede iniciar con el comando :code:`fl.server.start_server(server_address="0.0.0.0:8080", estrategia=strategy, config=fl.server.ServerConfig(num_rounds=3))`.

source: With both client and server ready, we can now run everything and see federated learning in action. Federated learning systems usually have a server and multiple clients. We, therefore, have to start the server first:
es: Con el cliente y el servidor listos, ahora podemos ejecutar todo y ver el aprendizaje federado en acción. Los sistemas de aprendizaje federados suelen tener un servidor y varios clientes. Por tanto, primero tenemos que iniciar el servidor:

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/tree/main/examples/sklearn-logreg-mnist>`_ for this example can be found in :code:`examples/sklearn-logreg-mnist`.
es: ¡Felicidades! Ha creado y ejecutado con éxito su primer sistema de aprendizaje federado. El `código fuente completo <https://github.com/adap/flower/tree/main/examples/sklearn-logreg-mnist>`_ para este ejemplo se puede encontrar en :code:`examples/sklearn-logreg-mnist `.

source: Quickstart TensorFlow
es: Inicio rápido de TensorFlow

source: Let's build a federated learning system in less than 20 lines of code!
es: ¡Construyamos un sistema de aprendizaje federado en menos de 20 líneas de código!

source: Before Flower can be imported we have to install it:
es: Antes de poder importar Flower tenemos que instalarlo:

source: Since we want to use the Keras API of TensorFlow (TF), we have to install TF as well:
es: Como queremos utilizar la API Keras de TensorFlow (TF), también debemos instalar TF:

source: Next, in a file called :code:`client.py`, import Flower and TensorFlow:
es: A continuación, en un archivo llamado :code:`client.py`, importe Flower y TensorFlow:

source: We use the Keras utilities of TF to load CIFAR10, a popular colored image classification dataset for machine learning. The call to :code:`tf.keras.datasets.cifar10.load_data()` downloads CIFAR10, caches it locally, and then returns the entire training and test set as NumPy ndarrays.
es: Usamos las utilidades Keras de TF para cargar CIFAR10, un popular conjunto de datos de clasificación de imágenes en color para el aprendizaje automático. La llamada a :code:`tf.keras.datasets.cifar10.load_data()` descarga CIFAR10, lo almacena en caché localmente y luego devuelve todo el conjunto de entrenamiento y prueba como NumPy ndarrays.

source: Next, we need a model. For the purpose of this tutorial, we use MobilNetV2 with 10 output classes:
es: A continuación, necesitamos un modelo. Para los fines de este tutorial, utilizamos MobilNetV2 con 10 clases de salida:

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses Keras. The :code:`NumPyClient` interface defines three methods which can be implemented in the following way:
es: Flower proporciona una clase de conveniencia llamada :code:`NumPyClient` que facilita la implementación de la interfaz :code:`Client` cuando su carga de trabajo usa Keras. La interfaz :code:`NumPyClient` define tres métodos que se pueden implementar de la siguiente manera:

source: Each client will have its own dataset.
es: Cada cliente tendrá su propio conjunto de datos.

source: You should now see how the training does in the very first terminal (the one that started the server):
es: Ahora deberías ver cómo funciona el entrenamiento en la primera terminal (la que inició el servidor):

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/blob/main/examples/quickstart-tensorflow/client.py>`_ for this can be found in :code:`examples/quickstart-tensorflow/client.py`.
es: ¡Felicidades! Ha creado y ejecutado con éxito su primer sistema de aprendizaje federado. El `código fuente completo <https://github.com/adap/flower/blob/main/examples/quickstart-tensorflow/client.py>`_ para esto se puede encontrar en :code:`examples/quickstart-tensorflow/ cliente.py`.

source: Quickstart XGBoost
es: Inicio rápido XGBoost

source: Let's build a horizontal federated learning system using XGBoost and Flower!
es: ¡Construyamos un sistema de aprendizaje federado horizontal usando XGBoost y Flower!

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-xgboost-horizontal>`_ to learn more.
es: Consulte el `ejemplo de código completo <https://github.com/adap/flower/tree/main/examples/quickstart-xgboost-horizontal>`_ para obtener más información.

source: Use a federated learning strategy
es: Utilice una estrategia de aprendizaje federado

source: Welcome to the next part of the federated learning tutorial. In previous parts of this tutorial, we introduced federated learning with PyTorch and Flower (`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__).
es: Bienvenido a la siguiente parte del tutorial de aprendizaje federado. En partes anteriores de este tutorial, presentamos el aprendizaje federado con PyTorch y Flower (`parte 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__).

source: In this notebook, we'll begin to customize the federated learning system we built in the introductory notebook (again, using `Flower <https://flower.dev/>`__ and `PyTorch <https://pytorch.org/>`__).
es: En este cuaderno, comenzaremos a personalizar el sistema de aprendizaje federado que creamos en el cuaderno introductorio (nuevamente, usando `Flower <https://flower.dev/>`__ y `PyTorch <https://pytorch.org/ >`__).

source: Let's move beyond FedAvg with Flower strategies!
es: ¡Vayamos más allá de FedAvg con estrategias Flower!

source: Strategy customization
es: Personalización de la estrategia

source: So far, everything should look familiar if you've worked through the introductory notebook. With that, we're ready to introduce a number of new features.
es: Hasta ahora, todo debería resultarle familiar si ha trabajado en el cuaderno introductorio. Con eso, estamos listos para presentar una serie de características nuevas.

source: Server-side parameter **initialization**
es: Parámetro del lado del servidor **inicialización**

source: Flower, by default, initializes the global model by asking one random client for the initial parameters. In many cases, we want more control over parameter initialization though. Flower therefore allows you to directly pass the initial parameters to the Strategy:
es: Flower, de forma predeterminada, inicializa el modelo global solicitando a un cliente aleatorio los parámetros iniciales. Sin embargo, en muchos casos, queremos tener más control sobre la inicialización de parámetros. Por lo tanto, Flower le permite pasar directamente los parámetros iniciales a la Estrategia:

source: Passing ``initial_parameters`` to the ``FedAvg`` strategy prevents Flower from asking one of the clients for the initial parameters. If we look closely, we can see that the logs do not show any calls to the ``FlowerClient.get_parameters`` method.
es: Pasar ``initial_parameters`` a la estrategia ``FedAvg`` evita que Flower solicite los parámetros iniciales a uno de los clientes. Si miramos de cerca, podemos ver que los registros no muestran ninguna llamada al método ``FlowerClient.get_parameters``.

source: Starting with a customized strategy
es: Comenzando con una estrategia personalizada

source: We've seen the function ``start_simulation`` before. It accepts a number of arguments, amongst them the ``client_fn`` used to create ``FlowerClient`` instances, the number of clients to simulate ``num_clients``, the number of rounds ``num_rounds``, and the strategy.
es: Hemos visto la función ``start_simulation`` antes. Acepta una serie de argumentos, entre ellos el ``client_fn`` usado para crear instancias de ``FlowerClient``, el número de clientes para simular ``num_clients``, el número de rondas ``num_rounds`` y la estrategia. .

source: The strategy encapsulates the federated learning approach/algorithm, for example, ``FedAvg`` or ``FedAdagrad``. Let's try to use a different strategy this time:
es: La estrategia encapsula el enfoque/algoritmo de aprendizaje federado, por ejemplo, ``FedAvg`` o ``FedAdagrad``. Intentemos usar una estrategia diferente esta vez:

source: Server-side parameter **evaluation**
es: Parámetro del lado del servidor **evaluación**

source: Flower can evaluate the aggregated model on the server-side or on the client-side. Client-side and server-side evaluation are similar in some ways, but different in others.
es: Flower puede evaluar el modelo agregado en el lado del servidor o en el lado del cliente. La evaluación del lado del cliente y del lado del servidor son similares en algunos aspectos, pero diferentes en otros.

source: **Centralized Evaluation** (or *server-side evaluation*) is conceptually simple: it works the same way that evaluation in centralized machine learning does. If there is a server-side dataset that can be used for evaluation purposes, then that's great. We can evaluate the newly aggregated model after each round of training without having to send the model to clients. We're also fortunate in the sense that our entire evaluation dataset is available at all times.
es: La **Evaluación centralizada** (o *evaluación del lado del servidor*) es conceptualmente simple: funciona de la misma manera que la evaluación en el aprendizaje automático centralizado. Si hay un conjunto de datos del lado del servidor que se puede utilizar con fines de evaluación, entonces es genial. Podemos evaluar el modelo recién agregado después de cada ronda de capacitación sin tener que enviar el modelo a los clientes. También somos afortunados en el sentido de que todo nuestro conjunto de datos de evaluación está disponible en todo momento.

source: **Federated Evaluation** (or *client-side evaluation*) is more complex, but also more powerful: it doesn't require a centralized dataset and allows us to evaluate models over a larger set of data, which often yields more realistic evaluation results. In fact, many scenarios require us to use **Federated Evaluation** if we want to get representative evaluation results at all. But this power comes at a cost: once we start to evaluate on the client side, we should be aware that our evaluation dataset can change over consecutive rounds of learning if those clients are not always available. Moreover, the dataset held by each client can also change over consecutive rounds. This can lead to evaluation results that are not stable, so even if we would not change the model, we'd see our evaluation results fluctuate over consecutive rounds.
es: **Evaluación federada** (o *evaluación del lado del cliente*) es más compleja, pero también más poderosa: no requiere un conjunto de datos centralizado y nos permite evaluar modelos sobre un conjunto más grande de datos, lo que a menudo produce resultados más realistas. resultados de evaluación. De hecho, muchos escenarios requieren que utilicemos **Evaluación federada** si queremos obtener resultados de evaluación representativos. Pero este poder tiene un costo: una vez que comenzamos a evaluar del lado del cliente, debemos ser conscientes de que nuestro conjunto de datos de evaluación puede cambiar en rondas consecutivas de aprendizaje si esos clientes no siempre están disponibles. Además, el conjunto de datos que posee cada cliente también puede cambiar en rondas consecutivas. Esto puede llevar a que los resultados de la evaluación no sean estables, por lo que incluso si no cambiemos el modelo, veremos que los resultados de nuestra evaluación fluctúan en rondas consecutivas.

source: We've seen how federated evaluation works on the client side (i.e., by implementing the ``evaluate`` method in ``FlowerClient``). Now let's see how we can evaluate aggregated model parameters on the server-side:
es: Hemos visto cómo funciona la evaluación federada en el lado del cliente (es decir, implementando el método ``evaluate`` en ``FlowerClient``). Ahora veamos cómo podemos evaluar los parámetros del modelo agregado en el lado del servidor:

source: Sending/receiving arbitrary values to/from clients
es: Enviar/recibir valores arbitrarios hacia/desde clientes

source: In some situations, we want to configure client-side execution (training, evaluation) from the server-side. One example for that is the server asking the clients to train for a certain number of local epochs. Flower provides a way to send configuration values from the server to the clients using a dictionary. Let's look at an example where the clients receive values from the server through the ``config`` parameter in ``fit`` (``config`` is also available in ``evaluate``). The ``fit`` method receives the configuration dictionary through the ``config`` parameter and can then read values from this dictionary. In this example, it reads ``server_round`` and ``local_epochs`` and uses those values to improve the logging and configure the number of local training epochs:
es: En algunas situaciones, queremos configurar la ejecución del lado del cliente (entrenamiento, evaluación) desde el lado del servidor. Un ejemplo de esto es el servidor que pide a los clientes que se entrenen durante una cierta cantidad de épocas locales. Flower proporciona una forma de enviar valores de configuración desde el servidor a los clientes mediante un diccionario. Veamos un ejemplo donde los clientes reciben valores del servidor a través del parámetro ``config`` en ``fit`` (``config`` también está disponible en ``evaluate``). El método ``fit`` recibe el diccionario de configuración a través del parámetro ``config`` y luego puede leer valores de este diccionario. En este ejemplo, lee ``server_round`` y ``local_epochs`` y usa esos valores para mejorar el registro y configurar el número de épocas de entrenamiento local:

source: So how can we send this config dictionary from server to clients? The built-in Flower Strategies provide way to do this, and it works similarly to the way server-side evaluation works. We provide a function to the strategy, and the strategy calls this function for every round of federated learning:
es: Entonces, ¿cómo podemos enviar este diccionario de configuración desde el servidor a los clientes? Las Flower Strategies integradas proporcionan una manera de hacer esto y funcionan de manera similar a la forma en que funciona la evaluación del lado del servidor. Proporcionamos una función a la estrategia, y la estrategia llama a esta función para cada ronda de aprendizaje federado:

source: Next, we'll just pass this function to the FedAvg strategy before starting the simulation:
es: A continuación, simplemente pasaremos esta función a la estrategia FedAvg antes de comenzar la simulación:

source: As we can see, the client logs now include the current round of federated learning (which they read from the ``config`` dictionary). We can also configure local training to run for one epoch during the first and second round of federated learning, and then for two epochs during the third round.
es: Como podemos ver, los registros del cliente ahora incluyen la ronda actual de aprendizaje federado (que leen del diccionario ``config``). También podemos configurar el entrenamiento local para que se ejecute durante una época durante la primera y segunda ronda de aprendizaje federado, y luego durante dos épocas durante la tercera ronda.

source: Clients can also return arbitrary values to the server. To do so, they return a dictionary from ``fit`` and/or ``evaluate``. We have seen and used this concept throughout this notebook without mentioning it explicitly: our ``FlowerClient`` returns a dictionary containing a custom key/value pair as the third return value in ``evaluate``.
es: Los clientes también pueden devolver valores arbitrarios al servidor. Para hacerlo, devuelven un diccionario de ``fit`` y/o ``evaluate``. Hemos visto y utilizado este concepto a lo largo de este cuaderno sin mencionarlo explícitamente: nuestro ``FlowerClient`` devuelve un diccionario que contiene un par clave/valor personalizado como tercer valor de retorno en ``evaluar``.

source: Scaling federated learning
es: Ampliar el aprendizaje federado

source: As a last step in this notebook, let's see how we can use Flower to experiment with a large number of clients.
es: Como último paso en este cuaderno, veamos cómo podemos usar Flower para experimentar con una gran cantidad de clientes.

source: We now have 1000 partitions, each holding 45 training and 5 validation examples. Given that the number of training examples on each client is quite small, we should probably train the model a bit longer, so we configure the clients to perform 3 local training epochs. We should also adjust the fraction of clients selected for training during each round (we don't want all 1000 clients participating in every round), so we adjust ``fraction_fit`` to ``0.05``, which means that only 5% of available clients (so 50 clients) will be selected for training each round:
es: Ahora tenemos 1000 particiones, cada una con 45 ejemplos de capacitación y 5 de validación. Dado que la cantidad de ejemplos de entrenamiento en cada cliente es bastante pequeña, probablemente deberíamos entrenar el modelo un poco más, por lo que configuramos los clientes para realizar 3 épocas de entrenamiento locales. También debemos ajustar la fracción de clientes seleccionados para entrenar durante cada ronda (no queremos que los 1000 clientes participen en cada ronda), por lo que ajustamos ``fraction_fit`` a ``0.05``, lo que significa que solo el 5% De los clientes disponibles (es decir, 50 clientes) serán seleccionados para entrenar en cada ronda:

source: In this notebook, we've seen how we can gradually enhance our system by customizing the strategy, initializing parameters on the server side, choosing a different strategy, and evaluating models on the server-side. That's quite a bit of flexibility with so little code, right?
es: En este cuaderno, hemos visto cómo podemos mejorar gradualmente nuestro sistema personalizando la estrategia, inicializando parámetros en el lado del servidor, eligiendo una estrategia diferente y evaluando modelos en el lado del servidor. Eso es bastante flexibilidad con tan poco código, ¿verdad?

source: In the later sections, we've seen how we can communicate arbitrary values between server and clients to fully customize client-side execution. With that capability, we built a large-scale Federated Learning simulation using the Flower Virtual Client Engine and ran an experiment involving 1000 clients in the same workload - all in a Jupyter Notebook!
es: En las secciones posteriores, hemos visto cómo podemos comunicar valores arbitrarios entre el servidor y los clientes para personalizar completamente la ejecución del lado del cliente. Con esa capacidad, creamos una simulación de aprendizaje federado a gran escala utilizando Flower Virtual Client Engine y ejecutamos un experimento que involucró a 1000 clientes en la misma carga de trabajo, ¡todo en un Jupyter Notebook!

source: The `Flower Federated Learning Tutorial - Part 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__ shows how to build a fully custom ``Strategy`` from scratch.
es: El ``Tutorial de aprendizaje federado de Flower - Parte 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__ muestra cómo crear una ``Estrategia totalmente personalizada ``desde cero.

source: What is Federated Learning?
es: ¿Qué es el aprendizaje federado?
