Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: In ``fit``, we first need to deserialize the parameters coming from the server using our custom ``sparse_parameters_to_ndarrays`` and then we need to serialize our local results with ``ndarrays_to_sparse_parameters``.
es: En ``fit``, primero necesitamos deserializar los parámetros provenientes del servidor usando nuestro ``sparse_parameters_to_ndarrays`` personalizado y luego necesitamos serializar nuestros resultados locales con ``ndarrays_to_sparse_parameters``.

source: In ``evaluate``, we will only need to deserialize the global parameters with our custom function.
es: En ``evaluar``, sólo necesitaremos deserializar los parámetros globales con nuestra función personalizada.

source: Server-side
es: Lado del servidor

source: For this example, we will just use ``FedAvg`` as a strategy. To change the serialization and deserialization here, we only need to reimplement the ``evaluate`` and ``aggregate_fit`` functions of ``FedAvg``. The other functions of the strategy will be inherited from the super class ``FedAvg``.
es: Para este ejemplo, usaremos ``FedAvg`` como estrategia. Para cambiar la serialización y deserialización aquí, solo necesitamos volver a implementar las funciones ``evaluate`` y ``aggregate_fit`` de ``FedAvg``. Las demás funciones de la estrategia serán heredadas de la superclase ``FedAvg``.

source: As you can see only one line as change in ``evaluate``:
es: Como puede ver solo una línea como cambio en ``evaluar``:

source: And for ``aggregate_fit``, we will first deserialize every result we received:
es: Y para ``aggregate_fit``, primero deserializaremos cada resultado que recibamos:

source: And then serialize the aggregated result:
es: Y luego serializar el resultado agregado:

source: We can now run our custom serialization example!
es: ¡Ahora podemos ejecutar nuestro ejemplo de serialización personalizado!

source: In this part of the tutorial, we've seen how we can build clients by subclassing either ``NumPyClient`` or ``Client``. ``NumPyClient`` is a convenience abstraction that makes it easier to work with machine learning libraries that have good NumPy interoperability. ``Client`` is a more flexible abstraction that allows us to do things that are not possible in ``NumPyClient``. In order to do so, it requires us to handle parameter serialization and deserialization ourselves.
es: En esta parte del tutorial, hemos visto cómo podemos crear clientes creando subclases de ``NumPyClient`` o ``Client``. ``NumPyClient`` es una abstracción conveniente que facilita el trabajo con bibliotecas de aprendizaje automático que tienen una buena interoperabilidad con NumPy. ``Client`` es una abstracción más flexible que nos permite hacer cosas que no son posibles en ``NumPyClient``. Para hacerlo, es necesario que manejemos nosotros mismos la serialización y deserialización de parámetros.

source: This is the final part of the Flower tutorial (for now!), congratulations! You're now well equipped to understand the rest of the documentation. There are many topics we didn't cover in the tutorial, we recommend the following resources:
es: Esta es la parte final del tutorial de Flores (¡por ahora!), ¡felicidades! Ahora está bien equipado para comprender el resto de la documentación. Hay muchos temas que no cubrimos en el tutorial, recomendamos los siguientes recursos:

source: `Read Flower Docs <https://flower.dev/docs/>`__
es: `Leer documentos de flores <https://flower.dev/docs/>`__

source: `Check out Flower Code Examples <https://github.com/adap/flower/tree/main/examples>`__
es: `Consulte los ejemplos de códigos de flores <https://github.com/adap/flower/tree/main/examples>`__

source: `Use Flower Baselines for your research <https://flower.dev/docs/baselines/>`__
es: `Utilice Flower Baselines para su investigación <https://flower.dev/docs/baselines/>`__

source: `Watch Flower Summit 2023 videos <https://flower.dev/conf/flower-summit-2023/>`__
es: `Mira los vídeos de Flower Summit 2023 <https://flower.dev/conf/flower-summit-2023/>`__

source: Get started with Flower
es: Empezar con Flor

source: Welcome to the Flower federated learning tutorial!
es: ¡Bienvenido al tutorial de aprendizaje federado de Flower!

source: In this notebook, we'll build a federated learning system using Flower and PyTorch. In part 1, we use PyTorch for the model training pipeline and data loading. In part 2, we continue to federate the PyTorch-based pipeline using Flower.
es: En este cuaderno, crearemos un sistema de aprendizaje federado utilizando Flower y PyTorch. En la parte 1, utilizamos PyTorch para el proceso de entrenamiento del modelo y la carga de datos. En la parte 2, continuamos federando la canalización basada en PyTorch utilizando Flower.

source: Let's get stated!
es: ¡Vamos a declararnos!

source: Before we begin with any actual code, let's make sure that we have everything we need.
es: Antes de comenzar con cualquier código real, asegurémonos de tener todo lo que necesitamos.

source: Next, we install the necessary packages for PyTorch (``torch`` and ``torchvision``) and Flower (``flwr``):
es: A continuación, instalamos los paquetes necesarios para PyTorch (``torch`` y ``torchvision``) y Flower (``flwr``):

source: Loading the data
es: Cargando los datos

source: Federated learning can be applied to many different types of tasks across different domains. In this tutorial, we introduce federated learning by training a simple convolutional neural network (CNN) on the popular CIFAR-10 dataset. CIFAR-10 can be used to train image classifiers that distinguish between images from ten different classes:
es: El aprendizaje federado se puede aplicar a muchos tipos diferentes de tareas en diferentes dominios. En este tutorial, presentamos el aprendizaje federado entrenando una red neuronal convolucional (CNN) simple en el popular conjunto de datos CIFAR-10. CIFAR-10 se puede utilizar para entrenar clasificadores de imágenes que distingan entre imágenes de diez clases diferentes:

source: We simulate having multiple datasets from multiple organizations (also called the "cross-silo" setting in federated learning) by splitting the original CIFAR-10 dataset into multiple partitions. Each partition will represent the data from a single organization. We're doing this purely for experimentation purposes, in the real world there's no need for data splitting because each organization already has their own data (so the data is naturally partitioned).
es: Simulamos tener múltiples conjuntos de datos de múltiples organizaciones (también llamado configuración de "silo cruzado" en el aprendizaje federado) dividiendo el conjunto de datos CIFAR-10 original en múltiples particiones. Cada partición representará los datos de una única organización. Estamos haciendo esto únicamente con fines de experimentación; en el mundo real no hay necesidad de dividir los datos porque cada organización ya tiene sus propios datos (por lo que los datos se dividen de forma natural).

source: Each organization will act as a client in the federated learning system. So having ten organizations participate in a federation means having ten clients connected to the federated learning server:
es: Cada organización actuará como cliente en el sistema de aprendizaje federado. Entonces, tener diez organizaciones participando en una federación significa tener diez clientes conectados al servidor de aprendizaje federado:

source: Let's now load the CIFAR-10 training and test set, partition them into ten smaller datasets (each split into training and validation set), and wrap the resulting partitions by creating a PyTorch ``DataLoader`` for each of them:
es: Ahora carguemos el conjunto de entrenamiento y prueba de CIFAR-10, dividámoslos en diez conjuntos de datos más pequeños (cada uno dividido en un conjunto de entrenamiento y validación) y empaquetemos las particiones resultantes creando un ``DataLoader`` de PyTorch para cada uno de ellos:

source: We now have a list of ten training sets and ten validation sets (``trainloaders`` and ``valloaders``) representing the data of ten different organizations. Each ``trainloader``/``valloader`` pair contains 4500 training examples and 500 validation examples. There's also a single ``testloader`` (we did not split the test set). Again, this is only necessary for building research or educational systems, actual federated learning systems have their data naturally distributed across multiple partitions.
es: Ahora tenemos una lista de diez conjuntos de entrenamiento y diez conjuntos de validación ("trainloaders" y "valloaders") que representan los datos de diez organizaciones diferentes. Cada par ``trainloader``/``valloader`` contiene 4500 ejemplos de entrenamiento y 500 ejemplos de validación. También hay un único ``testloader`` (no dividimos el conjunto de pruebas). Nuevamente, esto solo es necesario para construir sistemas educativos o de investigación; los sistemas de aprendizaje federados reales tienen sus datos distribuidos de forma natural en múltiples particiones.

source: Let's take a look at the first batch of images and labels in the first training set (i.e., ``trainloaders[0]``) before we move on:
es: Echemos un vistazo al primer lote de imágenes y etiquetas en el primer conjunto de entrenamiento (es decir, ``trainloaders[0]``) antes de continuar:

source: The output above shows a random batch of images from the first ``trainloader`` in our list of ten ``trainloaders``. It also prints the labels associated with each image (i.e., one of the ten possible labels we've seen above). If you run the cell again, you should see another batch of images.
es: El resultado anterior muestra un lote aleatorio de imágenes del primer ``trainloader`` de nuestra lista de diez ``trainloaders``. También imprime las etiquetas asociadas a cada imagen (es decir, una de las diez etiquetas posibles que hemos visto arriba). Si ejecuta la celda nuevamente, debería ver otro lote de imágenes.

source: Step 1: Centralized Training with PyTorch
es: Paso 1: Entrenamiento centralizado con PyTorch

source: Next, we're going to use PyTorch to define a simple convolutional neural network. This introduction assumes basic familiarity with PyTorch, so it doesn't cover the PyTorch-related aspects in full detail. If you want to dive deeper into PyTorch, we recommend `DEEP LEARNING WITH PYTORCH: A 60 MINUTE BLITZ <https://pytorch.org/tutorials/beginner/deep_learning_60min_blitz.html>`__.
es: A continuación, usaremos PyTorch para definir una red neuronal convolucional simple. Esta introducción supone una familiaridad básica con PyTorch, por lo que no cubre los aspectos relacionados con PyTorch con todo detalle. Si desea profundizar en PyTorch, le recomendamos `APRENDIZAJE PROFUNDO CON PYTORCH: UN BLITZ DE 60 MINUTOS <https://pytorch.org/tutorials/beginner/deep_learning_60min_blitz.html>`__.

source: Defining the model
es: Definiendo el modelo

source: We use the simple CNN described in the `PyTorch tutorial <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html#define-a-convolutional-neural-network>`__:
es: Usamos la CNN simple descrita en el `tutorial de PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html#define-a-convolutional-neural-network>`__:

source: Let's continue with the usual training and test functions:
es: Sigamos con las funciones habituales de entrenamiento y prueba:

source: Training the model
es: Entrenando el modelo

source: We now have all the basic building blocks we need: a dataset, a model, a training function, and a test function. Let's put them together to train the model on the dataset of one of our organizations (``trainloaders[0]``). This simulates the reality of most machine learning projects today: each organization has their own data and trains models only on this internal data:
es: Ahora tenemos todos los componentes básicos que necesitamos: un conjunto de datos, un modelo, una función de entrenamiento y una función de prueba. Juntémoslos para entrenar el modelo en el conjunto de datos de una de nuestras organizaciones ("trainloaders[0]``). Esto simula la realidad de la mayoría de los proyectos de aprendizaje automático actuales: cada organización tiene sus propios datos y entrena modelos solo con estos datos internos:

source: Training the simple CNN on our CIFAR-10 split for 5 epochs should result in a test set accuracy of about 41%, which is not good, but at the same time, it doesn't really matter for the purposes of this tutorial. The intent was just to show a simplistic centralized training pipeline that sets the stage for what comes next - federated learning!
es: Entrenar la CNN simple en nuestra división CIFAR-10 durante 5 épocas debería dar como resultado una precisión del conjunto de prueba de aproximadamente el 41%, lo cual no es bueno, pero al mismo tiempo, realmente no importa para los propósitos de este tutorial. La intención era simplemente mostrar un canal de capacitación centralizado y simplista que prepara el escenario para lo que viene a continuación: ¡aprendizaje federado!

source: Step 2: Federated Learning with Flower
es: Paso 2: Aprendizaje federado con Flower

source: Step 1 demonstrated a simple centralized training pipeline. All data was in one place (i.e., a single ``trainloader`` and a single ``valloader``). Next, we'll simulate a situation where we have multiple datasets in multiple organizations and where we train a model over these organizations using federated learning.
es: El paso 1 demostró un proceso de capacitación centralizado simple. Todos los datos estaban en un solo lugar (es decir, un único ``trainloader`` y un único ``valloader``). A continuación, simularemos una situación en la que tenemos varios conjuntos de datos en varias organizaciones y en la que entrenamos un modelo en estas organizaciones mediante el aprendizaje federado.

source: Updating model parameters
es: Actualización de parámetros del modelo

source: In federated learning, the server sends the global model parameters to the client, and the client updates the local model with the parameters received from the server. It then trains the model on the local data (which changes the model parameters locally) and sends the updated/changed model parameters back to the server (or, alternatively, it sends just the gradients back to the server, not the full model parameters).
es: En el aprendizaje federado, el servidor envía los parámetros del modelo global al cliente y el cliente actualiza el modelo local con los parámetros recibidos del servidor. Luego entrena el modelo con los datos locales (que cambian los parámetros del modelo localmente) y envía los parámetros del modelo actualizados/cambiados al servidor (o, alternativamente, envía solo los gradientes al servidor, no los parámetros completos del modelo). .

source: We need two helper functions to update the local model with parameters received from the server and to get the updated model parameters from the local model: ``set_parameters`` and ``get_parameters``. The following two functions do just that for the PyTorch model above.
es: Necesitamos dos funciones auxiliares para actualizar el modelo local con los parámetros recibidos del servidor y obtener los parámetros actualizados del modelo local: ``set_parameters`` y ``get_parameters``. Las siguientes dos funciones hacen precisamente eso para el modelo PyTorch anterior.

source: The details of how this works are not really important here (feel free to consult the PyTorch documentation if you want to learn more). In essence, we use ``state_dict`` to access PyTorch model parameter tensors. The parameter tensors are then converted to/from a list of NumPy ndarray's (which Flower knows how to serialize/deserialize):
es: Los detalles de cómo funciona esto no son realmente importantes aquí (no dudes en consultar la documentación de PyTorch si quieres obtener más información). En esencia, usamos ``state_dict`` para acceder a los tensores de parámetros del modelo PyTorch. Los tensores de parámetros luego se convierten a/desde una lista de NumPy ndarray (que Flower sabe cómo serializar/deserializar):

source: Implementing a Flower client
es: Implementando un cliente Flower

source: With that out of the way, let's move on to the interesting part. Federated learning systems consist of a server and multiple clients. In Flower, we create clients by implementing subclasses of ``flwr.client.Client`` or ``flwr.client.NumPyClient``. We use ``NumPyClient`` in this tutorial because it is easier to implement and requires us to write less boilerplate.
es: Dejando esto de lado, pasemos a la parte interesante. Los sistemas de aprendizaje federados constan de un servidor y varios clientes. En Flower, creamos clientes implementando subclases de ``flwr.client.Client`` o ``flwr.client.NumPyClient``. Usamos ``NumPyClient`` en este tutorial porque es más fácil de implementar y requiere que escribamos menos texto repetitivo.

source: To implement the Flower client, we create a subclass of ``flwr.client.NumPyClient`` and implement the three methods ``get_parameters``, ``fit``, and ``evaluate``:
es: Para implementar el cliente Flower, creamos una subclase de ``flwr.client.NumPyClient`` e implementamos los tres métodos ``get_parameters``, ``fit`` y ``evaluate``:

source: ``get_parameters``: Return the current local model parameters
es: ``get_parameters``: Devuelve los parámetros del modelo local actual

source: ``fit``: Receive model parameters from the server, train the model parameters on the local data, and return the (updated) model parameters to the server
es: ``fit``: recibe los parámetros del modelo desde el servidor, entrena los parámetros del modelo en los datos locales y devuelve los parámetros del modelo (actualizados) al servidor.

source: ``evaluate``: Receive model parameters from the server, evaluate the model parameters on the local data, and return the evaluation result to the server
es: ``evaluar``: recibe los parámetros del modelo del servidor, evalúa los parámetros del modelo en los datos locales y devuelve el resultado de la evaluación al servidor

source: We mentioned that our clients will use the previously defined PyTorch components for model training and evaluation. Let's see a simple Flower client implementation that brings everything together:
es: Mencionamos que nuestros clientes utilizarán los componentes de PyTorch previamente definidos para la capacitación y evaluación del modelo. Veamos una implementación simple del cliente Flower que reúne todo:

source: Our class ``FlowerClient`` defines how local training/evaluation will be performed and allows Flower to call the local training/evaluation through ``fit`` and ``evaluate``. Each instance of ``FlowerClient`` represents a *single client* in our federated learning system. Federated learning systems have multiple clients (otherwise, there's not much to federate), so each client will be represented by its own instance of ``FlowerClient``. If we have, for example, three clients in our workload, then we'd have three instances of ``FlowerClient``. Flower calls ``FlowerClient.fit`` on the respective instance when the server selects a particular client for training (and ``FlowerClient.evaluate`` for evaluation).
es: Nuestra clase ``FlowerClient`` define cómo se realizará la capacitación/evaluación local y permite a Flower llamar a la capacitación/evaluación local a través de ``fit`` y ``evaluate``. Cada instancia de ``FlowerClient`` representa un *único cliente* en nuestro sistema de aprendizaje federado. Los sistemas de aprendizaje federados tienen múltiples clientes (de lo contrario, no hay mucho que federar), por lo que cada cliente estará representado por su propia instancia de ``FlowerClient``. Si tenemos, por ejemplo, tres clientes en nuestra carga de trabajo, entonces tendríamos tres instancias de ``FlowerClient``. Flower llama a ``FlowerClient.fit`` en la instancia respectiva cuando el servidor selecciona un cliente en particular para entrenamiento (y ``FlowerClient.evaluate`` para evaluación).

source: Using the Virtual Client Engine
es: Usando el motor de cliente virtual

source: In this notebook, we want to simulate a federated learning system with 10 clients on a single machine. This means that the server and all 10 clients will live on a single machine and share resources such as CPU, GPU, and memory. Having 10 clients would mean having 10 instances of ``FlowerClient`` in memory. Doing this on a single machine can quickly exhaust the available memory resources, even if only a subset of these clients participates in a single round of federated learning.
es: En este cuaderno, queremos simular un sistema de aprendizaje federado con 10 clientes en una sola máquina. Esto significa que el servidor y los 10 clientes vivirán en una sola máquina y compartirán recursos como CPU, GPU y memoria. Tener 10 clientes significaría tener 10 instancias de ``FlowerClient`` en memoria. Hacer esto en una sola máquina puede agotar rápidamente los recursos de memoria disponibles, incluso si solo un subconjunto de estos clientes participa en una única ronda de aprendizaje federado.

source: In addition to the regular capabilities where server and clients run on multiple machines, Flower, therefore, provides special simulation capabilities that create ``FlowerClient`` instances only when they are actually necessary for training or evaluation. To enable the Flower framework to create clients when necessary, we need to implement a function called ``client_fn`` that creates a ``FlowerClient`` instance on demand. Flower calls ``client_fn`` whenever it needs an instance of one particular client to call ``fit`` or ``evaluate`` (those instances are usually discarded after use, so they should not keep any local state). Clients are identified by a client ID, or short ``cid``. The ``cid`` can be used, for example, to load different local data partitions for different clients, as can be seen below:
es: Además de las capacidades habituales en las que el servidor y los clientes se ejecutan en varias máquinas, Flower proporciona capacidades de simulación especiales que crean instancias de ``FlowerClient`` sólo cuando son realmente necesarias para la capacitación o la evaluación. Para permitir que el marco Flower cree clientes cuando sea necesario, necesitamos implementar una función llamada ``client_fn`` que crea una instancia ``FlowerClient`` bajo demanda. Flower llama a ``client_fn`` siempre que necesita una instancia de un cliente en particular para llamar a ``fit`` o ``evaluate`` (esas instancias generalmente se descartan después de su uso, por lo que no deben conservar ningún estado local). Los clientes se identifican mediante un ID de cliente o "cid" abreviado. El ``cid`` se puede utilizar, por ejemplo, para cargar diferentes particiones de datos locales para diferentes clientes, como se puede ver a continuación:

source: Starting the training
es: Comenzando el entrenamiento

source: We now have the class ``FlowerClient`` which defines client-side training/evaluation and ``client_fn`` which allows Flower to create ``FlowerClient`` instances whenever it needs to call ``fit`` or ``evaluate`` on one particular client. The last step is to start the actual simulation using ``flwr.simulation.start_simulation``.
es: Ahora tenemos la clase ``FlowerClient`` que define la capacitación/evaluación del lado del cliente y ``client_fn`` que permite a Flower crear instancias de ``FlowerClient`` siempre que necesite llamar a ``fit`` o ``evaluate` ` en un cliente en particular. El último paso es iniciar la simulación real usando ``flwr.simulation.start_simulation``.
