Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: In this tutorial, you will learn what federated learning is, build your first system in Flower, and gradually extend it. If you work through all parts of the tutorial, you will be able to build advanced federated learning systems that approach the current state of the art in the field.
es: En este tutorial, aprenderá qué es el aprendizaje federado, creará su primer sistema en Flower y lo ampliará gradualmente. Si trabaja en todas las partes del tutorial, podrá crear sistemas avanzados de aprendizaje federado que se acerquen al estado actual del arte en el campo.

source: 🧑‍🏫 This tutorial starts at zero and expects no familiarity with federated learning. Only a basic understanding of data science and Python programming is assumed.
es: 🧑‍🏫 Este tutorial comienza desde cero y no requiere estar familiarizado con el aprendizaje federado. Solo se supone un conocimiento básico de la ciencia de datos y la programación en Python.

source: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ and join the open-source Flower community on Slack to connect, ask questions, and get help: `Join Slack <https://flower.dev/join-slack>`__ 🌼 We'd love to hear from you in the ``#introductions`` channel! And if anything is unclear, head over to the ``#questions`` channel.
es: `Star Flower en GitHub <https://github.com/adap/flower>`__ ⭐️ y únete a la comunidad Flower de código abierto en Slack para conectarte, hacer preguntas y obtener ayuda: `Únete a Slack <https://flower .dev/join-slack>`__ 🌼 ¡Nos encantaría saber de ti en el canal ``#introductions``! Y si algo no queda claro, dirígete al canal ``#preguntas``.

source: Classic machine learning
es: Aprendizaje automático clásico

source: Before we begin to discuss federated learning, let us quickly recap how most machine learning works today.
es: Antes de comenzar a analizar el aprendizaje federado, recapitulemos rápidamente cómo funciona la mayor parte del aprendizaje automático en la actualidad.

source: In machine learning, we have a model, and we have data. The model could be a neural network (as depicted here), or something else, like classical linear regression.
es: En el aprendizaje automático, tenemos un modelo y tenemos datos. El modelo podría ser una red neuronal (como se muestra aquí) o algo más, como la regresión lineal clásica.

source: Model and data
es: Modelo y datos

source: We train the model using the data to perform a useful task. A task could be to detect objects in images, transcribe an audio recording, or play a game like Go.
es: Entrenamos el modelo utilizando los datos para realizar una tarea útil. Una tarea podría ser detectar objetos en imágenes, transcribir una grabación de audio o jugar un juego como Go.

source: Train model using data
es: Entrenar modelo usando datos

source: Now, in practice, the training data we work with doesn't originate on the machine we train the model on. It gets created somewhere else.
es: Ahora, en la práctica, los datos de entrenamiento con los que trabajamos no se originan en la máquina en la que entrenamos el modelo. Se crea en otro lugar.

source: It originates on a smartphone by the user interacting with an app, a car collecting sensor data, a laptop receiving input via the keyboard, or a smart speaker listening to someone trying to sing a song.
es: Se origina en un teléfono inteligente cuando el usuario interactúa con una aplicación, un automóvil que recopila datos de sensores, una computadora portátil que recibe información a través del teclado o un altavoz inteligente que escucha a alguien que intenta cantar una canción.

source: Data on a phone
es: datos en un telefono

source: What's also important to mention, this "somewhere else" is usually not just one place, it's many places. It could be several devices all running the same app. But it could also be several organizations, all generating data for the same task.
es: Lo que también es importante mencionar es que este "otro lugar" generalmente no es solo un lugar, sino muchos lugares. Podrían ser varios dispositivos ejecutando la misma aplicación. Pero también podrían ser varias organizaciones, todas generando datos para la misma tarea.

source: Data is on many devices
es: Los datos están en muchos dispositivos.

source: So to use machine learning, or any kind of data analysis, the approach that has been used in the past was to collect all data on a central server. This server can be somewhere in a data center, or somewhere in the cloud.
es: Entonces, para utilizar el aprendizaje automático o cualquier tipo de análisis de datos, el enfoque que se utilizó en el pasado fue recopilar todos los datos en un servidor central. Este servidor puede estar en algún lugar de un centro de datos o en algún lugar de la nube.

source: Central data collection
es: Recopilación central de datos

source: Once all the data is collected in one place, we can finally use machine learning algorithms to train our model on the data. This is the machine learning approach that we've basically always relied on.
es: Una vez que todos los datos se recopilan en un solo lugar, finalmente podemos usar algoritmos de aprendizaje automático para entrenar nuestro modelo con los datos. Este es el enfoque de aprendizaje automático en el que básicamente siempre hemos confiado.

source: Central model training
es: Entrenamiento de modelo central

source: Challenges of classical machine learning
es: Desafíos del aprendizaje automático clásico

source: The classic machine learning approach we've just seen can be used in some cases. Great examples include categorizing holiday photos, or analyzing web traffic. Cases, where all the data is naturally available on a centralized server.
es: En algunos casos se puede utilizar el enfoque clásico de aprendizaje automático que acabamos de ver. Buenos ejemplos incluyen categorizar fotos de vacaciones o analizar el tráfico web. Casos en los que todos los datos están naturalmente disponibles en un servidor centralizado.

source: Centralized possible
es: Centralizado posible

source: But the approach can not be used in many other cases. Cases, where the data is not available on a centralized server, or cases where the data available on one server is not enough to train a good model.
es: Pero este enfoque no se puede utilizar en muchos otros casos. Casos en los que los datos no están disponibles en un servidor centralizado o casos en los que los datos disponibles en un servidor no son suficientes para entrenar un buen modelo.

source: Centralized impossible
es: Centralizado imposible

source: There are many reasons why the classic centralized machine learning approach does not work for a large number of highly important real-world use cases. Those reasons include:
es: Hay muchas razones por las que el enfoque clásico de aprendizaje automático centralizado no funciona para una gran cantidad de casos de uso muy importantes del mundo real. Esas razones incluyen:

source: **Regulations**: GDPR (Europe), CCPA (California), PIPEDA (Canada), LGPD (Brazil), PDPL (Argentina), KVKK (Turkey), POPI (South Africa), FSS (Russia), CDPR (China), PDPB (India), PIPA (Korea), APPI (Japan), PDP (Indonesia), PDPA (Singapore), APP (Australia), and other regulations protect sensitive data from being moved. In fact, those regulations sometimes even prevent single organizations from combining their own users' data for artificial intelligence training because those users live in different parts of the world, and their data is governed by different data protection regulations.
es: **Regulaciones**: GDPR (Europa), CCPA (California), PIPEDA (Canadá), LGPD (Brasil), PDPL (Argentina), KVKK (Turquía), POPI (Sudáfrica), FSS (Rusia), CDPR (China) ), PDPB (India), PIPA (Corea), APPI (Japón), PDP (Indonesia), PDPA (Singapur), APP (Australia) y otras regulaciones protegen la transferencia de datos confidenciales. De hecho, esas regulaciones a veces incluso impiden que organizaciones individuales combinen los datos de sus propios usuarios para capacitación en inteligencia artificial porque esos usuarios viven en diferentes partes del mundo y sus datos se rigen por diferentes regulaciones de protección de datos.

source: **User preference**: In addition to regulation, there are use cases where users just expect that no data leaves their device, ever. If you type your passwords and credit card info into the digital keyboard of your phone, you don't expect those passwords to end up on the server of the company that developed that keyboard, do you? In fact, that use case was the reason federated learning was invented in the first place.
es: **Preferencia del usuario**: además de la regulación, hay casos de uso en los que los usuarios simplemente esperan que nunca salgan datos de su dispositivo. Si escribe sus contraseñas y la información de su tarjeta de crédito en el teclado digital de su teléfono, no espera que esas contraseñas terminen en el servidor de la empresa que desarrolló ese teclado, ¿verdad? De hecho, ese caso de uso fue la razón por la que se inventó el aprendizaje federado en primer lugar.

source: **Data volume**: Some sensors, like cameras, produce such a high data volume that it is neither feasible nor economic to collect all the data (due to, for example, bandwidth or communication efficiency). Think about a national rail service with hundreds of train stations across the country. If each of these train stations is outfitted with a number of security cameras, the volume of raw on-device data they produce requires incredibly powerful and exceedingly expensive infrastructure to process and store. And most of the data isn't even useful.
es: **Volumen de datos**: Algunos sensores, como las cámaras, producen un volumen de datos tan alto que no es factible ni económico recopilar todos los datos (debido, por ejemplo, al ancho de banda o a la eficiencia de la comunicación). Piense en un servicio ferroviario nacional con cientos de estaciones de tren en todo el país. Si cada una de estas estaciones de tren está equipada con varias cámaras de seguridad, el volumen de datos sin procesar en los dispositivos que producen requiere una infraestructura increíblemente poderosa y extremadamente costosa para procesar y almacenar. Y la mayoría de los datos ni siquiera son útiles.

source: Examples where centralized machine learning does not work include:
es: Los ejemplos en los que el aprendizaje automático centralizado no funciona incluyen:

source: Sensitive healthcare records from multiple hospitals to train cancer detection models
es: Registros sanitarios confidenciales de múltiples hospitales para entrenar modelos de detección de cáncer

source: Financial information from different organizations to detect financial fraud
es: Información financiera de diferentes organizaciones para detectar fraude financiero

source: Location data from your electric car to make better range prediction
es: Datos de ubicación de tu coche eléctrico para hacer una mejor predicción de la autonomía

source: End-to-end encrypted messages to train better auto-complete models
es: Mensajes cifrados de extremo a extremo para entrenar mejores modelos de autocompletar

source: The popularity of privacy-enhancing systems like the `Brave <https://brave.com/>`__ browser or the `Signal <https://signal.org/>`__ messenger shows that users care about privacy. In fact, they choose the privacy-enhancing version over other alternatives, if such an alernative exists. But what can we do to apply machine learning and data science to these cases to utilize private data? After all, these are all areas that would benefit significantly from recent advances in AI.
es: La popularidad de sistemas que mejoran la privacidad como el navegador `Brave <https://brave.com/>`__ o el mensajero `Signal <https://signal.org/>`__ muestra que los usuarios se preocupan por la privacidad. De hecho, eligen la versión que mejora la privacidad sobre otras alternativas, si tal alternativa existe. Pero, ¿qué podemos hacer para aplicar el aprendizaje automático y la ciencia de datos a estos casos para utilizar datos privados? Después de todo, todas estas son áreas que se beneficiarían significativamente de los recientes avances en IA.

source: Federated learning
es: Aprendizaje federado

source: Federated learning simply reverses this approach. It enables machine learning on distributed data by moving the training to the data, instead of moving the data to the training. Here's the single-sentence explanation:
es: El aprendizaje federado simplemente invierte este enfoque. Permite el aprendizaje automático sobre datos distribuidos trasladando la capacitación a los datos, en lugar de mover los datos a la capacitación. Aquí está la explicación de una sola frase:

source: Central machine learning: move the data to the computation
es: Aprendizaje automático central: mover los datos al cómputo

source: Federated (machine) learning: move the computation to the data
es: Aprendizaje federado (máquina): mueva el cálculo a los datos

source: By doing so, it enables us to use machine learning (and other data science approaches) in areas where it wasn't possible before. We can now train excellent medical AI models by enabling different hospitals to work together. We can solve financial fraud by training AI models on the data of different financial institutions. We can build novel privacy-enhancing applications (such as secure messaging) that have better built-in AI than their non-privacy-enhancing alternatives. And those are just a few of the examples that come to mind. As we deploy federated learning, we discover more and more areas that can suddenly be reinvented because they now have access to vast amounts of previously inaccessible data.
es: Al hacerlo, nos permite utilizar el aprendizaje automático (y otros enfoques de ciencia de datos) en áreas donde antes no era posible. Ahora podemos entrenar excelentes modelos de IA médica permitiendo que diferentes hospitales trabajen juntos. Podemos resolver el fraude financiero entrenando modelos de IA con los datos de diferentes instituciones financieras. Podemos crear nuevas aplicaciones que mejoren la privacidad (como mensajería segura) que tengan una mejor IA integrada que sus alternativas que no mejoran la privacidad. Y esos son sólo algunos de los ejemplos que me vienen a la mente. A medida que implementamos el aprendizaje federado, descubrimos cada vez más áreas que de repente pueden reinventarse porque ahora tienen acceso a grandes cantidades de datos que antes eran inaccesibles.

source: So how does federated learning work, exactly? Let's start with an intuitive explanation.
es: Entonces, ¿cómo funciona exactamente el aprendizaje federado? Comencemos con una explicación intuitiva.

source: Federated learning in five steps
es: Aprendizaje federado en cinco pasos

source: Step 0: Initialize global model
es: Paso 0: inicializar el modelo global

source: We start by initializing the model on the server. This is exactly the same in classic centralized learning: we initialize the model parameters, either randomly or from a previously saved checkpoint.
es: Comenzamos inicializando el modelo en el servidor. Esto es exactamente lo mismo en el aprendizaje centralizado clásico: inicializamos los parámetros del modelo, ya sea aleatoriamente o desde un punto de control previamente guardado.

source: Initialize global model
es: Inicializar modelo global

source: Step 1: Send model to a number of connected organizations/devices (client nodes)
es: Paso 1: enviar el modelo a varias organizaciones/dispositivos conectados (nodos cliente)

source: Next, we send the parameters of the global model to the connected client nodes (think: edge devices like smartphones or servers belonging to organizations). This is to ensure that each participating node starts their local training using the same model parameters. We often use only a few of the connected nodes instead of all nodes. The reason for this is that selecting more and more client nodes has diminishing returns.
es: A continuación, enviamos los parámetros del modelo global a los nodos clientes conectados (piense: dispositivos periféricos como teléfonos inteligentes o servidores que pertenecen a organizaciones). Esto es para garantizar que cada nodo participante comience su entrenamiento local utilizando los mismos parámetros del modelo. A menudo utilizamos sólo unos pocos de los nodos conectados en lugar de todos los nodos. La razón de esto es que seleccionar cada vez más nodos de clientes tiene rendimientos decrecientes.

source: Send global model
es: Enviar modelo global

source: Step 2: Train model locally on the data of each organization/device (client node)
es: Paso 2: Entrenar el modelo localmente con los datos de cada organización/dispositivo (nodo cliente)

source: Now that all (selected) client nodes have the latest version of the global model parameters, they start the local training. They use their own local dataset to train their own local model. They don't train the model until full convergence, but they only train for a little while. This could be as little as one epoch on the local data, or even just a few steps (mini-batches).
es: Ahora que todos los nodos cliente (seleccionados) tienen la última versión de los parámetros del modelo global, comienzan el entrenamiento local. Utilizan su propio conjunto de datos local para entrenar su propio modelo local. No entrenan el modelo hasta la convergencia total, pero solo entrenan por un tiempo. Esto podría ser tan solo una época en los datos locales, o incluso solo unos pocos pasos (minilotes).

source: Train on local data
es: Entrene con datos locales

source: Step 3: Return model updates back to the server
es: Paso 3: devolver las actualizaciones del modelo al servidor

source: After local training, each client node has a slightly different version of the model parameters they originally received. The parameters are all different because each client node has different examples in its local dataset. The client nodes then send those model updates back to the server. The model updates they send can either be the full model parameters or just the gradients that were accumulated during local training.
es: Después del entrenamiento local, cada nodo cliente tiene una versión ligeramente diferente de los parámetros del modelo que recibió originalmente. Todos los parámetros son diferentes porque cada nodo cliente tiene ejemplos diferentes en su conjunto de datos local. Luego, los nodos cliente envían esas actualizaciones del modelo al servidor. Las actualizaciones del modelo que envían pueden ser los parámetros completos del modelo o solo los gradientes acumulados durante el entrenamiento local.

source: Send model updates
es: Enviar actualizaciones de modelo

source: Step 4: Aggregate model updates into a new global model
es: Paso 4: agregar actualizaciones del modelo en un nuevo modelo global

source: The server receives model updates from the selected client nodes. If it selected 100 client nodes, it now has 100 slightly different versions of the original global model, each trained on the local data of one client. But didn't we want to have one model that contains the learnings from the data of all 100 client nodes?
es: El servidor recibe actualizaciones del modelo de los nodos cliente seleccionados. Si seleccionó 100 nodos de cliente, ahora tiene 100 versiones ligeramente diferentes del modelo global original, cada una entrenada con los datos locales de un cliente. ¿Pero no queríamos tener un modelo que contenga lo aprendido a partir de los datos de los 100 nodos cliente?

source: In order to get one single model, we have to combine all the model updates we received from the client nodes. This process is called *aggregation*, and there are many different ways to do it. The most basic way to do it is called *Federated Averaging* (`McMahan et al., 2016 <https://arxiv.org/abs/1602.05629>`__), often abbreviated as *FedAvg*. *FedAvg* takes the 100 model updates and, as the name suggests, averages them. To be more precise, it takes the *weighted average* of the model updates, weighted by the number of examples each client used for training. The weighting is important to make sure that each data example has the same "influence" on the resulting global model. If one client has 10 examples, and another client has 100 examples, then - without weighting - each of the 10 examples would influence the global model ten times as much as each of the 100 examples.
es: Para obtener un solo modelo, debemos combinar todas las actualizaciones de modelos que recibimos de los nodos clientes. Este proceso se llama *agregación* y hay muchas formas diferentes de hacerlo. La forma más básica de hacerlo se llama *Promedio federado* (`McMahan et al., 2016 <https://arxiv.org/abs/1602.05629>`__), a menudo abreviado como *FedAvg*. *FedAvg* toma las 100 actualizaciones de modelos y, como sugiere el nombre, las promedia. Para ser más precisos, toma el *promedio ponderado* de las actualizaciones del modelo, ponderado por la cantidad de ejemplos que cada cliente usó para el entrenamiento. La ponderación es importante para garantizar que cada ejemplo de datos tenga la misma "influencia" en el modelo global resultante. Si un cliente tiene 10 ejemplos y otro cliente tiene 100 ejemplos, entonces, sin ponderación, cada uno de los 10 ejemplos influiría en el modelo global diez veces más que cada uno de los 100 ejemplos.

source: Aggregate model updates
es: Actualizaciones del modelo agregado

source: Step 5: Repeat steps 1 to 4 until the model converges
es: Paso 5: repita los pasos 1 a 4 hasta que el modelo converja

source: Steps 1 to 4 are what we call a single round of federated learning. The global model parameters get sent to the participating client nodes (step 1), the client nodes train on their local data (step 2), they send their updated models to the server (step 3), and the server then aggregates the model updates to get a new version of the global model (step 4).
es: Los pasos 1 a 4 son lo que llamamos una ronda única de aprendizaje federado. Los parámetros del modelo global se envían a los nodos cliente participantes (paso 1), los nodos cliente se entrenan con sus datos locales (paso 2), envían sus modelos actualizados al servidor (paso 3) y el servidor luego agrega las actualizaciones del modelo. para obtener una nueva versión del modelo global (paso 4).

source: During a single round, each client node that participates in that iteration only trains for a little while. This means that after the aggregation step (step 4), we have a model that has been trained on all the data of all participating client nodes, but only for a little while. We then have to repeat this training process over and over again to eventually arrive at a fully trained model that performs well across the data of all client nodes.
es: Durante una sola ronda, cada nodo cliente que participa en esa iteración solo entrena por un tiempo. Esto significa que después del paso de agregación (paso 4), tenemos un modelo que ha sido entrenado con todos los datos de todos los nodos clientes participantes, pero solo por un tiempo. Luego tenemos que repetir este proceso de capacitación una y otra vez para llegar finalmente a un modelo completamente entrenado que funcione bien en los datos de todos los nodos del cliente.
