Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: **Updated documentation** ([#1355](https://github.com/adap/flower/pull/1355), [#1558](https://github.com/adap/flower/pull/1558), [#1379](https://github.com/adap/flower/pull/1379), [#1380](https://github.com/adap/flower/pull/1380), [#1381](https://github.com/adap/flower/pull/1381), [#1332](https://github.com/adap/flower/pull/1332), [#1391](https://github.com/adap/flower/pull/1391), [#1403](https://github.com/adap/flower/pull/1403), [#1364](https://github.com/adap/flower/pull/1364), [#1409](https://github.com/adap/flower/pull/1409), [#1419](https://github.com/adap/flower/pull/1419), [#1444](https://github.com/adap/flower/pull/1444), [#1448](https://github.com/adap/flower/pull/1448), [#1417](https://github.com/adap/flower/pull/1417), [#1449](https://github.com/adap/flower/pull/1449), [#1465](https://github.com/adap/flower/pull/1465), [#1467](https://github.com/adap/flower/pull/1467))
es: **Documentación actualizada** ([#1355](https://github.com/adap/flower/pull/1355), [#1558](https://github.com/adap/flower/pull/1558) , [#1379](https://github.com/adap/flower/pull/1379), [#1380](https://github.com/adap/flower/pull/1380), [#1381]( https://github.com/adap/flower/pull/1381), [#1332](https://github.com/adap/flower/pull/1332), [#1391](https://github. com/adap/flower/pull/1391), [#1403](https://github.com/adap/flower/pull/1403), [#1364](https://github.com/adap/flower/ pull/1364), [#1409](https://github.com/adap/flower/pull/1409), [#1419](https://github.com/adap/flower/pull/1419), [ #1444](https://github.com/adap/flower/pull/1444), [#1448](https://github.com/adap/flower/pull/1448), [#1417](https: //github.com/adap/flower/pull/1417), [#1449](https://github.com/adap/flower/pull/1449), [#1465](https://github.com/ adapta/flower/pull/1465), [#1467](https://github.com/adap/flower/pull/1467))

source: There have been so many documentation updates that it doesn't even make sense to list them individually.
es: Ha habido tantas actualizaciones de documentación que ni siquiera tiene sentido enumerarlas individualmente.

source: **Restructured documentation** ([#1387](https://github.com/adap/flower/pull/1387))
es: **Documentación reestructurada** ([#1387](https://github.com/adap/flower/pull/1387))

source: The documentation has been restructured to make it easier to navigate. This is just the first step in a larger effort to make the Flower documentation the best documentation of any project ever. Stay tuned!
es: La documentación ha sido reestructurada para facilitar la navegación. Este es sólo el primer paso de un esfuerzo mayor para hacer de la documentación de Flower la mejor documentación de cualquier proyecto. ¡Manténganse al tanto!

source: **Open in Colab button** ([#1389](https://github.com/adap/flower/pull/1389))
es: **Botón Abrir en Colab** ([#1389](https://github.com/adap/flower/pull/1389))

source: The four parts of the Flower Federated Learning Tutorial now come with a new `Open in Colab` button. No need to install anything on your local machine, you can now use and learn about Flower in your browser, it's only a single click away.
es: Las cuatro partes del Tutorial de aprendizaje federado de Flower ahora vienen con un nuevo botón "Abrir en Colab". No es necesario instalar nada en su máquina local, ahora puede usar y aprender sobre Flower en su navegador, con solo un clic de distancia.

source: **Improved tutorial** ([#1468](https://github.com/adap/flower/pull/1468), [#1470](https://github.com/adap/flower/pull/1470), [#1472](https://github.com/adap/flower/pull/1472), [#1473](https://github.com/adap/flower/pull/1473), [#1474](https://github.com/adap/flower/pull/1474), [#1475](https://github.com/adap/flower/pull/1475))
es: **Tutorial mejorado** ([#1468](https://github.com/adap/flower/pull/1468), [#1470](https://github.com/adap/flower/pull/1470) , [#1472](https://github.com/adap/flower/pull/1472), [#1473](https://github.com/adap/flower/pull/1473), [#1474]( https://github.com/adap/flower/pull/1474), [#1475](https://github.com/adap/flower/pull/1475))

source: The Flower Federated Learning Tutorial has two brand-new parts covering custom strategies (still WIP) and the distinction between `Client` and `NumPyClient`. The existing parts one and two have also been improved (many small changes and fixes).
es: El Tutorial de Aprendizaje Federado de Flower tiene dos partes completamente nuevas que cubren estrategias personalizadas (aún WIP) y la distinción entre "Cliente" y "NumPyClient". Las partes uno y dos existentes también se han mejorado (muchos pequeños cambios y correcciones).

source: Highlights
es: Reflejos

source: Stable **Virtual Client Engine** (accessible via `start_simulation`)
es: Estable **Virtual Client Engine** (accesible a través de `start_simulation`)

source: All `Client`/`NumPyClient` methods are now optional
es: Todos los métodos `Client`/`NumPyClient` ahora son opcionales

source: Tons of small API cleanups resulting in a more coherent developer experience
es: Toneladas de pequeñas limpiezas de API que dan como resultado una experiencia de desarrollador más coherente

source: We would like to give our **special thanks** to all the contributors who made Flower 1.0 possible (in reverse [GitHub Contributors](https://github.com/adap/flower/graphs/contributors) order):
es: Nos gustaría dar nuestro **agradecimiento especial** a todos los contribuyentes que hicieron posible Flower 1.0 (en orden inverso [Colaboradores de GitHub](https://github.com/adap/flower/graphs/contributors)):

source: **All arguments must be passed as keyword arguments** ([#1338](https://github.com/adap/flower/pull/1338))
es: **Todos los argumentos deben pasarse como argumentos de palabras clave** ([#1338](https://github.com/adap/flower/pull/1338))

source: Pass all arguments as keyword arguments, positional arguments are not longer supported. Code that uses positional arguments (e.g., `start_client("127.0.0.1:8080", FlowerClient())`) must add the keyword for each positional argument (e.g., `start_client(server_address="127.0.0.1:8080", client=FlowerClient())`).
es: Pase todos los argumentos como argumentos de palabras clave; los argumentos posicionales ya no son compatibles. El código que utiliza argumentos posicionales (por ejemplo, `start_client("127.0.0.1:8080", FlowerClient())`) debe agregar la palabra clave para cada argumento posicional (por ejemplo, `start_client(server_address="127.0.0.1:8080", client =ClienteFlor())`).

source: **Introduce configuration object** `ServerConfig` **in** `start_server` **and** `start_simulation` ([#1317](https://github.com/adap/flower/pull/1317))
es: **Introduzca el objeto de configuración** `ServerConfig` **en** `start_server` **y** `start_simulation` ([#1317](https://github.com/adap/flower/pull/1317))

source: Instead of a config dictionary `{"num_rounds": 3, "round_timeout": 600.0}`, `start_server` and `start_simulation` now expect a configuration object of type `flwr.server.ServerConfig`. `ServerConfig` takes the same arguments that as the previous config dict, but it makes writing type-safe code easier and the default parameters values more transparent.
es: En lugar de un diccionario de configuración `{"num_rounds": 3, "round_timeout": 600.0}`, `start_server` y `start_simulation` ahora esperan un objeto de configuración de tipo `flwr.server.ServerConfig`. `ServerConfig` toma los mismos argumentos que el dictado de configuración anterior, pero facilita la escritura de código con seguridad de tipos y los valores de los parámetros predeterminados son más transparentes.

source: **Rename built-in strategy parameters for clarity** ([#1334](https://github.com/adap/flower/pull/1334))
es: **Cambie el nombre de los parámetros de estrategia integrados para mayor claridad** ([#1334](https://github.com/adap/flower/pull/1334))

source: The following built-in strategy parameters were renamed to improve readability and consistency with other API's:
es: Se cambió el nombre de los siguientes parámetros de estrategia integrados para mejorar la legibilidad y la coherencia con otras API:

source: `fraction_eval` --> `fraction_evaluate`
es: `fracción_eval` --> `fracción_evaluar`

source: `eval_fn` --> `evaluate_fn`
es: `eval_fn` --> `evaluar_fn`

source: **Update default arguments of built-in strategies** ([#1278](https://github.com/adap/flower/pull/1278))
es: **Actualizar argumentos predeterminados de estrategias integradas** ([#1278](https://github.com/adap/flower/pull/1278))

source: All built-in strategies now use `fraction_fit=1.0` and `fraction_evaluate=1.0`, which means they select *all* currently available clients for training and evaluation. Projects that relied on the previous default values can get the previous behaviour by initializing the strategy in the following way:
es: Todas las estrategias integradas ahora usan `fraction_fit=1.0` y `fraction_evaluate=1.0`, lo que significa que seleccionan *todos* los clientes actualmente disponibles para capacitación y evaluación. Los proyectos que dependían de los valores predeterminados anteriores pueden obtener el comportamiento anterior inicializando la estrategia de la siguiente manera:

source: `strategy = FedAvg(fraction_fit=0.1, fraction_evaluate=0.1)`
es: `estrategia = FedAvg(fracción_fit=0.1, fracción_evaluate=0.1)`

source: **Add** `server_round` **to** `Strategy.evaluate` ([#1334](https://github.com/adap/flower/pull/1334))
es: **Agregar** `server_round` **a** `Strategy.evaluate` ([#1334](https://github.com/adap/flower/pull/1334))

source: The `Strategy` method `evaluate` now receives the current round of federated learning/evaluation as the first parameter.
es: El método "Evaluar" de "Estrategia" ahora recibe la ronda actual de aprendizaje/evaluación federada como primer parámetro.

source: **Add** `server_round` **and** `config` **parameters to** `evaluate_fn` ([#1334](https://github.com/adap/flower/pull/1334))
es: **Agregue** `server_round` **y** `config` **parámetros a** `evaluate_fn` ([#1334](https://github.com/adap/flower/pull/1334))

source: The `evaluate_fn` passed to built-in strategies like `FedAvg` now takes three parameters: (1) The current round of federated learning/evaluation (`server_round`), (2) the model parameters to evaluate (`parameters`), and (3) a config dictionary (`config`).
es: El `evaluate_fn` pasado a estrategias integradas como `FedAvg` ahora toma tres parámetros: (1) la ronda actual de aprendizaje/evaluación federada (`server_round`), (2) los parámetros del modelo a evaluar (`parameters`), y (3) un diccionario de configuración (`config`).

source: **Rename** `rnd` **to** `server_round` ([#1321](https://github.com/adap/flower/pull/1321))
es: **Cambiar nombre** `rnd` **a** `server_round` ([#1321](https://github.com/adap/flower/pull/1321))

source: Several Flower methods and functions (`evaluate_fn`, `configure_fit`, `aggregate_fit`, `configure_evaluate`, `aggregate_evaluate`) receive the current round of federated learning/evaluation as their first parameter. To improve reaability and avoid confusion with *random*, this parameter has been renamed from `rnd` to `server_round`.
es: Varios métodos y funciones de Flower (`evaluate_fn`, `configure_fit`, `aggregate_fit`, `configure_evaluate`, `aggregate_evaluate`) reciben la ronda actual de aprendizaje/evaluación federada como primer parámetro. Para mejorar la facilidad y evitar confusiones con *aleatorio*, se cambió el nombre de este parámetro de `rnd` a `server_round`.

source: **Move** `flwr.dataset` **to** `flwr_baselines` ([#1273](https://github.com/adap/flower/pull/1273))
es: **Mover** `flwr.dataset` **a** `flwr_baselines` ([#1273](https://github.com/adap/flower/pull/1273))

source: The experimental package `flwr.dataset` was migrated to Flower Baselines.
es: El paquete experimental `flwr.dataset` se migró a Flower Baselines.

source: **Remove experimental strategies** ([#1280](https://github.com/adap/flower/pull/1280))
es: **Eliminar estrategias experimentales** ([#1280](https://github.com/adap/flower/pull/1280))

source: Remove unmaintained experimental strategies (`FastAndSlow`, `FedFSv0`, `FedFSv1`).
es: Elimine las estrategias experimentales que no se mantienen (`FastAndSlow`, `FedFSv0`, `FedFSv1`).

source: **Rename** `Weights` **to** `NDArrays` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
es: **Renombrar** `Weights` **a** `NDArrays` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github. com/adap/flower/pull/1259))

source: `flwr.common.Weights` was renamed to `flwr.common.NDArrays` to better capture what this type is all about.
es: Se cambió el nombre de `flwr.common.Weights` a `flwr.common.NDArrays` para capturar mejor de qué se trata este tipo.

source: **Remove antiquated** `force_final_distributed_eval` **from** `start_server` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
es: **Eliminar el anticuado** `force_final_distributed_eval` **de** `start_server` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github .com/adap/flower/pull/1259))

source: The `start_server` parameter `force_final_distributed_eval` has long been a historic artefact, in this release it is finally gone for good.
es: El parámetro `start_server` `force_final_distributed_eval` ha sido durante mucho tiempo un artefacto histórico, en esta versión finalmente desapareció para siempre.

source: **Make** `get_parameters` **configurable** ([#1242](https://github.com/adap/flower/pull/1242))
es: **Hacer** `get_parameters` **configurable** ([#1242](https://github.com/adap/flower/pull/1242))

source: The `get_parameters` method now accepts a configuration dictionary, just like `get_properties`, `fit`, and `evaluate`.
es: El método `get_parameters` ahora acepta un diccionario de configuración, al igual que `get_properties`, `fit` y `evaluate`.

source: **Replace** `num_rounds` **in** `start_simulation` **with new** `config` **parameter** ([#1281](https://github.com/adap/flower/pull/1281))
es: **Reemplace** `num_rounds` **en** `start_simulation` **con nuevo** `config` **parámetro** ([#1281](https://github.com/adap/flower/pull/ 1281))

source: The `start_simulation` function now accepts a configuration dictionary `config` instead of the `num_rounds` integer. This improves the consistency between `start_simulation` and `start_server` and makes transitioning between the two easier.
es: La función `start_simulation` ahora acepta un diccionario de configuración `config` en lugar del entero `num_rounds`. Esto mejora la coherencia entre `start_simulation` y `start_server` y facilita la transición entre los dos.

source: **Support Python 3.10** ([#1320](https://github.com/adap/flower/pull/1320))
es: **Compatible con Python 3.10** ([#1320](https://github.com/adap/flower/pull/1320))

source: The previous Flower release introduced experimental support for Python 3.10, this release declares Python 3.10 support as stable.
es: La versión anterior de Flower introdujo soporte experimental para Python 3.10, esta versión declara el soporte de Python 3.10 como estable.

source: **Make all** `Client` **and** `NumPyClient` **methods optional** ([#1260](https://github.com/adap/flower/pull/1260), [#1277](https://github.com/adap/flower/pull/1277))
es: **Hacer que todos** `Client` **y** `NumPyClient` **métodos sean opcionales** ([#1260](https://github.com/adap/flower/pull/1260), [#1277] (https://github.com/adap/flower/pull/1277))

source: The `Client`/`NumPyClient` methods `get_properties`, `get_parameters`, `fit`, and `evaluate` are all optional. This enables writing clients that implement, for example, only `fit`, but no other method. No need to implement `evaluate` when using centralized evaluation!
es: Los métodos `Client`/`NumPyClient` `get_properties`, `get_parameters`, `fit` y `evaluate` son todos opcionales. Esto permite escribir clientes que implementen, por ejemplo, sólo "fit", pero ningún otro método. ¡No es necesario implementar "evaluar" cuando se utiliza la evaluación centralizada!

source: **Enable passing a** `Server` **instance to** `start_simulation` ([#1281](https://github.com/adap/flower/pull/1281))
es: **Habilite pasar una** instancia de `Servidor` a** `start_simulation` ([#1281](https://github.com/adap/flower/pull/1281))

source: Similar to `start_server`, `start_simulation` now accepts a full `Server` instance. This enables users to heavily customize the execution of eperiments and opens the door to running, for example, async FL using the Virtual Client Engine.
es: Similar a `start_server`, `start_simulation` ahora acepta una instancia completa de `Server`. Esto permite a los usuarios personalizar en gran medida la ejecución de experimentos y abre la puerta a ejecutar, por ejemplo, FL asíncrono utilizando Virtual Client Engine.

source: **Update code examples** ([#1291](https://github.com/adap/flower/pull/1291), [#1286](https://github.com/adap/flower/pull/1286), [#1282](https://github.com/adap/flower/pull/1282))
es: **Ejemplos de código de actualización** ([#1291](https://github.com/adap/flower/pull/1291), [#1286](https://github.com/adap/flower/pull/1286 ), [#1282](https://github.com/adap/flower/pull/1282))

source: Many code examples received small or even large maintenance updates, among them are
es: Muchos ejemplos de código recibieron pequeñas o incluso grandes actualizaciones de mantenimiento, entre ellas se encuentran

source: `scikit-learn`
es: `scikit-aprende`

source: `simulation_pytorch`
es: `simulación_pytorch`

source: `quickstart_simulation`
es: `simulación_inicio_rápido`

source: `advanced_tensorflow`
es: `flujo_tensor avanzado`

source: **Remove the obsolete simulation example** ([#1328](https://github.com/adap/flower/pull/1328))
es: **Eliminar el ejemplo de simulación obsoleto** ([#1328](https://github.com/adap/flower/pull/1328))

source: Removes the obsolete `simulation` example and renames `quickstart_simulation` to `simulation_tensorflow` so it fits withs the naming of `simulation_pytorch`
es: Elimina el ejemplo obsoleto de "simulación" y cambia el nombre de "quickstart_simulation" a "simulación_tensorflow" para que encaje con el nombre de "simulación_pytorch".

source: **Update documentation** ([#1223](https://github.com/adap/flower/pull/1223), [#1209](https://github.com/adap/flower/pull/1209), [#1251](https://github.com/adap/flower/pull/1251), [#1257](https://github.com/adap/flower/pull/1257), [#1267](https://github.com/adap/flower/pull/1267), [#1268](https://github.com/adap/flower/pull/1268), [#1300](https://github.com/adap/flower/pull/1300), [#1304](https://github.com/adap/flower/pull/1304), [#1305](https://github.com/adap/flower/pull/1305), [#1307](https://github.com/adap/flower/pull/1307))
es: **Actualizar documentación** ([#1223](https://github.com/adap/flower/pull/1223), [#1209](https://github.com/adap/flower/pull/1209) , [#1251](https://github.com/adap/flower/pull/1251), [#1257](https://github.com/adap/flower/pull/1257), [#1267]( https://github.com/adap/flower/pull/1267), [#1268](https://github.com/adap/flower/pull/1268), [#1300](https://github. com/adap/flower/pull/1300), [#1304](https://github.com/adap/flower/pull/1304), [#1305](https://github.com/adap/flower/ pull/1305), [#1307](https://github.com/adap/flower/pull/1307))

source: One substantial documentation update fixes multiple smaller rendering issues, makes titles more succinct to improve navigation, removes a deprecated library, updates documentation dependencies, includes the `flwr.common` module in the API reference, includes support for markdown-based documentation, migrates the changelog from `.rst` to `.md`, and fixes a number of smaller details!
es: Una actualización sustancial de la documentación corrige varios problemas de representación menores, hace que los títulos sean más concisos para mejorar la navegación, elimina una biblioteca obsoleta, actualiza las dependencias de la documentación, incluye el módulo `flwr.common` en la referencia de API, incluye soporte para documentación basada en rebajas, migra el registro de cambios de `.rst` a `.md`, ¡y corrige una serie de detalles más pequeños!

source: **Minor updates**
es: **Actualizaciones menores**

source: Add round number to fit and evaluate log messages ([#1266](https://github.com/adap/flower/pull/1266))
es: Agregue un número redondo para ajustar y evaluar los mensajes de registro ([#1266](https://github.com/adap/flower/pull/1266))

source: Add secure gRPC connection to the `advanced_tensorflow` code example ([#847](https://github.com/adap/flower/pull/847))
es: Agregue una conexión gRPC segura al ejemplo de código `advanced_tensorflow` ([#847](https://github.com/adap/flower/pull/847))

source: Update developer tooling ([#1231](https://github.com/adap/flower/pull/1231), [#1276](https://github.com/adap/flower/pull/1276), [#1301](https://github.com/adap/flower/pull/1301), [#1310](https://github.com/adap/flower/pull/1310))
es: Actualizar herramientas de desarrollador ([#1231](https://github.com/adap/flower/pull/1231), [#1276](https://github.com/adap/flower/pull/1276), [# 1301](https://github.com/adap/flower/pull/1301), [#1310](https://github.com/adap/flower/pull/1310))

source: Rename ProtoBuf messages to improve consistency ([#1214](https://github.com/adap/flower/pull/1214), [#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
es: Cambie el nombre de los mensajes de ProtoBuf para mejorar la coherencia ([#1214](https://github.com/adap/flower/pull/1214), [#1258](https://github.com/adap/flower/pull/1258) , [#1259](https://github.com/adap/flower/pull/1259))

source: **Flower Baselines (preview): FedOpt, FedBN, FedAvgM** ([#919](https://github.com/adap/flower/pull/919), [#1127](https://github.com/adap/flower/pull/1127), [#914](https://github.com/adap/flower/pull/914))
es: **Líneas de base de flores (vista previa): FedOpt, FedBN, FedAvgM** ([#919](https://github.com/adap/flower/pull/919), [#1127](https://github.com /adap/flower/pull/1127), [#914](https://github.com/adap/flower/pull/914))

source: The first preview release of Flower Baselines has arrived! We're kickstarting Flower Baselines with implementations of FedOpt (FedYogi, FedAdam, FedAdagrad), FedBN, and FedAvgM. Check the documentation on how to use [Flower Baselines](https://flower.dev/docs/using-baselines.html). With this first preview release we're also inviting the community to [contribute their own baselines](https://flower.dev/docs/contributing-baselines.html).
es: ¡Ha llegado la primera versión preliminar de Flower Baselines! Estamos iniciando Flower Baselines con implementaciones de FedOpt (FedYogi, FedAdam, FedAdagrad), FedBN y FedAvgM. Consulte la documentación sobre cómo utilizar [Flower Baselines](https://flower.dev/docs/using-baselines.html). Con esta primera versión preliminar, también invitamos a la comunidad a [contribuir con sus propias líneas de base] (https://flower.dev/docs/contributing-baselines.html).

source: **C++ client SDK (preview) and code example** ([#1111](https://github.com/adap/flower/pull/1111))
es: **SDK de cliente C++ (vista previa) y ejemplo de código** ([#1111](https://github.com/adap/flower/pull/1111))

source: Preview support for Flower clients written in C++. The C++ preview includes a Flower client SDK and a quickstart code example that demonstrates a simple C++ client using the SDK.
es: Soporte de vista previa para clientes Flower escritos en C++. La vista previa de C++ incluye un SDK de cliente Flower y un ejemplo de código de inicio rápido que muestra un cliente C++ simple usando el SDK.

source: **Add experimental support for Python 3.10 and Python 3.11** ([#1135](https://github.com/adap/flower/pull/1135))
es: **Agregue soporte experimental para Python 3.10 y Python 3.11** ([#1135](https://github.com/adap/flower/pull/1135))
