Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Flower does not automatically save model updates on the server-side. This how-to guide describes the steps to save (and load) model checkpoints in Flower.
es: Flower no guarda automáticamente las actualizaciones del modelo en el lado del servidor. Esta guía práctica describe los pasos para guardar (y cargar) puntos de control del modelo en Flower.

source: Model checkpointing
es: Puntos de control del modelo

source: Model updates can be persisted on the server-side by customizing :code:`Strategy` methods. Implementing custom strategies is always an option, but for many cases it may be more convenient to simply customize an existing strategy. The following code example defines a new :code:`SaveModelStrategy` which customized the existing built-in :code:`FedAvg` strategy. In particular, it customizes :code:`aggregate_fit` by calling :code:`aggregate_fit` in the base class (:code:`FedAvg`). It then continues to save returned (aggregated) weights before it returns those aggregated weights to the caller (i.e., the server):
es: Las actualizaciones del modelo se pueden conservar en el lado del servidor personalizando los métodos :code:`Strategy`. Implementar estrategias personalizadas siempre es una opción, pero en muchos casos puede ser más conveniente simplemente personalizar una estrategia existente. El siguiente ejemplo de código define un nuevo :code:`SaveModelStrategy` que personaliza la estrategia :code:`FedAvg` integrada existente. En particular, personaliza :code:`aggregate_fit` llamando a :code:`aggregate_fit` en la clase base (:code:`FedAvg`). Luego continúa guardando los pesos devueltos (agregados) antes de devolver esos pesos agregados a la persona que llama (es decir, al servidor):

source: Save and load PyTorch checkpoints
es: Guarde y cargue puntos de control de PyTorch

source: Similar to the previous example but with a few extra steps, we'll show how to store a PyTorch checkpoint we'll use the ``torch.save`` function. Firstly, ``aggregate_fit`` returns a ``Parameters`` object that has to be transformed into a list of NumPy ``ndarray``'s, then those are transformed into the PyTorch ``state_dict`` following the ``OrderedDict`` class structure.
es: Similar al ejemplo anterior pero con algunos pasos adicionales, mostraremos cómo almacenar un punto de control de PyTorch. Usaremos la función ``torch.save``. En primer lugar, ``aggregate_fit`` devuelve un objeto ``Parameters`` que debe transformarse en una lista de ``ndarray`` de NumPy, luego estos se transforman en el ``state_dict`` de PyTorch después del ``OrderedDict `` estructura de clases.

source: To load your progress, you simply append the following lines to your code. Note that this will iterate over all saved checkpoints and load the latest one:
es: Para cargar su progreso, simplemente agregue las siguientes líneas a su código. Tenga en cuenta que esto iterará sobre todos los puntos de control guardados y cargará el más reciente:

source: Upgrade to Flower 1.0
es: Actualice a Flor 1.0

source: Flower 1.0 is here. Along with new features, Flower 1.0 provides a stable foundation for future growth. Compared to Flower 0.19 (and other 0.x series releases), there are a few breaking changes that make it necessary to change the code of existing 0.x-series projects.
es: Flor 1.0 ya está aquí. Junto con las nuevas funciones, Flower 1.0 proporciona una base estable para el crecimiento futuro. En comparación con Flower 0.19 (y otras versiones de la serie 0.x), hay algunos cambios importantes que hacen necesario cambiar el código de los proyectos existentes de la serie 0.x.

source: Install update
es: Instalar actualización

source: Here's how to update an existing installation to Flower 1.0 using either pip or Poetry:
es: A continuación se explica cómo actualizar una instalación existente a Flower 1.0 usando pip o Poetry:

source: pip: add ``-U`` when installing.
es: pip: agregue ``-U`` al instalar.

source: ``python -m pip install -U flwr`` (when using ``start_server`` and ``start_client``)
es: ``python -m pip install -U flwr`` (cuando se usa ``start_server`` y ``start_client``)

source: ``python -m pip install -U flwr[simulation]`` (when using ``start_simulation``)
es: ``python -m pip install -U flwr[simulación]`` (cuando se usa ``start_simulation``)

source: Poetry: update the ``flwr`` dependency in ``pyproject.toml`` and then reinstall (don't forget to delete ``poetry.lock`` via ``rm poetry.lock`` before running ``poetry install``).
es: Poetry: actualice la dependencia ``flwr`` en ``pyproject.toml`` y luego vuelva a instalarla (no olvide eliminar ``poetry.lock`` mediante ``rm poetry.lock`` antes de ejecutar ``poetry install ``).

source: ``flwr = "^1.0.0"`` (when using ``start_server`` and ``start_client``)
es: ``flwr = "^1.0.0"`` (cuando se usa ``start_server`` y ``start_client``)

source: ``flwr = { version = "^1.0.0", extras = ["simulation"] }`` (when using ``start_simulation``)
es: ``flwr = { version = "^1.0.0", extras = ["simulación"] }`` (cuando se usa ``start_simulation``)

source: Required changes
es: Cambios requeridos

source: The following breaking changes require manual updates.
es: Los siguientes cambios importantes requieren actualizaciones manuales.

source: Pass all arguments as keyword arguments (not as positional arguments). Here's an example:
es: Pase todos los argumentos como argumentos de palabras clave (no como argumentos posicionales). He aquí un ejemplo:

source: Flower 0.19 (positional arguments): ``start_client("127.0.0.1:8080", FlowerClient())``
es: Flower 0.19 (argumentos posicionales): ``start_client("127.0.0.1:8080", FlowerClient())``

source: Flower 1.0 (keyword arguments): ``start_client(server_address="127.0.0.1:8080", client=FlowerClient())``
es: Flower 1.0 (argumentos de palabras clave): ``start_client(server_address="127.0.0.1:8080", client=FlowerClient())``

source: Subclasses of ``NumPyClient``: change ``def get_parameters(self):``` to ``def get_parameters(self, config):``
es: Subclases de ``NumPyClient``: cambie ``def get_parameters(self):``` a ``def get_parameters(self, config):``

source: Subclasses of ``Client``: change ``def get_parameters(self):``` to ``def get_parameters(self, ins: GetParametersIns):``
es: Subclases de ``Cliente``: cambie ``def get_parameters(self):``` a ``def get_parameters(self, ins: GetParametersIns):``

source: Strategies / ``start_server`` / ``start_simulation``
es: Estrategias / ``start_server`` / ``start_simulation``

source: Pass ``ServerConfig`` (instead of a dictionary) to ``start_server`` and ``start_simulation``. Here's an example:
es: Pase ``ServerConfig`` (en lugar de un diccionario) a ``start_server`` y ``start_simulation``. He aquí un ejemplo:

source: Flower 0.19: ``start_server(..., config={"num_rounds": 3, "round_timeout": 600.0}, ...)``
es: Flor 0.19: ``start_server(..., config={"num_rounds": 3, "round_timeout": 600.0}, ...)``

source: Flower 1.0: ``start_server(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``
es: Flor 1.0: ``start_server(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``

source: Replace ``num_rounds=1`` in ``start_simulation`` with the new ``config=ServerConfig(...)`` (see previous item)
es: Reemplace ``num_rounds=1`` en ``start_simulation`` con el nuevo ``config=ServerConfig(...)`` (ver elemento anterior)

source: Remove ``force_final_distributed_eval`` parameter from calls to ``start_server``. Distributed evaluation on all clients can be enabled by configuring the strategy to sample all clients for evaluation after the last round of training.
es: Elimine el parámetro ``force_final_distributed_eval`` de las llamadas a ``start_server``. La evaluación distribuida en todos los clientes se puede habilitar configurando la estrategia para muestrear a todos los clientes para su evaluación después de la última ronda de capacitación.

source: Rename parameter/ndarray conversion functions:
es: Cambiar el nombre de las funciones de conversión de parámetros/ndarray:

source: ``parameters_to_weights`` --> ``parameters_to_ndarrays``
es: ``parámetros_a_pesos`` --> ``parámetros_a_ndarrays``

source: ``weights_to_parameters`` --> ``ndarrays_to_parameters``
es: ``pesos_a_parámetros`` --> ``ndarrays_to_parameters``

source: Strategy initialization: if the strategy relies on the default values for ``fraction_fit`` and ``fraction_evaluate``, set ``fraction_fit`` and ``fraction_evaluate`` manually to ``0.1``. Projects that do not manually create a strategy (by calling ``start_server`` or ``start_simulation`` without passing a strategy instance) should now manually initialize FedAvg with ``fraction_fit`` and ``fraction_evaluate`` set to ``0.1``.
es: Inicialización de la estrategia: si la estrategia se basa en los valores predeterminados para ``fraction_fit`` y ``fraction_evaluate``, establezca ``fraction_fit`` y ``fraction_evaluate`` manualmente en ``0.1``. Los proyectos que no crean manualmente una estrategia (llamando a ``start_server`` o ``start_simulation`` sin pasar una instancia de estrategia) ahora deberían inicializar manualmente FedAvg con ``fraction_fit`` y ``fraction_evaluate`` configurados en ``0.1 ``.

source: Rename built-in strategy parameters (e.g., ``FedAvg``):
es: Cambie el nombre de los parámetros de estrategia integrados (por ejemplo, ``FedAvg``):

source: ``fraction_eval`` --> ``fraction_evaluate``
es: ``fracción_evaluación`` --> ``fracción_evaluación``

source: ``eval_fn`` --> ``evaluate_fn``
es: ``eval_fn`` --> ``evaluar_fn``

source: Rename ``rnd`` to ``server_round``. This impacts multiple methods and functions, for example, ``configure_fit``, ``aggregate_fit``, ``configure_evaluate``, ``aggregate_evaluate``, and ``evaluate_fn``.
es: Cambie el nombre de ``rnd`` a ``server_round``. Esto afecta múltiples métodos y funciones, por ejemplo, ``configure_fit``, ``aggregate_fit``, ``configure_evaluate``, ``aggregate_evaluate`` y ``evaluate_fn``.

source: Add ``server_round`` and ``config`` to ``evaluate_fn``:
es: Agregue ``server_round`` y ``config`` a ``evaluate_fn``:

source: Flower 0.19: ``def evaluate(parameters: NDArrays) -> Optional[Tuple[float, Dict[str, Scalar]]]:``
es: Flor 0.19: ``def evaluar(parámetros: NDArrays) -> Opcional[Tuple[float, Dict[str, Scalar]]]:``

source: Flower 1.0: ``def evaluate(server_round: int, parameters: NDArrays, config: Dict[str, Scalar]) -> Optional[Tuple[float, Dict[str, Scalar]]]:``
es: Flor 1.0: ``def evaluar(server_round: int, parámetros: NDArrays, configuración: Dict[str, Scalar]) -> Opcional[Tuple[float, Dict[str, Scalar]]]:``

source: Custom strategies
es: Estrategias personalizadas

source: The type of parameter ``failures`` has changed from ``List[BaseException]`` to ``List[Union[Tuple[ClientProxy, FitRes], BaseException]]`` (in ``aggregate_fit``) and ``List[Union[Tuple[ClientProxy, EvaluateRes], BaseException]]`` (in ``aggregate_evaluate``)
es: El tipo de parámetro ``failures`` ha cambiado de ``List[BaseException]`` a ``List[Union[Tuple[ClientProxy, FitRes], BaseException]]`` (en ``aggregate_fit``) y `` Lista[Unión[Tupla[ClientProxy, EvaluateRes], BaseException]]`` (en ``aggregate_evaluate``)

source: The ``Strategy`` method ``evaluate`` now receives the current round of federated learning/evaluation as the first parameter:
es: El método ``Estrategia`` ``evaluar`` ahora recibe la ronda actual de aprendizaje/evaluación federada como primer parámetro:

source: Flower 0.19: ``def evaluate(self, parameters: Parameters) -> Optional[Tuple[float, Dict[str, Scalar]]]:``
es: Flor 0.19: ``def evaluar(self, parámetros: Parámetros) -> Opcional[Tuple[float, Dict[str, Scalar]]]:``

source: Flower 1.0: ``def evaluate(self, server_round: int, parameters: Parameters) -> Optional[Tuple[float, Dict[str, Scalar]]]:``
es: Flor 1.0: ``def evaluar(self, server_round: int, parámetros: Parámetros) -> Opcional[Tuple[float, Dict[str, Scalar]]]:``

source: Optional improvements
es: Mejoras opcionales

source: Along with the necessary changes above, there are a number of potential improvements that just became possible:
es: Además de los cambios necesarios mencionados anteriormente, hay una serie de posibles mejoras que acaban de ser posibles:

source: Remove "placeholder" methods from subclasses of ``Client`` or ``NumPyClient``. If you, for example, use server-side evaluation, then empy placeholder implementations of ``evaluate`` are no longer necessary.
es: Elimine los métodos "marcadores de posición" de las subclases de ``Client`` o ``NumPyClient``. Si, por ejemplo, utiliza la evaluación del lado del servidor, entonces ya no son necesarias implementaciones vacías de marcador de posición de "evaluar".

source: Configure the round timeout via ``start_simulation``: ``start_simulation(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``
es: Configure el tiempo de espera de la ronda mediante ``start_simulation``: ``start_simulation(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``

source: Further help
es: Más ayuda

source: Most official `Flower code examples <https://github.com/adap/flower/tree/main/examples>`_ are already updated to Flower 1.0, they can serve as a reference for using the Flower 1.0 API. If there are further questionsm, `join the Flower Slack <https://flower.dev/join-slack/>`_ and use the channgel ``#questions``.
es: La mayoría de los `ejemplos de código de Flower <https://github.com/adap/flower/tree/main/examples>`_ oficiales ya están actualizados a Flower 1.0, y pueden servir como referencia para usar la API de Flower 1.0. Si hay más preguntas, `únete a Flower Slack <https://flower.dev/join-slack/>`_ y usa el canal ``#questions``.

source: Use strategies
es: Usa estrategias

source: Flower allows full customization of the learning process through the :code:`Strategy` abstraction. A number of built-in strategies are provided in the core framework.
es: Flower permite una personalización completa del proceso de aprendizaje a través de la abstracción :code:`Strategy`. En el marco central se proporcionan varias estrategias integradas.

source: There are three ways to customize the way Flower orchestrates the learning process on the server side:
es: Hay tres formas de personalizar la forma en que Flower organiza el proceso de aprendizaje en el lado del servidor:

source: Use an existing strategy, for example, :code:`FedAvg`
es: Utilice una estrategia existente, por ejemplo, :code:`FedAvg`

source: Customize an existing strategy with callback functions
es: Personalice una estrategia existente con funciones de devolución de llamada

source: Implement a novel strategy
es: Implementar una estrategia novedosa

source: Use an existing strategy
es: Utilice una estrategia existente

source: Flower comes with a number of popular federated learning strategies built-in. A built-in strategy can be instantiated as follows:
es: Flower viene con una serie de estrategias populares de aprendizaje federado integradas. Se puede crear una instancia de una estrategia incorporada de la siguiente manera:

source: This creates a strategy with all parameters left at their default values and passes it to the :code:`start_server` function. It is usually recommended to adjust a few parameters during instantiation:
es: Esto crea una estrategia con todos los parámetros dejados en sus valores predeterminados y la pasa a la función :code:`start_server`. Generalmente se recomienda ajustar algunos parámetros durante la creación de instancias:

source: Existing strategies provide several ways to customize their behaviour. Callback functions allow strategies to call user-provided code during execution.
es: Las estrategias existentes ofrecen varias formas de personalizar su comportamiento. Las funciones de devolución de llamada permiten estrategias para llamar al código proporcionado por el usuario durante la ejecución.

source: Configuring client fit and client evaluate
es: Configurar el ajuste del cliente y la evaluación del cliente

source: The server can pass new configuration values to the client each round by providing a function to :code:`on_fit_config_fn`. The provided function will be called by the strategy and must return a dictionary of configuration key values pairs that will be sent to the client. It must return a dictionary of arbitraty configuration values :code:`client.fit` and :code:`client.evaluate` functions during each round of federated learning.
es: El servidor puede pasar nuevos valores de configuración al cliente en cada ronda proporcionando una función para :code:`on_fit_config_fn`. La función proporcionada será llamada por la estrategia y debe devolver un diccionario de pares de valores clave de configuración que se enviará al cliente. Debe devolver un diccionario de valores de configuración arbitrarios de las funciones :code:`client.fit` y :code:`client.evaluate` durante cada ronda de aprendizaje federado.

source: The :code:`on_fit_config_fn` can be used to pass arbitrary configuration values from server to client, and poetentially change these values each round, for example, to adjust the learning rate. The client will receive the dictionary returned by the :code:`on_fit_config_fn` in its own :code:`client.fit()` function.
es: El :code:`on_fit_config_fn` se puede usar para pasar valores de configuración arbitrarios del servidor al cliente y cambiar potencialmente estos valores en cada ronda, por ejemplo, para ajustar la tasa de aprendizaje. El cliente recibirá el diccionario devuelto por :code:`on_fit_config_fn` en su propia función :code:`client.fit()`.

source: Similar to :code:`on_fit_config_fn`, there is also :code:`on_evaluate_config_fn` to customize the configuration sent to :code:`client.evaluate()`
es: Similar a :code:`on_fit_config_fn`, también existe :code:`on_evaluate_config_fn` para personalizar la configuración enviada a :code:`client.evaluate()`

source: Configuring server-side evaluation
es: Configurar la evaluación del lado del servidor

source: Server-side evaluation can be enabled by passing an evaluation function to :code:`evaluate_fn`.
es: La evaluación del lado del servidor se puede habilitar pasando una función de evaluación a :code:`evaluate_fn`.

source: Writing a fully custom strategy is a bit more involved, but it provides the most flexibility. Read the `Implementing Strategies <implementing-strategies.html>`_ guide to learn more.
es: Escribir una estrategia totalmente personalizada es un poco más complicado, pero proporciona la mayor flexibilidad. Lea la guía `Implementación de estrategias <implementing-strategies.html>`_ para obtener más información.

source: Quickstart tutorials
es: Tutoriales de inicio rápido

source: How-to guides
es: Guías prácticas

source: Legacy example guides
es: Guías de ejemplo heredadas

source: Explanations
es: Explicaciones

source: API reference
es: Referencia API

source: Reference docs
es: Documentos de referencia

source: Contributor tutorials
es: Tutoriales para colaboradores

source: Contributor how-to guides
es: Guías prácticas para colaboradores

source: Contributor explanations
es: Explicaciones del colaborador

source: Contributor references
es: Referencias de colaboradores

source: Flower Framework Documentation
es: Documentación del marco de flores

source: Welcome to Flower's documentation. `Flower <https://flower.dev>`_ is a friendly federated learning framework.
es: Bienvenido a la documentación de Flower. `Flower <https://flower.dev>`_ es un marco de aprendizaje federado amigable.

source: Join the Flower Community
es: Únase a la comunidad de flores

source: The Flower Community is growing quickly - we're a friendly group of researchers, engineers, students, professionals, academics, and other enthusiasts.
es: La Flower Community está creciendo rápidamente: somos un grupo amigable de investigadores, ingenieros, estudiantes, profesionales, académicos y otros entusiastas.

source: Join us on Slack
es: Únase a nosotros en Slack

source: Flower Framework
es: Marco de flores

source: The user guide is targeted at researchers and developers who want to use Flower to bring existing machine learning workloads into a federated setting. One of Flower's design goals was to make this simple. Read on to learn more.
es: La guía del usuario está dirigida a investigadores y desarrolladores que desean utilizar Flower para incorporar cargas de trabajo de aprendizaje automático existentes a un entorno federado. Uno de los objetivos de diseño de Flower era simplificar esto. Continúe leyendo para obtener más información.

source: Tutorials
es: Tutoriales

source: A learning-oriented series of federated learning tutorials, the best place to start.
es: Una serie de tutoriales de aprendizaje federados orientados al aprendizaje, el mejor lugar para comenzar.

source: QUICKSTART TUTORIALS: :doc:`PyTorch <tutorial-quickstart-pytorch>` | :doc:`TensorFlow <tutorial-quickstart-tensorflow>` | :doc:`🤗 Transformers <tutorial-quickstart-huggingface>` | :doc:`JAX <tutorial-quickstart-jax>` | :doc:`Pandas <tutorial-quickstart-pandas>` | :doc:`fastai <tutorial-quickstart-fastai>` | :doc:`PyTorch Lightning <tutorial-quickstart-pytorch-lightning>` | :doc:`MXNet <tutorial-quickstart-mxnet>` | :doc:`scikit-learn <tutorial-quickstart-scikitlearn>` | :doc:`XGBoost <tutorial-quickstart-xgboost>` | :doc:`Android <tutorial-quickstart-android>` | :doc:`iOS <tutorial-quickstart-ios>`
es: TUTORIALES DE INICIO RÁPIDO: :doc:`PyTorch <tutorial-quickstart-pytorch>` | :doc:`TensorFlow <tutorial-quickstart-tensorflow>` | :doc:`🤗 Transformadores <tutorial-quickstart-huggingface>` | :doc:`JAX <tutorial-inicio-rápido-jax>` | :doc:`Pandas <tutorial-inicio-rápido-pandas>` | :doc:`fastai <tutorial-inicio-rápido-fastai>` | :doc:`PyTorch Lightning <tutorial-inicio-rápido-pytorch-lightning>` | :doc:`MXNet <tutorial-quickstart-mxnet>` | :doc:`scikit-learn <tutorial-quickstart-scikitlearn>` | :doc:`XGBoost <tutorial-quickstart-xgboost>` | :doc:`Android <tutorial-quickstart-android>` | :doc:`iOS <tutorial-quickstart-ios>`

source: Problem-oriented how-to guides show step-by-step how to achieve a specific goal.
es: Las guías prácticas orientadas a problemas muestran paso a paso cómo lograr un objetivo específico.

source: Understanding-oriented concept guides explain and discuss key topics and underlying ideas behind Flower and collaborative AI.
es: Las guías conceptuales orientadas a la comprensión explican y analizan temas clave e ideas subyacentes detrás de Flower y la IA colaborativa.

source: References
es: Referencias

source: Information-oriented API reference and other reference material.
es: Referencia de API orientada a la información y otro material de referencia.

source: Contributor docs
es: Documentos del colaborador

source: The Flower community welcomes contributions. The following docs are intended to help along the way.
es: La comunidad Flower agradece las contribuciones. Los siguientes documentos están destinados a ayudarle en el camino.

source: Flower CLI reference
es: Referencia CLI de flores

source: flower-server
es: servidor de flores

source: flower-driver-api
es: api-conductor-de-flores

source: flower-fleet-api
es: flota-de-flores-api

source: flwr (Python API reference)
es: flwr (referencia de la API de Python)

source: client
es: cliente

source: Flower client.
es: Cliente de flores.

source: Abstract base class for Flower clients.
es: Clase base abstracta para clientes de Flower.

source: Evaluate the provided parameters using the locally held dataset.
es: Evalúe los parámetros proporcionados utilizando el conjunto de datos local.

source: Parameters
es: Parámetros
