Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: in each window (make sure that the server is still running before you do so) and see your MXNet project run federated learning across two clients. Congratulations!
es: en cada ventana (asegúrese de que el servidor todavía esté ejecutándose antes de hacerlo) y vea cómo su proyecto MXNet ejecuta el aprendizaje federado en dos clientes. ¡Felicidades!

source: The full source code for this example: `MXNet: From Centralized To Federated (Code) <https://github.com/adap/flower/blob/main/examples/mxnet-from-centralized-to-federated>`_. Our example is of course somewhat over-simplified because both clients load the exact same dataset, which isn't realistic. You're now prepared to explore this topic further. How about using a CNN or using a different dataset? How about adding more clients?
es: El código fuente completo para este ejemplo: `MXNet: De centralizado a federado (código) <https://github.com/adap/flower/blob/main/examples/mxnet-from-centralized-to-federated>`_. Por supuesto, nuestro ejemplo está algo demasiado simplificado porque ambos clientes cargan exactamente el mismo conjunto de datos, lo cual no es realista. Ahora está preparado para explorar este tema más a fondo. ¿Qué tal usar una CNN o usar un conjunto de datos diferente? ¿Qué tal agregar más clientes?

source: Example: PyTorch - From Centralized To Federated
es: Ejemplo: PyTorch: de centralizado a federado

source: This tutorial will show you how to use Flower to build a federated version of an existing machine learning workload. We are using PyTorch to train a Convolutional Neural Network on the CIFAR-10 dataset. First, we introduce this machine learning task with a centralized training approach based on the `Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_ tutorial. Then, we build upon the centralized training code to run the training in a federated fashion.
es: Este tutorial le mostrará cómo utilizar Flower para crear una versión federada de una carga de trabajo de aprendizaje automático existente. Estamos utilizando PyTorch para entrenar una red neuronal convolucional en el conjunto de datos CIFAR-10. Primero, presentamos esta tarea de aprendizaje automático con un enfoque de capacitación centralizado basado en el tutorial `Aprendizaje profundo con PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_. Luego, nos basamos en el código de capacitación centralizado para ejecutar la capacitación de forma federada.

source: We begin with a brief description of the centralized CNN training code. If you want a more in-depth explanation of what's going on then have a look at the official `PyTorch tutorial <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_.
es: Comenzamos con una breve descripción del código de entrenamiento centralizado de CNN. Si desea una explicación más detallada de lo que está sucediendo, eche un vistazo al `tutorial oficial de PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_.

source: Let's create a new file called :code:`cifar.py` with all the components required for a traditional (centralized) training on CIFAR-10. First, all required packages (such as :code:`torch` and :code:`torchvision`) need to be imported. You can see that we do not import any package for federated learning. You can keep all these imports as they are even when we add the federated learning components at a later point.
es: Creemos un nuevo archivo llamado :code:`cifar.py` con todos los componentes necesarios para una capacitación tradicional (centralizada) en CIFAR-10. Primero, se deben importar todos los paquetes requeridos (como :code:`torch` y :code:`torchvision`). Puede ver que no importamos ningún paquete para el aprendizaje federado. Puede mantener todas estas importaciones tal como están incluso cuando agreguemos los componentes de aprendizaje federado en un momento posterior.

source: As already mentioned we will use the CIFAR-10 dataset for this machine learning workload. The model architecture (a very simple Convolutional Neural Network) is defined in :code:`class Net()`.
es: Como ya se mencionó, utilizaremos el conjunto de datos CIFAR-10 para esta carga de trabajo de aprendizaje automático. La arquitectura del modelo (una red neuronal convolucional muy simple) se define en :code:`class Net()`.

source: The :code:`load_data()` function loads the CIFAR-10 training and test sets. The :code:`transform` normalized the data after loading.
es: La función :code:`load_data()` carga los conjuntos de prueba y entrenamiento CIFAR-10. El :code:`transform` normalizó los datos después de la carga.

source: We now need to define the training (function :code:`train()`) which loops over the training set, measures the loss, backpropagates it, and then takes one optimizer step for each batch of training examples.
es: Ahora necesitamos definir el entrenamiento (función :code:`train()`) que recorre el conjunto de entrenamiento, mide la pérdida, lo propaga hacia atrás y luego toma un paso del optimizador para cada lote de ejemplos de entrenamiento.

source: The evaluation of the model is defined in the function :code:`test()`. The function loops over all test samples and measures the loss of the model based on the test dataset.
es: La evaluación del modelo se define en la función :code:`test()`. La función recorre todas las muestras de prueba y mide la pérdida del modelo en función del conjunto de datos de prueba.

source: Having defined the data loading, model architecture, training, and evaluation we can put everything together and train our CNN on CIFAR-10.
es: Una vez definida la carga de datos, la arquitectura del modelo, el entrenamiento y la evaluación, podemos juntar todo y entrenar nuestra CNN en CIFAR-10.

source: So far, this should all look fairly familiar if you've used PyTorch before. Let's take the next step and use what we've built to create a simple federated learning system consisting of one server and two clients.
es: Hasta ahora, todo esto debería resultarte bastante familiar si has usado PyTorch antes. Demos el siguiente paso y usemos lo que hemos creado para crear un sistema de aprendizaje federado simple que consta de un servidor y dos clientes.

source: The simple machine learning project discussed in the previous section trains the model on a single dataset (CIFAR-10), we call this centralized learning. This concept of centralized learning, as shown in the previous section, is probably known to most of you, and many of you have used it previously. Normally, if you'd want to run machine learning workloads in a federated fashion, then you'd have to change most of your code and set everything up from scratch. This can be a considerable effort.
es: El proyecto simple de aprendizaje automático analizado en la sección anterior entrena el modelo en un único conjunto de datos (CIFAR-10), a esto lo llamamos aprendizaje centralizado. Este concepto de aprendizaje centralizado, como se muestra en la sección anterior, probablemente sea conocido por la mayoría de ustedes y muchos de ustedes lo han usado anteriormente. Normalmente, si desea ejecutar cargas de trabajo de aprendizaje automático de forma federada, tendrá que cambiar la mayor parte del código y configurar todo desde cero. Esto puede suponer un esfuerzo considerable.

source: However, with Flower you can evolve your pre-existing code into a federated learning setup without the need for a major rewrite.
es: Sin embargo, con Flower puedes evolucionar tu código preexistente a una configuración de aprendizaje federado sin necesidad de una reescritura importante.

source: The concept is easy to understand. We have to start a *server* and then use the code in :code:`cifar.py` for the *clients* that are connected to the *server*. The *server* sends model parameters to the clients. The *clients* run the training and update the paramters. The updated parameters are sent back to the *server* which averages all received parameter updates. This describes one round of the federated learning process and we repeat this for multiple rounds.
es: El concepto es fácil de entender. Tenemos que iniciar un *servidor* y luego usar el código en :code:`cifar.py` para los *clientes* que están conectados al *servidor*. El *servidor* envía parámetros del modelo a los clientes. Los *clientes* ejecutan la capacitación y actualizan los parámetros. Los parámetros actualizados se envían de vuelta al *servidor* que promedia todas las actualizaciones de parámetros recibidas. Esto describe una ronda del proceso de aprendizaje federado y lo repetimos en varias rondas.

source: Finally, we will define our *client* logic in :code:`client.py` and build upon the previously defined centralized training in :code:`cifar.py`. Our *client* needs to import :code:`flwr`, but also :code:`torch` to update the paramters on our PyTorch model:
es: Finalmente, definiremos nuestra lógica de *cliente* en :code:`client.py` y nos basaremos en el entrenamiento centralizado previamente definido en :code:`cifar.py`. Nuestro *cliente* necesita importar :code:`flwr`, pero también :code:`torch` para actualizar los parámetros en nuestro modelo PyTorch:

source: Implementing a Flower *client* basically means implementing a subclass of either :code:`flwr.client.Client` or :code:`flwr.client.NumPyClient`. Our implementation will be based on :code:`flwr.client.NumPyClient` and we'll call it :code:`CifarClient`. :code:`NumPyClient` is slighly easier to implement than :code:`Client` if you use a framework with good NumPy interoperability (like PyTorch or TensorFlow/Keras) because it avoids some of the boilerplate that would otherwise be necessary. :code:`CifarClient` needs to implement four methods, two methods for getting/setting model parameters, one method for training the model, and one method for testing the model:
es: Implementar un *cliente* Flower básicamente significa implementar una subclase de :code:`flwr.client.Client` o :code:`flwr.client.NumPyClient`. Nuestra implementación se basará en :code:`flwr.client.NumPyClient` y lo llamaremos :code:`CifarClient`. :code:`NumPyClient` es un poco más fácil de implementar que :code:`Client` si usa un marco con buena interoperabilidad de NumPy (como PyTorch o TensorFlow/Keras) porque evita parte del texto estándar que de otro modo sería necesario. :code:`CifarClient` necesita implementar cuatro métodos, dos métodos para obtener/establecer parámetros del modelo, un método para entrenar el modelo y un método para probar el modelo:

source: :code:`set_parameters`
es: :código:`set_parameters`

source: The two :code:`NumPyClient` methods :code:`fit` and :code:`evaluate` make use of the functions :code:`train()` and :code:`test()` previously defined in :code:`cifar.py`. So what we really do here is we tell Flower through our :code:`NumPyClient` subclass which of our already defined functions to call for training and evaluation. We included type annotations to give you a better understanding of the data types that get passed around.
es: Los dos métodos :code:`NumPyClient` :code:`fit` y :code:`evaluate` hacen uso de las funciones :code:`train()` y :code:`test()` previamente definidas en :code: `cifar.py`. Entonces, lo que realmente hacemos aquí es decirle a Flower a través de nuestra subclase :code:`NumPyClient` cuál de nuestras funciones ya definidas llamar para entrenamiento y evaluación. Incluimos anotaciones de tipo para brindarle una mejor comprensión de los tipos de datos que se transmiten.

source: All that's left to do it to define a function that loads both model and data, creates a :code:`CifarClient`, and starts this client. You load your data and model by using :code:`cifar.py`. Start :code:`CifarClient` with the function :code:`fl.client.start_numpy_client()` by pointing it at the same IP adress we used in :code:`server.py`:
es: Todo lo que queda es definir una función que cargue tanto el modelo como los datos, cree un :code:`CifarClient` e inicie este cliente. Usted carga sus datos y modelo usando :code:`cifar.py`. Inicie :code:`CifarClient` con la función :code:`fl.client.start_numpy_client()` apuntándola a la misma dirección IP que usamos en :code:`server.py`:

source: in each window (make sure that the server is running before you do so) and see your (previously centralized) PyTorch project run federated learning across two clients. Congratulations!
es: en cada ventana (asegúrese de que el servidor se esté ejecutando antes de hacerlo) y vea su proyecto PyTorch (previamente centralizado) ejecutar el aprendizaje federado en dos clientes. ¡Felicidades!

source: The full source code for this example: `PyTorch: From Centralized To Federated (Code) <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Our example is, of course, somewhat over-simplified because both clients load the exact same dataset, which isn't realistic. You're now prepared to explore this topic further. How about using different subsets of CIFAR-10 on each client? How about adding more clients?
es: El código fuente completo para este ejemplo: `PyTorch: de centralizado a federado (código) <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Nuestro ejemplo, por supuesto, está algo demasiado simplificado porque ambos clientes cargan exactamente el mismo conjunto de datos, lo cual no es realista. Ahora está preparado para explorar este tema más a fondo. ¿Qué tal si utilizamos diferentes subconjuntos de CIFAR-10 en cada cliente? ¿Qué tal agregar más clientes?

source: Example: Walk-Through PyTorch & MNIST
es: Ejemplo: recorrido por PyTorch y MNIST

source: In this tutorial we will learn, how to train a Convolutional Neural Network on MNIST using Flower and PyTorch.
es: En este tutorial aprenderemos cómo entrenar una red neuronal convolucional en MNIST usando Flower y PyTorch.

source: Our example consists of one *server* and two *clients* all having the same model.
es: Nuestro ejemplo consta de un *servidor* y dos *clientes*, todos con el mismo modelo.

source: *Clients* are responsible for generating individual weight-updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce a better model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of weight updates is called a *round*.
es: *Los clientes* son responsables de generar actualizaciones de peso individuales para el modelo en función de sus conjuntos de datos locales. Estas actualizaciones luego se envían al *servidor* que las agregará para producir un mejor modelo. Finalmente, el *servidor* envía esta versión mejorada del modelo a cada *cliente*. Un ciclo completo de actualizaciones de peso se denomina *ronda*.

source: Now that we have a rough idea of what is going on, let's get started. We first need to install Flower. You can do this by running :
es: Ahora que tenemos una idea aproximada de lo que está pasando, comencemos. Primero necesitamos instalar Flower. Puedes hacer esto ejecutando:

source: Since we want to use PyTorch to solve a computer vision task, let's go ahead an install PyTorch and the **torchvision** library:
es: Como queremos usar PyTorch para resolver una tarea de visión por computadora, instalemos PyTorch y la biblioteca **torchvision**:

source: Ready... Set... Train!
es: Listo... listo... ¡Tren!

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. Our training procedure and network architecture are based on PyTorch's `Basic MNIST Example <https://github.com/pytorch/examples/tree/master/mnist>`_. This will allow you see how easy it is to wrap your code with Flower and begin training in a federated way. We provide you with two helper scripts, namely *run-server.sh*, and *run-clients.sh*. Don't be afraid to look inside, they are simple enough =).
es: Ahora que tenemos todas nuestras dependencias instaladas, ejecutemos una capacitación distribuida simple con dos clientes y un servidor. Nuestro procedimiento de capacitación y arquitectura de red se basan en el `Ejemplo MNIST básico <https://github.com/pytorch/examples/tree/master/mnist>`_ de PyTorch. Esto te permitirá ver lo fácil que es empaquetar tu código con Flower y comenzar a entrenar de forma federada. Le proporcionamos dos scripts de ayuda, a saber, *run-server.sh* y *run-clients.sh*. No tengas miedo de mirar dentro, son bastante simples =).

source: Go ahead and launch on a terminal the *run-server.sh* script first as follows:
es: Continúe e inicie en una terminal el script *run-server.sh* primero de la siguiente manera:

source: Now that the server is up and running, go ahead and launch the clients.
es: Ahora que el servidor está en funcionamiento, continúe e inicie los clientes.

source: Et voilà! You should be seeing the training procedure and, after a few iterations, the test accuracy for each client.
es: ¡Y voilá! Debería ver el procedimiento de capacitación y, después de algunas iteraciones, la precisión de la prueba para cada cliente.

source: Now, let's see what is really happening inside.
es: Ahora, veamos qué está pasando realmente en el interior.

source: Flower Server
es: Servidor de flores

source: Inside the server helper script *run-server.sh* you will find the following code that basically runs the :code:`server.py`
es: Dentro del script auxiliar del servidor *run-server.sh* encontrará el siguiente código que básicamente ejecuta :code:`server.py`

source: We can go a bit deeper and see that :code:`server.py` simply launches a server that will coordinate three rounds of training. Flower Servers are very customizable, but for simple workloads, we can start a server using the :ref:`start_server <flwr-server-start_server-apiref>` function and leave all the configuration possibilities at their default values, as seen below.
es: Podemos profundizar un poco más y ver que :code:`server.py` simplemente inicia un servidor que coordinará tres rondas de entrenamiento. Los servidores Flower son muy personalizables, pero para cargas de trabajo simples, podemos iniciar un servidor usando la función :ref:`start_server <flwr-server-start_server-apiref>` y dejar todas las posibilidades de configuración en sus valores predeterminados, como se ve a continuación.

source: Flower Client
es: Cliente de flores

source: Next, let's take a look at the *run-clients.sh* file. You will see that it contains the main loop that starts a set of *clients*.
es: A continuación, echemos un vistazo al archivo *run-clients.sh*. Verás que contiene el bucle principal que inicia un conjunto de *clientes*.

source: **cid**: is the client ID. It is an integer that uniquely identifies client identifier.
es: **cid**: es el ID del cliente. Es un número entero que identifica de forma única el identificador del cliente.

source: **sever_address**: String that identifies IP and port of the server.
es: **sever_address**: Cadena que identifica IP y puerto del servidor.

source: **nb_clients**: This defines the number of clients being created. This piece of information is not required by the client, but it helps us partition the original MNIST dataset to make sure that every client is working on unique subsets of both *training* and *test* sets.
es: **nb_clients**: Esto define la cantidad de clientes que se crean. El cliente no requiere esta información, pero nos ayuda a particionar el conjunto de datos MNIST original para asegurarnos de que cada cliente esté trabajando en subconjuntos únicos de conjuntos de *entrenamiento* y *prueba*.

source: Again, we can go deeper and look inside :code:`flwr_example/quickstart-pytorch/client.py`. After going through the argument parsing code at the beginning of our :code:`main` function, you will find a call to :code:`mnist.load_data`. This function is responsible for partitioning the original MNIST datasets (*training* and *test*) and returning a :code:`torch.utils.data.DataLoader` s for each of them. We then instantiate a :code:`PytorchMNISTClient` object with our client ID, our DataLoaders, the number of epochs in each round, and which device we want to use for training (CPU or GPU).
es: Nuevamente, podemos profundizar y mirar dentro de :code:`flwr_example/quickstart-pytorch/client.py`. Después de revisar el código de análisis de argumentos al comienzo de nuestra función :code:`main`, encontrará una llamada a :code:`mnist.load_data`. Esta función es responsable de particionar los conjuntos de datos MNIST originales (*entrenamiento* y *prueba*) y devolver un :code:`torch.utils.data.DataLoader` s para cada uno de ellos. Luego creamos una instancia de un objeto :code:`PytorchMNISTClient` con nuestro ID de cliente, nuestros DataLoaders, el número de épocas en cada ronda y qué dispositivo queremos usar para el entrenamiento (CPU o GPU).

source: The :code:`PytorchMNISTClient` object when finally passed to :code:`fl.client.start_client` along with the server's address as the training process begins.
es: El objeto :code:`PytorchMNISTClient` finalmente se pasa a :code:`fl.client.start_client` junto con la dirección del servidor cuando comienza el proceso de capacitación.

source: A Closer Look
es: Una mirada más cercana

source: Now, let's look closely into the :code:`PytorchMNISTClient` inside :code:`flwr_example.quickstart-pytorch.mnist` and see what it is doing:
es: Ahora, miremos de cerca el :code:`PytorchMNISTClient` dentro de :code:`flwr_example.quickstart-pytorch.mnist` y veamos qué está haciendo:

source: The first thing to notice is that :code:`PytorchMNISTClient` instantiates a CNN model inside its constructor
es: Lo primero que hay que notar es que :code:`PytorchMNISTClient` crea una instancia de un modelo CNN dentro de su constructor.

source: The code for the CNN is available under :code:`quickstart-pytorch.mnist` and it is reproduced below. It is the same network found in `Basic MNIST Example <https://github.com/pytorch/examples/tree/master/mnist>`_.
es: El código de CNN está disponible en :code:`quickstart-pytorch.mnist` y se reproduce a continuación. Es la misma red que se encuentra en el `Ejemplo básico de MNIST <https://github.com/pytorch/examples/tree/master/mnist>`_.

source: The second thing to notice is that :code:`PytorchMNISTClient` class inherits from the :code:`fl.client.Client`, and hence it must implement the following methods:
es: Lo segundo que hay que notar es que la clase :code:`PytorchMNISTClient` hereda de :code:`fl.client.Client` y, por lo tanto, debe implementar los siguientes métodos:

source: When comparing the abstract class to its derived class :code:`PytorchMNISTClient` you will notice that :code:`fit` calls a :code:`train` function and that :code:`evaluate` calls a :code:`test`: function.
es: Al comparar la clase abstracta con su clase derivada :code:`PytorchMNISTClient`, notará que :code:`fit` llama a una función :code:`train` y que :code:`evaluate` llama a una :code:`test` : función.

source: These functions can both be found inside the same :code:`quickstart-pytorch.mnist` module:
es: Estas funciones se pueden encontrar dentro del mismo módulo :code:`quickstart-pytorch.mnist`:
