Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: The function ``start_simulation`` accepts a number of arguments, amongst them the ``client_fn`` used to create ``FlowerClient`` instances, the number of clients to simulate (``num_clients``), the number of federated learning rounds (``num_rounds``), and the strategy. The strategy encapsulates the federated learning approach/algorithm, for example, *Federated Averaging* (FedAvg).
es: La función ``start_simulation`` acepta una serie de argumentos, entre ellos el ``client_fn`` usado para crear instancias de ``FlowerClient``, el número de clientes a simular (``num_clients``), el número de aprendizaje federado rondas (``num_rounds``) y la estrategia. La estrategia encapsula el enfoque/algoritmo de aprendizaje federado, por ejemplo, *Promedio federado* (FedAvg).

source: Flower has a number of built-in strategies, but we can also use our own strategy implementations to customize nearly all aspects of the federated learning approach. For this example, we use the built-in ``FedAvg`` implementation and customize it using a few basic parameters. The last step is the actual call to ``start_simulation`` which - you guessed it - starts the simulation:
es: Flower tiene una serie de estrategias integradas, pero también podemos utilizar nuestras propias implementaciones de estrategias para personalizar casi todos los aspectos del enfoque de aprendizaje federado. Para este ejemplo, usamos la implementación incorporada ``FedAvg`` y la personalizamos usando algunos parámetros básicos. El último paso es la llamada real a ``start_simulation`` que, como lo has adivinado, inicia la simulación:

source: Behind the scenes
es: Entre bastidores

source: So how does this work? How does Flower execute this simulation?
es: Entonces, ¿cómo funciona esto? ¿Cómo ejecuta Flower esta simulación?

source: When we call ``start_simulation``, we tell Flower that there are 10 clients (``num_clients=10``). Flower then goes ahead an asks the ``FedAvg`` strategy to select clients. ``FedAvg`` knows that it should select 100% of the available clients (``fraction_fit=1.0``), so it goes ahead and selects 10 random clients (i.e., 100% of 10).
es: Cuando llamamos a ``start_simulation``, le decimos a Flower que hay 10 clientes (``num_clients=10``). Luego, Flower sigue adelante y solicita la estrategia ``FedAvg`` para seleccionar clientes. ``FedAvg`` sabe que debe seleccionar el 100% de los clientes disponibles (``fraction_fit=1.0``), por lo que sigue adelante y selecciona 10 clientes aleatorios (es decir, el 100% de 10).

source: Flower then asks the selected 10 clients to train the model. When the server receives the model parameter updates from the clients, it hands those updates over to the strategy (*FedAvg*) for aggregation. The strategy aggregates those updates and returns the new global model, which then gets used in the next round of federated learning.
es: Luego, Flower pide a los 10 clientes seleccionados que entrenen al modelo. Cuando el servidor recibe las actualizaciones de los parámetros del modelo de los clientes, entrega esas actualizaciones a la estrategia (*FedAvg*) para su agregación. La estrategia agrega esas actualizaciones y devuelve el nuevo modelo global, que luego se utiliza en la siguiente ronda de aprendizaje federado.

source: Where's the accuracy?
es: ¿Dónde está la precisión?

source: You may have noticed that all metrics except for ``losses_distributed`` are empty. Where did the ``{"accuracy": float(accuracy)}`` go?
es: Es posible que hayas notado que todas las métricas excepto ``losses_distributed`` están vacías. ¿A dónde se fue ``{"accuracy": float(accuracy)}``?

source: Flower can automatically aggregate losses returned by individual clients, but it cannot do the same for metrics in the generic metrics dictionary (the one with the ``accuracy`` key). Metrics dictionaries can contain very different kinds of metrics and even key/value pairs that are not metrics at all, so the framework does not (and can not) know how to handle these automatically.
es: Flower puede agregar automáticamente las pérdidas devueltas por clientes individuales, pero no puede hacer lo mismo con las métricas en el diccionario de métricas genérico (el que tiene la clave "precisión"). Los diccionarios de métricas pueden contener tipos muy diferentes de métricas e incluso pares clave/valor que no son métricas en absoluto, por lo que el marco no sabe (ni puede) cómo manejarlos automáticamente.

source: As users, we need to tell the framework how to handle/aggregate these custom metrics, and we do so by passing metric aggregation functions to the strategy. The strategy will then call these functions whenever it receives fit or evaluate metrics from clients. The two possible functions are ``fit_metrics_aggregation_fn`` and ``evaluate_metrics_aggregation_fn``.
es: Como usuarios, debemos decirle al marco cómo manejar/agregar estas métricas personalizadas, y lo hacemos pasando funciones de agregación de métricas a la estrategia. Luego, la estrategia llamará a estas funciones cada vez que reciba métricas de ajuste o evaluación de los clientes. Las dos funciones posibles son ``fit_metrics_aggregation_fn`` y ``evaluate_metrics_aggregation_fn``.

source: Let's create a simple weighted averaging function to aggregate the ``accuracy`` metric we return from ``evaluate``:
es: Creemos una función de promedio ponderado simple para agregar la métrica de ``precisión`` que devolvemos de ``evaluar``:

source: The only thing left to do is to tell the strategy to call this function whenever it receives evaluation metric dictionaries from the clients:
es: Lo único que queda por hacer es decirle a la estrategia que llame a esta función cada vez que reciba diccionarios de métricas de evaluación de los clientes:

source: We now have a full system that performs federated training and federated evaluation. It uses the ``weighted_average`` function to aggregate custom evaluation metrics and calculates a single ``accuracy`` metric across all clients on the server side.
es: Ahora tenemos un sistema completo que realiza entrenamiento federado y evaluación federada. Utiliza la función ``weighted_average`` para agregar métricas de evaluación personalizadas y calcula una única métrica de ``precisión`` en todos los clientes del lado del servidor.

source: The other two categories of metrics (``losses_centralized`` and ``metrics_centralized``) are still empty because they only apply when centralized evaluation is being used. Part two of the Flower tutorial will cover centralized evaluation.
es: Las otras dos categorías de métricas (``losses_centralized`` y ``metrics_centralized``) todavía están vacías porque solo se aplican cuando se utiliza la evaluación centralizada. La segunda parte del tutorial de Flower cubrirá la evaluación centralizada.

source: Final remarks
es: Observaciones finales

source: Congratulations, you just trained a convolutional neural network, federated over 10 clients! With that, you understand the basics of federated learning with Flower. The same approach you've seen can be used with other machine learning frameworks (not just PyTorch) and tasks (not just CIFAR-10 images classification), for example NLP with Hugging Face Transformers or speech with SpeechBrain.
es: ¡Felicitaciones, acaba de entrenar una red neuronal convolucional, federada a más de 10 clientes! Con esto, comprende los conceptos básicos del aprendizaje federado con Flower. El mismo enfoque que ha visto se puede utilizar con otros marcos de aprendizaje automático (no solo PyTorch) y tareas (no solo con la clasificación de imágenes CIFAR-10), por ejemplo, PNL con Hugging Face Transformers o voz con SpeechBrain.

source: In the next notebook, we're going to cover some more advanced concepts. Want to customize your strategy? Initialize parameters on the server side? Or evaluate the aggregated model on the server side? We'll cover all this and more in the next tutorial.
es: En el próximo cuaderno, cubriremos algunos conceptos más avanzados. ¿Quieres personalizar tu estrategia? ¿Inicializar parámetros en el lado del servidor? ¿O evaluar el modelo agregado en el lado del servidor? Cubriremos todo esto y más en el próximo tutorial.

source: The `Flower Federated Learning Tutorial - Part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__ goes into more depth about strategies and all the advanced things you can build with them.
es: El `Tutorial de aprendizaje federado de Flower - Parte 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__ profundiza en las estrategias y todos los aspectos avanzados. cosas que puedes construir con ellos.

source: Quickstart Android
es: Inicio rápido Android

source: Let's build a federated learning system using TFLite and Flower on Android!
es: ¡Construyamos un sistema de aprendizaje federado usando TFLite y Flower en Android!

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/android>`_ to learn more.
es: Consulte el `ejemplo de código completo <https://github.com/adap/flower/tree/main/examples/android>`_ para obtener más información.

source: Quickstart fastai
es: Inicio rápido fastai

source: Let's build a federated learning system using fastai and Flower!
es: ¡Construyamos un sistema de aprendizaje federado usando fastai y Flower!

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-fastai>`_ to learn more.
es: Consulte el `ejemplo de código completo <https://github.com/adap/flower/tree/main/examples/quickstart-fastai>`_ para obtener más información.

source: Quickstart 🤗 Transformers
es: Inicio rápido 🤗 Transformadores

source: Let's build a federated learning system using Hugging Face Transformers and Flower!
es: ¡Construyamos un sistema de aprendizaje federado utilizando Hugging Face Transformers y Flower!

source: We will leverage Hugging Face to federate the training of language models over multiple clients using Flower. More specifically, we will fine-tune a pre-trained Transformer model (distilBERT) for sequence classification over a dataset of IMDB ratings. The end goal is to detect if a movie rating is positive or negative.
es: Aprovecharemos Hugging Face para federar la capacitación de modelos de lenguaje en varios clientes que utilizan Flower. Más específicamente, ajustaremos un modelo Transformer previamente entrenado (distilBERT) para la clasificación de secuencias en un conjunto de datos de calificaciones IMDB. El objetivo final es detectar si la valoración de una película es positiva o negativa.

source: Dependencies
es: Dependencias

source: To follow along this tutorial you will need to install the following packages: :code:`datasets`, :code:`evaluate`, :code:`flwr`, :code:`torch`, and :code:`transformers`. This can be done using :code:`pip`:
es: Para seguir este tutorial necesitarás instalar los siguientes paquetes: :code:`datasets`, :code:`evaluate`, :code:`flwr`, :code:`torch` y :code:`transformers`. Esto se puede hacer usando :code:`pip`:

source: Standard Hugging Face workflow
es: Flujo de trabajo estándar para abrazar la cara

source: Handling the data
es: Manejando los datos

source: To fetch the IMDB dataset, we will use Hugging Face's :code:`datasets` library. We then need to tokenize the data and create :code:`PyTorch` dataloaders, this is all done in the :code:`load_data` function:
es: Para recuperar el conjunto de datos de IMDB, usaremos la biblioteca :code:`datasets` de Hugging Face. Luego necesitamos tokenizar los datos y crear cargadores de datos :code:`PyTorch`, todo esto se hace en la función :code:`load_data`:

source: Training and testing the model
es: Entrenamiento y prueba del modelo.

source: Once we have a way of creating our trainloader and testloader, we can take care of the training and testing. This is very similar to any :code:`PyTorch` training or testing loop:
es: Una vez que tengamos una forma de crear nuestro cargador de trenes y nuestro cargador de pruebas, podemos encargarnos del entrenamiento y las pruebas. Esto es muy similar a cualquier bucle de prueba o entrenamiento :code:`PyTorch`:

source: Creating the model itself
es: Creando el modelo en sí.

source: To create the model itself, we will just load the pre-trained distillBERT model using Hugging Face’s :code:`AutoModelForSequenceClassification` :
es: Para crear el modelo en sí, simplemente cargaremos el modelo distillBERT previamente entrenado usando el :código:`AutoModelForSequenceClassification` de Hugging Face:

source: Federating the example
es: Federando el ejemplo

source: Creating the IMDBClient
es: Creando el cliente IMDB

source: To federate our example to multiple clients, we first need to write our Flower client class (inheriting from :code:`flwr.client.NumPyClient`). This is very easy, as our model is a standard :code:`PyTorch` model:
es: Para federar nuestro ejemplo a múltiples clientes, primero necesitamos escribir nuestra clase de cliente Flower (heredando de :code:`flwr.client.NumPyClient`). Esto es muy fácil, ya que nuestro modelo es un modelo estándar :code:`PyTorch`:

source: The :code:`get_parameters` function lets the server get the client's parameters. Inversely, the :code:`set_parameters` function allows the server to send its parameters to the client. Finally, the :code:`fit` function trains the model locally for the client, and the :code:`evaluate` function tests the model locally and returns the relevant metrics.
es: La función :code:`get_parameters` permite al servidor obtener los parámetros del cliente. A la inversa, la función :code:`set_parameters` permite que el servidor envíe sus parámetros al cliente. Finalmente, la función :code:`fit` entrena el modelo localmente para el cliente, y la función :code:`evaluate` prueba el modelo localmente y devuelve las métricas relevantes.

source: Starting the server
es: Iniciando el servidor

source: Now that we have a way to instantiate clients, we need to create our server in order to aggregate the results. Using Flower, this can be done very easily by first choosing a strategy (here, we are using :code:`FedAvg`, which will define the global weights as the average of all the clients' weights at each round) and then using the :code:`flwr.server.start_server` function:
es: Ahora que tenemos una forma de crear instancias de clientes, necesitamos crear nuestro servidor para agregar los resultados. Usando Flower, esto se puede hacer muy fácilmente eligiendo primero una estrategia (aquí estamos usando :code:`FedAvg`, que definirá las ponderaciones globales como el promedio de las ponderaciones de todos los clientes en cada ronda) y luego usando el :código:`flwr.server.start_server` función:

source: The :code:`weighted_average` function is there to provide a way to aggregate the metrics distributed amongst the clients (basically this allows us to display a nice average accuracy and loss for every round).
es: La función :code:`weighted_average` está ahí para proporcionar una forma de agregar las métricas distribuidas entre los clientes (básicamente, esto nos permite mostrar una buena precisión y pérdida promedio para cada ronda).

source: Putting everything together
es: Poniendo todo junto

source: We can now start client instances using:
es: Ahora podemos iniciar instancias de cliente usando:

source: And they will be able to connect to the server and start the federated training.
es: Y podrán conectarse al servidor e iniciar el entrenamiento federado.

source: If you want to check out everything put together, you should check out the full code example: [https://github.com/adap/flower/tree/main/examples/quickstart-huggingface](https://github.com/adap/flower/tree/main/examples/quickstart-huggingface).
es: Si desea ver todo junto, debe consultar el ejemplo de código completo: [https://github.com/adap/flower/tree/main/examples/quickstart-huggingface](https://github.com /adap/flower/tree/main/examples/quickstart-huggingface).

source: Of course, this is a very basic example, and a lot can be added or modified, it was just to showcase how simply we could federate a Hugging Face workflow using Flower.
es: Por supuesto, este es un ejemplo muy básico, y se pueden agregar o modificar muchas cosas, fue solo para mostrar con qué facilidad podemos federar un flujo de trabajo de Hugging Face usando Flower.

source: Note that in this example we used :code:`PyTorch`, but we could have very well used :code:`TensorFlow`.
es: Tenga en cuenta que en este ejemplo usamos :code:`PyTorch`, pero podríamos haber usado muy bien :code:`TensorFlow`.

source: Quickstart iOS
es: Inicio rápido iOS

source: In this tutorial we will learn how to train a Neural Network on MNIST using Flower and CoreML on iOS devices.
es: En este tutorial aprenderemos cómo entrenar una red neuronal en MNIST usando Flower y CoreML en dispositivos iOS.

source: First of all, for running the Flower Python server, it is recommended to create a virtual environment and run everything within a `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_. For the Flower client implementation in iOS, it is recommended to use Xcode as our IDE.
es: En primer lugar, para ejecutar el servidor Flower Python, se recomienda crear un entorno virtual y ejecutar todo dentro de un `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_. Para la implementación del cliente Flower en iOS, se recomienda utilizar Xcode como nuestro IDE.

source: Our example consists of one Python *server* and two iPhone *clients* that all have the same model.
es: Nuestro ejemplo consta de un *servidor* Python y dos *clientes* iPhone que tienen el mismo modelo.

source: *Clients* are responsible for generating individual weight updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce a better model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of weight updates is called a *round*.
es: *Los clientes* son responsables de generar actualizaciones de peso individuales para el modelo en función de sus conjuntos de datos locales. Estas actualizaciones luego se envían al *servidor* que las agregará para producir un mejor modelo. Finalmente, el *servidor* envía esta versión mejorada del modelo a cada *cliente*. Un ciclo completo de actualizaciones de peso se denomina *ronda*.

source: Now that we have a rough idea of what is going on, let's get started to setup our Flower server environment. We first need to install Flower. You can do this by using pip:
es: Ahora que tenemos una idea aproximada de lo que está pasando, comencemos a configurar nuestro entorno de servidor Flower. Primero necesitamos instalar Flower. Puedes hacer esto usando pip:

source: Or Poetry:
es: O poesía:

source: Now that we have all our dependencies installed, let's run a simple distributed training using CoreML as our local training pipeline and MNIST as our dataset. For simplicity reasons we will use the complete Flower client with CoreML, that has been implemented and stored inside the Swift SDK. The client implementation can be seen below:
es: Ahora que tenemos todas nuestras dependencias instaladas, ejecutemos una capacitación distribuida simple utilizando CoreML como nuestro canal de capacitación local y MNIST como nuestro conjunto de datos. Por razones de simplicidad, utilizaremos el cliente Flower completo con CoreML, que se ha implementado y almacenado dentro del SDK de Swift. La implementación del cliente se puede ver a continuación:

source: Let's create a new application project in Xcode and add :code:`flwr` as a dependency in your project. For our application, we will store the logic of our app in :code:`FLiOSModel.swift` and the UI elements in :code:`ContentView.swift`. We will focus more on :code:`FLiOSModel.swift` in this quickstart. Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/ios>`_ to learn more about the app.
es: Creemos un nuevo proyecto de aplicación en Xcode y agreguemos :code:`flwr` como una dependencia en su proyecto. Para nuestra aplicación, almacenaremos la lógica de nuestra aplicación en :code:`FLiOSModel.swift` y los elementos de la interfaz de usuario en :code:`ContentView.swift`. Nos centraremos más en :code:`FLiOSModel.swift` en este inicio rápido. Consulte el `ejemplo de código completo <https://github.com/adap/flower/tree/main/examples/ios>`_ para obtener más información sobre la aplicación.

source: Import Flower and CoreML related packages in :code:`FLiOSModel.swift`:
es: Importe paquetes relacionados con Flower y CoreML en :code:`FLiOSModel.swift`:

source: Then add the mlmodel to the project simply by drag-and-drop, the mlmodel will be bundled inside the application during deployment to your iOS device. We need to pass the url to access mlmodel and run CoreML machine learning processes, it can be retrieved by calling the function :code:`Bundle.main.url`. For the MNIST dataset, we need to preprocess it into :code:`MLBatchProvider` object. The preprocessing is done inside :code:`DataLoader.swift`.
es: Luego agregue el modelo ml al proyecto simplemente arrastrando y soltando, el modelo ml se incluirá dentro de la aplicación durante la implementación en su dispositivo iOS. Necesitamos pasar la URL para acceder a mlmodel y ejecutar procesos de aprendizaje automático de CoreML; se puede recuperar llamando a la función: código: `Bundle.main.url`. Para el conjunto de datos MNIST, necesitamos preprocesarlo en el objeto :code:`MLBatchProvider`. El preprocesamiento se realiza dentro de :code:`DataLoader.swift`.

source: Since CoreML does not allow the model parameters to be seen before training, and accessing the model parameters during or after the training can only be done by specifying the layer name, we need to know this informations beforehand, through looking at the model specification, which are written as proto files. The implementation can be seen in :code:`MLModelInspect`.
es: Dado que CoreML no permite ver los parámetros del modelo antes del entrenamiento, y el acceso a los parámetros del modelo durante o después del entrenamiento solo se puede realizar especificando el nombre de la capa, necesitamos conocer esta información de antemano, consultando la especificación del modelo, que están escritos como archivos proto. La implementación se puede ver en :code:`MLModelInspect`.

source: After we have all of the necessary informations, let's create our Flower client.
es: Una vez que tengamos toda la información necesaria, creemos nuestro cliente Flower.

source: Then start the Flower gRPC client and start communicating to the server by passing our Flower client to the function :code:`startFlwrGRPC`.
es: Luego inicie el cliente Flower gRPC y comience a comunicarse con el servidor pasando nuestro cliente Flower a la función: código: `startFlwrGRPC`.

source: That's it for the client. We only have to implement :code:`Client` or call the provided :code:`MLFlwrClient` and call :code:`startFlwrGRPC()`. The attribute :code:`hostname` and :code:`port` tells the client which server to connect to. This can be done by entering the hostname and port in the application before clicking the start button to start the federated learning process.
es: Eso es todo para el cliente. Solo tenemos que implementar :code:`Client` o llamar al :code:`MLFlwrClient` proporcionado y llamar a :code:`startFlwrGRPC()`. El atributo :code:`hostname` y :code:`port` le dice al cliente a qué servidor conectarse. Esto se puede hacer ingresando el nombre de host y el puerto en la aplicación antes de hacer clic en el botón de inicio para iniciar el proceso de aprendizaje federado.
