Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: The :code:`VirtualClientEngine` schedules, launches and manages `virtual` clients. These clients are identical to `non-virtual` clients (i.e. the ones you launch via the command `flwr.client.start_numpy_client <ref-api-flwr.html#start-numpy-client>`_) in the sense that they can be configure by creating a class inheriting, for example, from `flwr.client.NumPyClient <ref-api-flwr.html#flwr.client.NumPyClient>`_ and therefore behave in an identical way. In addition to that, clients managed by the :code:`VirtualClientEngine` are:
es: El :code:`VirtualClientEngine` programa, lanza y administra clientes `virtuales`. Estos clientes son idénticos a los clientes `no virtuales` (es decir, los que se inician mediante el comando `flwr.client.start_numpy_client <ref-api-flwr.html#start-numpy-client>`_) en el sentido de que pueden se puede configurar creando una clase que hereda, por ejemplo, de `flwr.client.NumPyClient <ref-api-flwr.html#flwr.client.NumPyClient>`_ y por tanto se comporta de forma idéntica. Además de eso, los clientes administrados por :code:`VirtualClientEngine` son:

source: resource-aware: this means that each client gets assigned a portion of the compute and memory on your system. You as a user can control this at the beginning of the simulation and allows you to control the degree of parallelism of your Flower FL simulation. The fewer the resources per client, the more clients can run concurrently on the same hardware.
es: Consciente de recursos: esto significa que a cada cliente se le asigna una parte de la computación y la memoria de su sistema. Usted, como usuario, puede controlar esto al comienzo de la simulación y le permite controlar el grado de paralelismo de su simulación de Flower FL. Cuantos menos recursos por cliente, más clientes podrán ejecutarse simultáneamente en el mismo hardware.

source: self-managed: this means that you as a user do not need to launch clients manually, instead this gets delegated to :code:`VirtualClientEngine`'s internals.
es: autoadministrado: esto significa que usted, como usuario, no necesita iniciar clientes manualmente, sino que esto se delega a :code:`VirtualClientEngine`s internals.

source: ephemeral: this means that a client is only materialized when it is required in the FL process (e.g. to do `fit() <ref-api-flwr.html#flwr.client.Client.fit>`_). The object is destroyed afterwards, releasing the resources it was assigned and allowing in this way other clients to participate.
es: efímero: esto significa que un cliente solo se materializa cuando es requerido en el proceso FL (por ejemplo, para hacer `fit() <ref-api-flwr.html#flwr.client.Client.fit>`_). Posteriormente el objeto se destruye, liberando los recursos que tenía asignados y permitiendo así la participación de otros clientes.

source: The :code:`VirtualClientEngine` implements `virtual` clients using `Ray <https://www.ray.io/>`_, an open-source framework for scalable Python workloads. In particular, Flower's :code:`VirtualClientEngine` makes use of `Actors <https://docs.ray.io/en/latest/ray-core/actors.html>`_ to spawn `virtual` clients and run their workload.
es: :code:`VirtualClientEngine` implementa clientes `virtuales` usando `Ray <https://www.ray.io/>`_, un marco de código abierto para cargas de trabajo escalables de Python. En particular, :code:`VirtualClientEngine` de Flower hace uso de `Actors <https://docs.ray.io/en/latest/ray-core/actors.html>`_ para generar clientes `virtuales` y ejecutar su carga de trabajo. .

source: Launch your Flower simulation
es: Inicie su simulación de flores

source: Running Flower simulations still require you to define your client class, a strategy, and utility functions to download and load (and potentially partition) your dataset. With that out of the way, launching your simulation is done with `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ and a minimal example looks as follows:
es: La ejecución de simulaciones de Flower aún requiere que usted defina su clase de cliente, una estrategia y funciones de utilidad para descargar y cargar (y potencialmente particionar) su conjunto de datos. Una vez aclarado esto, el lanzamiento de la simulación se realiza con `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ y un ejemplo mínimo tiene el siguiente aspecto:

source: VirtualClientEngine resources
es: Recursos de VirtualClientEngine

source: By default the VCE has access to all system resources (i.e. all CPUs, all GPUs, etc) since that is also the default behavior when starting Ray. However, in some settings you might want to limit how many of your system resources are used for simulation. You can do this via the :code:`ray_init_args` input argument to :code:`start_simulation` which the VCE internally passes to Ray's :code:`ray.init` command. For a complete list of settings you can configure check the `ray.init <https://docs.ray.io/en/latest/ray-core/api/doc/ray.init.html#ray-init>`_ documentation. Do not set :code:`ray_init_args` if you want the VCE to use all your system's CPUs and GPUs.
es: De forma predeterminada, VCE tiene acceso a todos los recursos del sistema (es decir, todas las CPU, todas las GPU, etc.), ya que ese también es el comportamiento predeterminado al iniciar Ray. Sin embargo, en algunas configuraciones es posible que desee limitar la cantidad de recursos del sistema que se utilizan para la simulación. Puede hacer esto a través del argumento de entrada :code:`ray_init_args` a :code:`start_simulation` que el VCE pasa internamente al comando :code:`ray.init` de Ray. Para obtener una lista completa de las configuraciones que puede configurar, consulte `ray.init <https://docs.ray.io/en/latest/ray-core/api/doc/ray.init.html#ray-init>`_ documentación. No configure :code:`ray_init_args` si desea que VCE utilice todas las CPU y GPU de su sistema.

source: Assigning client resources
es: Asignación de recursos del cliente

source: By default the :code:`VirtualClientEngine` assigns a single CPU core (and nothing else) to each virtual client. This means that if your system has 10 cores, that many virtual clients can be concurrently running.
es: De forma predeterminada, :code:`VirtualClientEngine` asigna un único núcleo de CPU (y nada más) a cada cliente virtual. Esto significa que si su sistema tiene 10 núcleos, se pueden ejecutar muchos clientes virtuales simultáneamente.

source: More often than not, you would probably like to adjust the resources your clients get assigned based on the complexity (i.e. compute and memory footprint) of your FL workload. You can do so when starting your simulation by setting the argument `client_resources` to `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_. Two keys are internally used by Ray to schedule and spawn workloads (in our case Flower clients):
es: La mayoría de las veces, probablemente le gustaría ajustar los recursos que se asignan a sus clientes en función de la complejidad (es decir, el uso de computación y memoria) de su carga de trabajo de FL. Puede hacerlo al iniciar su simulación configurando el argumento `client_resources` en `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_. Ray utiliza internamente dos claves para programar y generar cargas de trabajo (en nuestro caso, clientes Flower):

source: :code:`num_cpus` indicates the number of CPU cores a client would get.
es: :code:`num_cpus` indica la cantidad de núcleos de CPU que obtendría un cliente.

source: :code:`num_gpus` indicates the **ratio** of GPU memory a client gets assigned.
es: :code:`num_gpus` indica la **proporción** de memoria GPU que se asigna a un cliente.

source: Let's see a few examples:
es: Veamos algunos ejemplos:

source: While the :code:`client_resources` can be used to control the degree of concurrency in your FL simulation, this does not stop you from running dozens, hundreds or even thousands of clients in the same round and having orders of magnitude more `dormant` (i.e. not participating in a round) clients. Let's say you want to have 100 clients per round but your system can only accommodate 8 clients concurrently. The :code:`VirtualClientEngine` will schedule 100 jobs to run (each simulating a client sampled by the strategy) and then will execute them in a resource-aware manner in batches of 8.
es: Si bien :code:`client_resources` se puede utilizar para controlar el grado de concurrencia en su simulación FL, esto no le impide ejecutar docenas, cientos o incluso miles de clientes en la misma ronda y tener órdenes de magnitud más "inactivos". (es decir, no participar en una ronda) clientes. Digamos que desea tener 100 clientes por ronda pero su sistema sólo puede acomodar 8 clientes simultáneamente. El :code:`VirtualClientEngine` programará la ejecución de 100 trabajos (cada uno simulando un cliente muestreado por la estrategia) y luego los ejecutará teniendo en cuenta los recursos en lotes de 8.

source: To understand all the intricate details on how resources are used to schedule FL clients and how to define custom resources, please take a look at the `Ray documentation <https://docs.ray.io/en/latest/ray-core/scheduling/resources.html>`_.
es: Para comprender todos los detalles complejos sobre cómo se utilizan los recursos para programar clientes FL y cómo definir recursos personalizados, consulte la `documentación de Ray <https://docs.ray.io/en/latest/ray-core/ programación/recursos.html>`_.

source: Simulation examples
es: Ejemplos de simulación

source: A few ready-to-run complete examples for Flower simulation in Tensorflow/Keras and PyTorch are provided in the `Flower repository <https://github.com/adap/flower>`_. You can run them on Google Colab too:
es: Se proporcionan algunos ejemplos completos listos para ejecutar para la simulación de flores en Tensorflow/Keras y PyTorch en el `Repositorio de flores <https://github.com/adap/flower>`_. También puedes ejecutarlos en Google Colab:

source: `Tensorflow/Keras Simulation <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_: 100 clients collaboratively train a MLP model on MNIST.
es: `Tensorflow/Simulación Keras <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_: 100 clientes entrenan de forma colaborativa un modelo MLP en MNIST.

source: `PyTorch Simulation <https://github.com/adap/flower/tree/main/examples/simulation-pytorch>`_: 100 clients collaboratively train a CNN model on MNIST.
es: `Simulación PyTorch <https://github.com/adap/flower/tree/main/examples/simulation-pytorch>`_: 100 clientes entrenan de forma colaborativa un modelo CNN en MNIST.

source: Multi-node Flower simulations
es: Simulaciones de flores de múltiples nodos

source: Flower's :code:`VirtualClientEngine` allows you to run FL simulations across multiple compute nodes. Before starting your multi-node simulation ensure that you:
es: :code:`VirtualClientEngine` de Flower le permite ejecutar simulaciones de FL en múltiples nodos informáticos. Antes de comenzar su simulación de múltiples nodos, asegúrese de:

source: Have the same Python environment in all nodes.
es: Tener el mismo entorno Python en todos los nodos.

source: Have a copy of your code (e.g. your entire repo) in all nodes.
es: Tenga una copia de su código (por ejemplo, su repositorio completo) en todos los nodos.

source: Have a copy of your dataset in all nodes (more about this in :ref:`simulation considerations <considerations-for-simulations>`)
es: Tenga una copia de su conjunto de datos en todos los nodos (más sobre esto en :ref:`consideraciones de simulación <consideraciones-para-simulaciones>`)

source: Pass :code:`ray_init_args={"address"="auto"}` to `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ so the :code:`VirtualClientEngine` attaches to a running Ray instance.
es: Pase :code:`ray_init_args={"address"="auto"}` a `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ para que :code:`VirtualClientEngine` se conecte a un Ray en ejecución instancia.

source: Start Ray on you head node: on the terminal type :code:`ray start --head`. This command will print a few lines, one of which indicates how to attach other nodes to the head node.
es: Inicie Ray en su nodo principal: en el terminal escriba :código:`ray start --head`. Este comando imprimirá algunas líneas, una de las cuales indica cómo conectar otros nodos al nodo principal.

source: Attach other nodes to the head node: copy the command shown after starting the head and execute it on terminal of a new node: for example :code:`ray start --address='192.168.1.132:6379'`
es: Adjunte otros nodos al nodo principal: copie el comando que se muestra después de iniciar el nodo principal y ejecútelo en la terminal de un nuevo nodo: por ejemplo :code:`ray start --address='192.168.1.132:6379'`

source: With all the above done, you can run your code from the head node as you would if the simulation was running on a single node.
es: Una vez hecho todo lo anterior, puede ejecutar su código desde el nodo principal como lo haría si la simulación se ejecutara en un solo nodo.

source: Once your simulation is finished, if you'd like to dismantle your cluster you simply need to run the command :code:`ray stop` in each node's terminal (including the head node).
es: Una vez finalizada la simulación, si desea desmantelar su clúster, simplemente necesita ejecutar el comando :code:`ray stop` en la terminal de cada nodo (incluido el nodo principal).

source: Multi-node simulation good-to-know
es: Es bueno saber la simulación de múltiples nodos

source: Here we list a few interesting functionality when running multi-node FL simulations:
es: Aquí enumeramos algunas funciones interesantes al ejecutar simulaciones FL de múltiples nodos:

source: User :code:`ray status` to check all nodes connected to your head node as well as the total resources available to the :code:`VirtualClientEngine`.
es: Usuario :code:`ray status` para verificar todos los nodos conectados a su nodo principal, así como los recursos totales disponibles para :code:`VirtualClientEngine`.

source: When attaching a new node to the head, all its resources (i.e. all CPUs, all GPUs) will be visible by the head node. This means that the :code:`VirtualClientEngine` can schedule as many `virtual` clients as that node can possible run. In some settings you might want to exclude certain resources from the simulation. You can do this by appending `--num-cpus=<NUM_CPUS_FROM_NODE>` and/or `--num-gpus=<NUM_GPUS_FROM_NODE>` in any :code:`ray start` command (including when starting the head)
es: Al adjuntar un nuevo nodo al nodo principal, todos sus recursos (es decir, todas las CPU, todas las GPU) serán visibles para el nodo principal. Esto significa que :code:`VirtualClientEngine` puede programar tantos clientes `virtuales` como sea posible ejecutar ese nodo. En algunas configuraciones, es posible que desee excluir ciertos recursos de la simulación. Puede hacer esto agregando `--num-cpus=<NUM_CPUS_FROM_NODE>` y/o `--num-gpus=<NUM_GPUS_FROM_NODE>` en cualquier comando :code:`ray start` (incluso al iniciar el encabezado)

source: Considerations for simulations
es: Consideraciones para simulaciones

source: We are actively working on these fronts so to make it trivial to run any FL workload with Flower simulation.
es: Estamos trabajando activamente en estos frentes para que sea trivial ejecutar cualquier carga de trabajo FL con simulación de Flower.

source: The current VCE allows you to run Federated Learning workloads in simulation mode whether you are prototyping simple scenarios on your personal laptop or you want to train a complex FL pipeline across multiple high-performance GPU nodes. While we add more capabilities to the VCE, the points below highlight some of the considerations to keep in mind when designing your FL pipeline with Flower. We also highlight a couple of current limitations in our implementation.
es: El VCE actual le permite ejecutar cargas de trabajo de aprendizaje federado en modo de simulación, ya sea que esté creando prototipos de escenarios simples en su computadora portátil personal o si desea entrenar una canalización FL compleja en múltiples nodos GPU de alto rendimiento. Si bien agregamos más capacidades al VCE, los puntos a continuación resaltan algunas de las consideraciones a tener en cuenta al diseñar su canal FL con Flower. También destacamos un par de limitaciones actuales en nuestra implementación.

source: GPU resources
es: Recursos de GPU

source: The VCE assigns a share of GPU memory to a client that specifies the key :code:`num_gpus` in :code:`client_resources`. This being said, Ray (used internally by the VCE) is by default:
es: El VCE asigna una parte de la memoria GPU a un cliente que especifica la clave :code:`num_gpus` en :code:`client_resources`. Dicho esto, Ray (usado internamente por VCE) es por defecto:

source: not aware of the total VRAM available on the GPUs. This means that if you set :code:`num_gpus=0.5` and you have two GPUs in your system with different (e.g. 32GB and 8GB) VRAM amounts, they both would run 2 clients concurrently.
es: No conozco la VRAM total disponible en las GPU. Esto significa que si configura :code:`num_gpus=0.5` y tiene dos GPU en su sistema con diferentes cantidades de VRAM (por ejemplo, 32 GB y 8 GB), ambas ejecutarán 2 clientes simultáneamente.

source: not aware of other unrelated (i.e. not created by the VCE) workloads are running on the GPU. Two takeaways from this are:
es: No tiene conocimiento de que se estén ejecutando otras cargas de trabajo no relacionadas (es decir, no creadas por VCE) en la GPU. Dos conclusiones de esto son:

source: Your Flower server might need a GPU to evaluate the `global model` after aggregation (by instance when making use of the `evaluate method <how-to-implement-strategies.html#the-evaluate-method>`_)
es: Es posible que su servidor Flower necesite una GPU para evaluar el "modelo global" después de la agregación (por ejemplo, cuando utilice el "método de evaluación <how-to-implement-strategies.html#the-evaluate-method>`_)

source: If you want to run several independent Flower simulations on the same machine you need to mask-out your GPUs with :code:`CUDA_VISIBLE_DEVICES="<GPU_IDs>"` when launching your experiment.
es: Si desea ejecutar varias simulaciones de flores independientes en la misma máquina, debe enmascarar sus GPU con :code:`CUDA_VISIBLE_DEVICES="<GPU_IDs>"` al iniciar su experimento.

source: In addition, the GPU resource limits passed to :code:`client_resources` are not `enforced` (i.e. they can be exceeded) which can result in the situation of client using more VRAM than the ratio specified when starting the simulation.
es: Además, los límites de recursos de GPU pasados a :code:`client_resources` no se "aplican" (es decir, se pueden exceder), lo que puede provocar que el cliente utilice más VRAM que la proporción especificada al iniciar la simulación.

source: TensorFlow with GPUs
es: TensorFlow con GPU

source: When `using a GPU with TensorFlow <https://www.tensorflow.org/guide/gpu>`_ nearly your entire GPU memory of all your GPUs visible to the process will be mapped. This is done by TensorFlow for optimization purposes. However, in settings such as FL simulations where we want to split the GPU into multiple `virtual` clients, this is not a desirable mechanism. Luckily we can disable this default behavior by `enabling memory growth <https://www.tensorflow.org/guide/gpu#limiting_gpu_memory_growth>`_.
es: Cuando `usa una GPU con TensorFlow <https://www.tensorflow.org/guide/gpu>`_ se asignará casi toda la memoria de la GPU de todas las GPU visibles para el proceso. TensorFlow hace esto con fines de optimización. Sin embargo, en entornos como simulaciones FL donde queremos dividir la GPU en múltiples clientes "virtuales", este no es un mecanismo deseable. Afortunadamente, podemos desactivar este comportamiento predeterminado `habilitando el crecimiento de la memoria <https://www.tensorflow.org/guide/gpu#limiting_gpu_memory_growth>`_.

source: This would need to be done in the main process (which is where the server would run) and in each Actor created by the VCE. By means of :code:`actor_kwargs` we can pass the reserved key `"on_actor_init_fn"` in order to specify a function to be executed upon actor initialization. In this case, to enable GPU growth for TF workloads. It would look as follows:
es: Esto debería hacerse en el proceso principal (que es donde se ejecutaría el servidor) y en cada Actor creado por VCE. Por medio de :code:`actor_kwargs` podemos pasar la clave reservada `"on_actor_init_fn"` para especificar una función que se ejecutará tras la inicialización del actor. En este caso, para permitir el crecimiento de GPU para cargas de trabajo TF. Quedaría de la siguiente manera:

source: This is precisely the mechanism used in `Tensorflow/Keras Simulation <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_ example.
es: Este es precisamente el mecanismo utilizado en el ejemplo `Tensorflow/Keras Simulation <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_.

source: Multi-node setups
es: Configuraciones de múltiples nodos

source: The VCE does not currently offer a way to control on which node a particular `virtual` client is executed. In other words, if more than a single node have the resources needed by a client to run, then any of those nodes could get the client workload scheduled onto. Later in the FL process (i.e. in a different round) the same client could be executed by a different node. Depending on how your clients access their datasets, this might require either having a copy of all dataset partitions on all nodes or a dataset serving mechanism (e.g. using nfs, a database) to circumvent data duplication.
es: Actualmente, VCE no ofrece una forma de controlar en qué nodo se ejecuta un cliente "virtual" en particular. En otras palabras, si más de un nodo tiene los recursos que necesita un cliente para ejecutarse, entonces cualquiera de esos nodos podría programar la carga de trabajo del cliente. Más adelante en el proceso FL (es decir, en una ronda diferente), un nodo diferente podría ejecutar el mismo cliente. Dependiendo de cómo sus clientes accedan a sus conjuntos de datos, esto podría requerir tener una copia de todas las particiones del conjunto de datos en todos los nodos o un mecanismo de servicio del conjunto de datos (por ejemplo, usar nfs, una base de datos) para evitar la duplicación de datos.

source: By definition virtual clients are `stateless` due to their ephemeral nature. A client state can be implemented as part of the Flower client class but users need to ensure this saved to persistent storage (e.g. a database, disk) and that can be retrieve later by the same client regardless on which node it is running from. This is related to the point above also since, in some way, the client's dataset could be seen as a type of `state`.
es: Por definición, los clientes virtuales son "apátridas" debido a su naturaleza efímera. Se puede implementar un estado de cliente como parte de la clase de cliente Flower, pero los usuarios deben asegurarse de que se guarde en un almacenamiento persistente (por ejemplo, una base de datos, un disco) y que el mismo cliente pueda recuperarlo más tarde, independientemente del nodo desde el que se esté ejecutando. Esto también está relacionado con el punto anterior ya que, de alguna manera, el conjunto de datos del cliente podría verse como un tipo de "estado".

source: Save and load model checkpoints
es: Guardar y cargar puntos de control del modelo
