Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: The PyTorch quickstart example shows CIFAR-10 image classification with a simple Convolutional Neural Network:
es: El ejemplo de inicio rápido de PyTorch muestra la clasificación de imágenes CIFAR-10 con una red neuronal convolucional simple:

source: `Quickstart PyTorch (Code) <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch>`_
es: `Quickstart PyTorch (Código) <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch>`_

source: `Quickstart PyTorch (Tutorial) <https://flower.dev/docs/quickstart-pytorch.html>`_
es: `Inicio rápido de PyTorch (Tutorial) <https://flower.dev/docs/quickstart-pytorch.html>`_

source: PyTorch: From Centralized To Federated
es: PyTorch: de centralizado a federado

source: This example shows how a regular PyTorch project can be federated using Flower:
es: Este ejemplo muestra cómo se puede federar un proyecto PyTorch normal utilizando Flower:

source: `PyTorch: From Centralized To Federated (Code) <https://github.com/adap/flower/tree/main/examples/pytorch-from-centralized-to-federated>`_
es: `PyTorch: de centralizado a federado (código) <https://github.com/adap/flower/tree/main/examples/pytorch-from-centralized-to-federated>`_

source: `PyTorch: From Centralized To Federated (Tutorial) <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_
es: `PyTorch: de centralizado a federado (tutorial) <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_

source: Federated Learning on Raspberry Pi and Nvidia Jetson
es: Aprendizaje federado en Raspberry Pi y Nvidia Jetson

source: This example shows how Flower can be used to build a federated learning system that run across Raspberry Pi and Nvidia Jetson:
es: Este ejemplo muestra cómo se puede utilizar Flower para crear un sistema de aprendizaje federado que se ejecute en Raspberry Pi y Nvidia Jetson:

source: `Federated Learning on Raspberry Pi and Nvidia Jetson (Code) <https://github.com/adap/flower/tree/main/examples/embedded-devices>`_
es: `Aprendizaje federado en Raspberry Pi y Nvidia Jetson (código) <https://github.com/adap/flower/tree/main/examples/embedded-devices>`_

source: `Federated Learning on Raspberry Pi and Nvidia Jetson (Blog Post) <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_
es: `Aprendizaje federado en Raspberry Pi y Nvidia Jetson (Entrada de blog) <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_

source: Legacy Examples (`flwr_example`)
es: Ejemplos heredados (`flwr_example`)

source: The useage examples in `flwr_example` are deprecated and will be removed in the future. New examples are provided as standalone projects in `examples <https://github.com/adap/flower/tree/main/examples>`_.
es: Los ejemplos de uso en `flwr_example` están obsoletos y se eliminarán en el futuro. Se proporcionan nuevos ejemplos como proyectos independientes en `examples <https://github.com/adap/flower/tree/main/examples>`_.

source: Extra Dependencies
es: Dependencias adicionales

source: The core Flower framework keeps a minimal set of dependencies. The examples demonstrate Flower in the context of different machine learning frameworks, so additional dependencies need to be installed before an example can be run.
es: El marco central de Flower mantiene un conjunto mínimo de dependencias. Los ejemplos demuestran Flower en el contexto de diferentes marcos de aprendizaje automático, por lo que es necesario instalar dependencias adicionales antes de poder ejecutar un ejemplo.

source: For PyTorch examples::
es: Para ejemplos de PyTorch::

source: For TensorFlow examples::
es: Para ejemplos de TensorFlow::

source: For both PyTorch and TensorFlow examples::
es: Para ejemplos de PyTorch y TensorFlow::

source: Please consult :code:`pyproject.toml` for a full list of possible extras (section :code:`[tool.poetry.extras]`).
es: Consulte :code:`pyproject.toml` para obtener una lista completa de posibles extras (sección :code:`[tool.poetry.extras]`).

source: PyTorch Examples
es: Ejemplos de PyTorch

source: Our PyTorch examples are based on PyTorch 1.7. They should work with other releases as well. So far, we provide the following examples.
es: Nuestros ejemplos de PyTorch se basan en PyTorch 1.7. También deberían funcionar con otras versiones. Hasta ahora, proporcionamos los siguientes ejemplos.

source: CIFAR-10 Image Classification
es: Clasificación de imágenes CIFAR-10

source: `CIFAR-10 and CIFAR-100 <https://www.cs.toronto.edu/~kriz/cifar.html>`_ are popular RGB image datasets. The Flower CIFAR-10 example uses PyTorch to train a simple CNN classifier in a federated learning setup with two clients.
es: `CIFAR-10 y CIFAR-100 <https://www.cs.toronto.edu/~kriz/cifar.html>`_ son conjuntos de datos de imágenes RGB populares. El ejemplo de Flower CIFAR-10 utiliza PyTorch para entrenar un clasificador CNN simple en una configuración de aprendizaje federado con dos clientes.

source: First, start a Flower server:
es: Primero, inicie un servidor Flower:

source: Then, start the two clients in a new terminal window:
es: Luego, inicie los dos clientes en una nueva ventana de terminal:

source: For more details, see :code:`src/py/flwr_example/pytorch_cifar`.
es: Para obtener más detalles, consulte :código:`src/py/flwr_example/pytorch_cifar`.

source: ImageNet-2012 Image Classification
es: Clasificación de imágenes ImageNet-2012

source: `ImageNet-2012 <http://www.image-net.org/>`_ is one of the major computer vision datasets. The Flower ImageNet example uses PyTorch to train a ResNet-18 classifier in a federated learning setup with ten clients.
es: `ImageNet-2012 <http://www.image-net.org/>`_ es uno de los principales conjuntos de datos de visión por computadora. El ejemplo de Flower ImageNet utiliza PyTorch para entrenar un clasificador ResNet-18 en una configuración de aprendizaje federado con diez clientes.

source: For more details, see :code:`src/py/flwr_example/pytorch_imagenet`.
es: Para obtener más detalles, consulte :código:`src/py/flwr_example/pytorch_imagenet`.

source: TensorFlow Examples
es: Ejemplos de TensorFlow

source: Our TensorFlow examples are based on TensorFlow 2.0 or newer. So far, we provide the following examples.
es: Nuestros ejemplos de TensorFlow se basan en TensorFlow 2.0 o posterior. Hasta ahora, proporcionamos los siguientes ejemplos.

source: Fashion-MNIST Image Classification
es: Clasificación de imágenes de Fashion-MNIST

source: `Fashion-MNIST <https://github.com/zalandoresearch/fashion-mnist>`_ is often used as the "Hello, world!" of machine learning. We follow this tradition and provide an example which samples random local datasets from Fashion-MNIST and trains a simple image classification model over those partitions.
es: `Fashion-MNIST <https://github.com/zalandoresearch/fashion-mnist>`_ se utiliza a menudo como "¡Hola, mundo!" del aprendizaje automático. Seguimos esta tradición y proporcionamos un ejemplo que muestra conjuntos de datos locales aleatorios de Fashion-MNIST y entrena un modelo de clasificación de imágenes simple sobre esas particiones.

source: For more details, see :code:`src/py/flwr_example/tensorflow_fashion_mnist`.
es: Para obtener más detalles, consulte :código:`src/py/flwr_example/tensorflow_fashion_mnist`.

source: This page collects answers to commonly asked questions about Federated Learning with Flower.
es: Esta página recopila respuestas a preguntas frecuentes sobre el aprendizaje federado con Flower.

source: :fa:`eye,mr-1` Can Flower run on Juptyter Notebooks / Google Colab?
es: :fa:`eye,mr-1` ¿Se puede ejecutar Flower en Juptyter Notebooks/Google Colab?

source: Yes, it can! Flower even comes with a few under-the-hood optimizations to make it work even better on Colab. Here's a quickstart example:
es: ¡Sí puede! Flower incluso viene con algunas optimizaciones internas para que funcione aún mejor en Colab. A continuación se muestra un ejemplo de inicio rápido:

source: `Flower simulation PyTorch <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-pytorch/sim.ipynb>`_
es: `Simulación de flores PyTorch <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-pytorch/sim.ipynb>`_

source: `Flower simulation TensorFlow/Keras <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-tensorflow/sim.ipynb>`_
es: `Simulación de flores TensorFlow/Keras <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-tensorflow/sim.ipynb>`_

source: :fa:`eye,mr-1` How can I run Federated Learning on a Raspberry Pi?
es: :fa:`eye,mr-1` ¿Cómo puedo ejecutar el aprendizaje federado en una Raspberry Pi?

source: Find the `blog post about federated learning on embedded device here <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_ and the corresponding `GitHub code example <https://github.com/adap/flower/tree/main/examples/embedded-devices>`_.
es: Encuentre la `publicación de blog sobre el aprendizaje federado en dispositivos integrados aquí <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_ y el `ejemplo de código de GitHub correspondiente <https://github.com/adap /flower/tree/main/examples/embedded-devices>`_.

source: :fa:`eye,mr-1` Does Flower support federated learning on Android devices?
es: :fa:`eye,mr-1` ¿Flower admite el aprendizaje federado en dispositivos Android?

source: Yes, it does. Please take a look at our `blog post <https://flower.dev/blog/2021-12-15-federated-learning-on-android-devices-with-flower>`_ or check out the code examples:
es: Sí, lo hace. Eche un vistazo a nuestra `publicación de blog <https://flower.dev/blog/2021-12-15-federated-learning-on-android-devices-with-flower>`_ o consulte los ejemplos de código:

source: `Android Kotlin example <https://flower.dev/docs/examples/android-kotlin.html>`_
es: `Ejemplo de Android Kotlin <https://flower.dev/docs/examples/android-kotlin.html>`_

source: `Android Java example <https://flower.dev/docs/examples/android.html>`_
es: `Ejemplo de Android Java <https://flower.dev/docs/examples/android.html>`_

source: :fa:`eye,mr-1` Can I combine federated learning with blockchain?
es: :fa:`eye,mr-1` ¿Puedo combinar el aprendizaje federado con blockchain?

source: Yes, of course. A list of available examples using Flower within a blockchain environment is available here:
es: Sí, claro. Una lista de ejemplos disponibles que utilizan Flower dentro de un entorno blockchain está disponible aquí:

source: `Flower meets Nevermined GitHub Repository <https://github.com/nevermined-io/fl-demo/tree/master/image-classification-flower>`_.
es: `La flor se encuentra con el repositorio GitHub Nevermined <https://github.com/nevermined-io/fl-demo/tree/master/image-classification-flower>`_.

source: `Flower meets Nevermined YouTube video <https://www.youtube.com/watch?v=A0A9hSlPhKI>`_.
es: `La flor se encuentra con el vídeo de YouTube Nevermined <https://www.youtube.com/watch?v=A0A9hSlPhKI>`_.

source: `Flower meets KOSMoS <https://www.kosmos-bmbf.de/wp-content/uploads/sites/13/2021/05/Talk-Flower-Summit-2021.pdf>`_.
es: `La flor se encuentra con KOSMoS <https://www.kosmos-bmbf.de/wp-content/uploads/sites/13/2021/05/Talk-Flower-Summit-2021.pdf>`_.

source: `Flower meets Talan blog post <https://www.linkedin.com/pulse/federated-learning-same-mask-different-faces-imen-ayari/?trackingId=971oIlxLQ9%2BA9RB0IQ73XQ%3D%3D>`_ .
es: `La flor se encuentra con la publicación del blog de Talan <https://www.linkedin.com/pulse/federated-learning-same-mask- Different-faces-imen-ayari/?trackingId=971oIlxLQ9%2BA9RB0IQ73XQ%3D%3D>`_.

source: `Flower meets Talan GitHub Repository <https://gitlab.com/Talan_Innovation_Factory/food-waste-prevention>`_ .
es: `La flor se encuentra con el repositorio Talan GitHub <https://gitlab.com/Talan_Innovation_Factory/food-waste-prevention>`_.

source: Telemetry
es: Telemetria

source: The Flower open-source project collects **anonymous** usage metrics to make well-informed decisions to improve Flower. Doing this enables the Flower team to understand how Flower is used and what challenges users might face.
es: El proyecto de código abierto Flower recopila métricas de uso **anónimas** para tomar decisiones bien informadas para mejorar Flower. Hacer esto permite al equipo de Flower comprender cómo se utiliza Flower y qué desafíos pueden enfrentar los usuarios.

source: **Flower is a friendly framework for collaborative AI and data science.** Staying true to this statement, Flower makes it easy to disable telemetry for users that do not want to share anonymous usage metrics.
es: **Flower es un marco amigable para la IA colaborativa y la ciencia de datos.** Manteniéndose fiel a esta afirmación, Flower facilita la desactivación de la telemetría para los usuarios que no desean compartir métricas de uso anónimas.

source: Principles
es: Principios

source: We follow strong principles guarding anonymous usage metrics collection:
es: Seguimos principios sólidos que protegen la recopilación de métricas de uso anónimas:

source: **Optional:** You will always be able to disable telemetry; read on to learn “[How to opt-out](#how-to-opt-out)”.
es: **Opcional:** Siempre podrás desactivar la telemetría; Continúe leyendo para aprender “[Cómo darse de baja](#how-to-opt-out)”.

source: **Anonymous:** The reported usage metrics are anonymous and do not contain any personally identifiable information (PII). See “[Collected metrics](#collected-metrics)” to understand what metrics are being reported.
es: **Anónimo:** Las métricas de uso informadas son anónimas y no contienen ninguna información de identificación personal (PII). Consulte “[Métricas recopiladas](#métricas recopiladas)” para comprender qué métricas se informan.

source: **Transparent:** You can easily inspect what anonymous metrics are being reported; see the section “[How to inspect what is being reported](#how-to-inspect-what-is-being-reported)”
es: **Transparente:** Puede inspeccionar fácilmente qué métricas anónimas se informan; consulte la sección “[Cómo inspeccionar lo que se informa](#cómo-inspeccionar-lo-que-se-reporta)”

source: **Open for feedback:** You can always reach out to us if you have feedback; see the section “[How to contact us](#how-to-contact-us)” for details.
es: **Abierto para recibir comentarios:** Siempre puedes comunicarte con nosotros si tienes comentarios; consulte la sección “[Cómo contactarnos](#cómo-contactarnos)” para obtener más detalles.

source: How to opt-out
es: Cómo darse de baja

source: When Flower starts, it will check for an environment variable called `FLWR_TELEMETRY_ENABLED`. Telemetry can easily be disabled by setting `FLWR_TELEMETRY_ENABLED=0`. Assuming you are starting a Flower server or client, simply do so by prepending your command as in:
es: Cuando Flower se inicia, buscará una variable de entorno llamada `FLWR_TELEMETRY_ENABLED`. La telemetría se puede desactivar fácilmente configurando `FLWR_TELEMETRY_ENABLED=0`. Suponiendo que está iniciando un servidor o cliente Flower, simplemente hágalo anteponiendo su comando como en:

source: Alternatively, you can export `FLWR_TELEMETRY_ENABLED=0` in, for example, `.bashrc` (or whatever configuration file applies to your environment) to disable Flower telemetry permanently.
es: Alternativamente, puede exportar `FLWR_TELEMETRY_ENABLED=0` en, por ejemplo, `.bashrc` (o cualquier archivo de configuración que se aplique a su entorno) para desactivar la telemetría de Flower de forma permanente.

source: Collected metrics
es: Métricas recopiladas

source: Flower telemetry collects the following metrics:
es: La telemetría de flores recopila las siguientes métricas:

source: **Flower version.** Understand which versions of Flower are currently being used. This helps us to decide whether we should invest effort into releasing a patch version for an older version of Flower or instead use the bandwidth to build new features.
es: **Versión Flower.** Comprenda qué versiones de Flower se utilizan actualmente. Esto nos ayuda a decidir si debemos invertir esfuerzos en lanzar una versión de parche para una versión anterior de Flower o, en cambio, utilizar el ancho de banda para crear nuevas funciones.

source: **Operating system.** Enables us to answer questions such as: *Should we create more guides for Linux, macOS, or Windows?*
es: **Sistema operativo.** Nos permite responder preguntas como: *¿Deberíamos crear más guías para Linux, macOS o Windows?*

source: **Python version.** Knowing the Python version helps us, for example, to decide whether we should invest effort into supporting old versions of Python or stop supporting them and start taking advantage of new Python features.
es: **Versión de Python.** Conocer la versión de Python nos ayuda, por ejemplo, a decidir si debemos invertir esfuerzos en soportar versiones antiguas de Python o dejar de soportarlas y empezar a aprovechar las nuevas características de Python.

source: **Hardware properties.** Understanding the hardware environment that Flower is being used in helps to decide whether we should, for example, put more effort into supporting low-resource environments.
es: **Propiedades del hardware.** Comprender el entorno de hardware en el que se utiliza Flower ayuda a decidir si deberíamos, por ejemplo, poner más esfuerzo en soportar entornos de bajos recursos.

source: **Execution mode.** Knowing what execution mode Flower starts in enables us to understand how heavily certain features are being used and better prioritize based on that.
es: **Modo de ejecución.** Saber en qué modo de ejecución comienza Flower nos permite comprender en qué medida se utilizan ciertas funciones y priorizar mejor en función de eso.

source: **Cluster.** Flower telemetry assigns a random in-memory cluster ID each time a Flower workload starts. This allows us to understand which device types not only start Flower workloads but also successfully complete them.
es: **Clúster.** La telemetría de Flower asigna una ID de clúster aleatoria en memoria cada vez que se inicia una carga de trabajo de Flower. Esto nos permite comprender qué tipos de dispositivos no solo inician las cargas de trabajo de Flower sino que también las completan con éxito.

source: **Source.** Flower telemetry tries to store a random source ID in `~/.flwr/source` the first time a telemetry event is generated. The source ID is important to identify whether an issue is recurring or whether an issue is triggered by multiple clusters running concurrently (which often happens in simulation). For example, if a device runs multiple workloads at the same time, and this results in an issue, then, in order to reproduce the issue, multiple workloads must be started at the same time.
es: **Fuente.** La telemetría de flores intenta almacenar un ID de fuente aleatorio en `~/.flwr/source` la primera vez que se genera un evento de telemetría. El ID de origen es importante para identificar si un problema es recurrente o si un problema es desencadenado por varios clústeres que se ejecutan simultáneamente (lo que suele ocurrir en la simulación). Por ejemplo, si un dispositivo ejecuta varias cargas de trabajo al mismo tiempo y esto genera un problema, entonces, para reproducir el problema, se deben iniciar varias cargas de trabajo al mismo tiempo.

source: You may delete the source ID at any time. If you wish for all events logged under a specific source ID to be deleted, you can send a deletion request mentioning the source ID to `telemetry@flower.dev`. All events related to that source ID will then be permanently deleted.
es: Puede eliminar la ID de origen en cualquier momento. Si desea que se eliminen todos los eventos registrados con una ID de fuente específica, puede enviar una solicitud de eliminación mencionando la ID de fuente a `telemetry@flower.dev`. Todos los eventos relacionados con esa ID de fuente se eliminarán permanentemente.

source: We will not collect any personally identifiable information. If you think any of the metrics collected could be misused in any way, please [get in touch with us](#how-to-contact-us). We will update this page to reflect any changes to the metrics collected and publish changes in the changelog.
es: No recopilaremos ninguna información de identificación personal. Si cree que alguna de las métricas recopiladas podría usarse indebidamente de alguna manera, [póngase en contacto con nosotros](#how-to-contact-us). Actualizaremos esta página para reflejar cualquier cambio en las métricas recopiladas y publicaremos los cambios en el registro de cambios.

source: If you think other metrics would be helpful for us to better guide our decisions, please let us know! We will carefully review them; if we are confident that they do not compromise user privacy, we may add them.
es: Si cree que otras métricas nos serían útiles para guiar mejor nuestras decisiones, ¡háganoslo saber! Los revisaremos cuidadosamente; Si estamos seguros de que no comprometen la privacidad del usuario, podemos agregarlos.

source: How to inspect what is being reported
es: Cómo inspeccionar lo que se informa

source: We wanted to make it very easy for you to inspect what anonymous usage metrics are reported. You can view all the reported telemetry information by setting the environment variable `FLWR_TELEMETRY_LOGGING=1`. Logging is disabled by default. You may use logging independently from `FLWR_TELEMETRY_ENABLED` so that you can inspect the telemetry feature without sending any metrics.
es: Queríamos que le resultara muy fácil inspeccionar qué métricas de uso anónimas se informan. Puede ver toda la información de telemetría reportada configurando la variable de entorno `FLWR_TELEMETRY_LOGGING=1`. El registro está deshabilitado de forma predeterminada. Puede utilizar el registro independientemente de `FLWR_TELEMETRY_ENABLED` para poder inspeccionar la función de telemetría sin enviar ninguna métrica.

source: The inspect Flower telemetry without sending any anonymous usage metrics, use both environment variables:
es: Para inspeccionar la telemetría de Flower sin enviar ninguna métrica de uso anónima, utilice ambas variables de entorno:

source: How to contact us
es: Cómo contactarnos

source: We want to hear from you. If you have any feedback or ideas on how to improve the way we handle anonymous usage metrics, reach out to us via [Slack](https://flower.dev/join-slack/) (channel `#telemetry`) or email (`telemetry@flower.dev`).
es: Queremos escuchar de ti. Si tiene comentarios o ideas sobre cómo mejorar la forma en que manejamos las métricas de uso anónimas, comuníquese con nosotros a través de [Slack](https://flower.dev/join-slack/) (canal `#telemetry`) o correo electrónico. (`telemetría@flor.dev`).

source: Build a strategy from scratch
es: Construya una estrategia desde cero
