Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Welcome to the third part of the Flower federated learning tutorial. In previous parts of this tutorial, we introduced federated learning with PyTorch and Flower (`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__) and we learned how strategies can be used to customize the execution on both the server and the clients (`part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__).
es: Bienvenido a la tercera parte del tutorial de aprendizaje federado de Flower. En partes anteriores de este tutorial, presentamos el aprendizaje federado con PyTorch y Flower (`parte 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__) y Aprendimos cómo se pueden utilizar estrategias para personalizar la ejecución tanto en el servidor como en los clientes (`parte 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html >`__).

source: In this notebook, we'll continue to customize the federated learning system we built previously by creating a custom version of FedAvg (again, using `Flower <https://flower.dev/>`__ and `PyTorch <https://pytorch.org/>`__).
es: En este cuaderno, continuaremos personalizando el sistema de aprendizaje federado que creamos anteriormente creando una versión personalizada de FedAvg (nuevamente, usando `Flower <https://flower.dev/>`__ y `PyTorch <https:// pytorch.org/>`__).

source: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ and join the Flower community on Slack to connect, ask questions, and get help: `Join Slack <https://flower.dev/join-slack>`__ 🌼 We'd love to hear from you in the ``#introductions`` channel! And if anything is unclear, head over to the ``#questions`` channel.
es: `Star Flower en GitHub <https://github.com/adap/flower>`__ ⭐️ y únete a la comunidad Flower en Slack para conectarte, hacer preguntas y obtener ayuda: `Únete a Slack <https://flower.dev/ join-slack>`__ 🌼 ¡Nos encantaría saber de ti en el canal ``#introductions``! Y si algo no queda claro, dirígete al canal ``#preguntas``.

source: Let's build a new ``Strategy`` from scratch!
es: ¡Construyamos una nueva ``Estrategia`` desde cero!

source: Preparation
es: Preparación

source: Before we begin with the actual code, let's make sure that we have everything we need.
es: Antes de comenzar con el código real, asegurémonos de tener todo lo que necesitamos.

source: Installing dependencies
es: Instalando dependencias

source: First, we install the necessary packages:
es: Primero, instalamos los paquetes necesarios:

source: Now that we have all dependencies installed, we can import everything we need for this tutorial:
es: Ahora que tenemos todas las dependencias instaladas, podemos importar todo lo que necesitamos para este tutorial:

source: It is possible to switch to a runtime that has GPU acceleration enabled (on Google Colab: ``Runtime > Change runtime type > Hardware acclerator: GPU > Save``). Note, however, that Google Colab is not always able to offer GPU acceleration. If you see an error related to GPU availability in one of the following sections, consider switching back to CPU-based execution by setting ``DEVICE = torch.device("cpu")``. If the runtime has GPU acceleration enabled, you should see the output ``Training on cuda``, otherwise it'll say ``Training on cpu``.
es: Es posible cambiar a un tiempo de ejecución que tenga habilitada la aceleración de GPU (en Google Colab: ``Tiempo de ejecución > Cambiar tipo de tiempo de ejecución > Acelerador de hardware: GPU > Guardar``). Sin embargo, tenga en cuenta que Google Colab no siempre puede ofrecer aceleración de GPU. Si ve un error relacionado con la disponibilidad de GPU en una de las siguientes secciones, considere volver a la ejecución basada en CPU configurando ``DEVICE = torch.device("cpu")``. Si el tiempo de ejecución tiene habilitada la aceleración de GPU, debería ver el resultado ``Entrenamiento en cuda``; de lo contrario, dirá ``Entrenamiento en cpu``.

source: Data loading
es: Carga de datos

source: Let's now load the CIFAR-10 training and test set, partition them into ten smaller datasets (each split into training and validation set), and wrap everything in their own ``DataLoader``. We introduce a new parameter ``num_clients`` which allows us to call ``load_datasets`` with different numbers of clients.
es: Ahora carguemos el conjunto de entrenamiento y prueba de CIFAR-10, dividámoslos en diez conjuntos de datos más pequeños (cada uno dividido en conjuntos de entrenamiento y validación) y empaquetemos todo en su propio ``DataLoader``. Introducimos un nuevo parámetro ``num_clients`` que nos permite llamar a ``load_datasets`` con diferentes números de clientes.

source: Model training/evaluation
es: Entrenamiento/evaluación del modelo

source: Let's continue with the usual model definition (including ``set_parameters`` and ``get_parameters``), training and test functions:
es: Continuaremos con la definición habitual del modelo (incluidos ``set_parameters`` y ``get_parameters``), el entrenamiento y las funciones de prueba:

source: Flower client
es: Cliente de flores

source: To implement the Flower client, we (again) create a subclass of ``flwr.client.NumPyClient`` and implement the three methods ``get_parameters``, ``fit``, and ``evaluate``. Here, we also pass the ``cid`` to the client and use it log additional details:
es: Para implementar el cliente Flower, (nuevamente) creamos una subclase de ``flwr.client.NumPyClient`` e implementamos los tres métodos ``get_parameters``, ``fit`` y ``evaluate``. Aquí, también pasamos el ``cid`` al cliente y lo usamos para registrar detalles adicionales:

source: Let's test what we have so far before we continue:
es: Probemos lo que tenemos hasta ahora antes de continuar:

source: Build a Strategy from scratch
es: Construya una estrategia desde cero

source: Let’s overwrite the ``configure_fit`` method such that it passes a higher learning rate (potentially also other hyperparameters) to the optimizer of a fraction of the clients. We will keep the sampling of the clients as it is in ``FedAvg`` and then change the configuration dictionary (one of the ``FitIns`` attributes).
es: Sobrescribamos el método ``configure_fit`` de modo que pase una tasa de aprendizaje más alta (potencialmente también otros hiperparámetros) al optimizador de una fracción de los clientes. Mantendremos el muestreo de los clientes tal como está en ``FedAvg`` y luego cambiaremos el diccionario de configuración (uno de los atributos ``FitIns``).

source: The only thing left is to use the newly created custom Strategy ``FedCustom`` when starting the experiment:
es: Lo único que queda es utilizar la estrategia personalizada recién creada ``FedCustom`` al iniciar el experimento:

source: Recap
es: Resumen

source: In this notebook, we’ve seen how to implement a custom strategy. A custom strategy enables granular control over client node configuration, result aggregation, and more. To define a custom strategy, you only have to overwrite the abstract methods of the (abstract) base class ``Strategy``. To make custom strategies even more powerful, you can pass custom functions to the constructor of your new class (``__init__``) and then call these functions whenever needed.
es: En este cuaderno, hemos visto cómo implementar una estrategia personalizada. Una estrategia personalizada permite un control granular sobre la configuración del nodo cliente, la agregación de resultados y más. Para definir una estrategia personalizada, sólo tiene que sobrescribir los métodos abstractos de la clase base (abstracta) ``Estrategia``. Para hacer que las estrategias personalizadas sean aún más poderosas, puede pasar funciones personalizadas al constructor de su nueva clase (``__init__``) y luego llamar a estas funciones cuando sea necesario.

source: Before you continue, make sure to join the Flower community on Slack: `Join Slack <https://flower.dev/join-slack/>`__
es: Antes de continuar, asegúrese de unirse a la comunidad Flower en Slack: `Únase a Slack <https://flower.dev/join-slack/>`__

source: There's a dedicated ``#questions`` channel if you need help, but we'd also love to hear who you are in ``#introductions``!
es: Hay un canal dedicado a ``#preguntas`` si necesitas ayuda, ¡pero también nos encantaría saber quién eres en ``#introducciones``!

source: The `Flower Federated Learning Tutorial - Part 4 <https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html>`__ introduces ``Client``, the flexible API underlying ``NumPyClient``.
es: El ``Tutorial de aprendizaje federado de Flower - Parte 4 <https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html>`__ presenta ``Client``, la API flexible subyacente a ``NumPyClient ``.

source: Customize the client
es: Personaliza el cliente

source: Welcome to the fourth part of the Flower federated learning tutorial. In the previous parts of this tutorial, we introduced federated learning with PyTorch and Flower (`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__), we learned how strategies can be used to customize the execution on both the server and the clients (`part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__), and we built our own custom strategy from scratch (`part 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__).
es: Bienvenido a la cuarta parte del tutorial de aprendizaje federado de Flower. En las partes anteriores de este tutorial, presentamos el aprendizaje federado con PyTorch y Flower (`parte 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__) , aprendimos cómo se pueden usar estrategias para personalizar la ejecución tanto en el servidor como en los clientes (`parte 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch. html>`__), y creamos nuestra propia estrategia personalizada desde cero (`parte 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__ ).

source: In this notebook, we revisit ``NumPyClient`` and introduce a new baseclass for building clients, simply named ``Client``. In previous parts of this tutorial, we've based our client on ``NumPyClient``, a convenience class which makes it easy to work with machine learning libraries that have good NumPy interoperability. With ``Client``, we gain a lot of flexibility that we didn't have before, but we'll also have to do a few things the we didn't have to do before.
es: En este cuaderno, volvemos a visitar ``NumPyClient`` e introducimos una nueva clase base para crear clientes, llamada simplemente ``Client``. En partes anteriores de este tutorial, basamos nuestro cliente en ``NumPyClient``, una clase conveniente que facilita el trabajo con bibliotecas de aprendizaje automático que tienen una buena interoperabilidad con NumPy. Con ``Cliente``, ganamos mucha flexibilidad que no teníamos antes, pero también tendremos que hacer algunas cosas que no teníamos que hacer antes.

source: Let's go deeper and see what it takes to move from ``NumPyClient`` to ``Client``!
es: ¡Profundicemos y veamos qué se necesita para pasar de ``NumPyClient`` a ``Client``!

source: Step 0: Preparation
es: Paso 0: preparación

source: Let's now load the CIFAR-10 training and test set, partition them into ten smaller datasets (each split into training and validation set), and wrap everything in their own ``DataLoader``.
es: Ahora carguemos el conjunto de entrenamiento y prueba de CIFAR-10, dividámoslos en diez conjuntos de datos más pequeños (cada uno dividido en conjuntos de entrenamiento y validación) y empaquetemos todo en su propio ``DataLoader``.

source: Step 1: Revisiting NumPyClient
es: Paso 1: revisitar NumPyClient

source: So far, we've implemented our client by subclassing ``flwr.client.NumPyClient``. The three methods we implemented are ``get_parameters``, ``fit``, and ``evaluate``. Finally, we wrap the creation of instances of this class in a function called ``client_fn``:
es: Hasta ahora, hemos implementado nuestro cliente subclasificando ``flwr.client.NumPyClient``. Los tres métodos que implementamos son ``get_parameters``, ``fit`` y ``evaluate``. Finalmente, envolvemos la creación de instancias de esta clase en una función llamada ``client_fn``:

source: We've seen this before, there's nothing new so far. The only *tiny* difference compared to the previous notebook is naming, we've changed ``FlowerClient`` to ``FlowerNumPyClient`` and ``client_fn`` to ``numpyclient_fn``. Let's run it to see the output we get:
es: Ya hemos visto esto antes, no hay nada nuevo hasta ahora. La única *pequeña* diferencia en comparación con el cuaderno anterior es el nombre, hemos cambiado ``FlowerClient`` a ``FlowerNumPyClient`` y ``client_fn`` a ``numpyclient_fn``. Ejecutémoslo para ver el resultado que obtenemos:

source: This works as expected, two clients are training for three rounds of federated learning.
es: Esto funciona como se esperaba: dos clientes se están capacitando para tres rondas de aprendizaje federado.

source: Let's dive a little bit deeper and discuss how Flower executes this simulation. Whenever a client is selected to do some work, ``start_simulation`` calls the function ``numpyclient_fn`` to create an instance of our ``FlowerNumPyClient`` (along with loading the model and the data).
es: Profundicemos un poco más y analicemos cómo Flower ejecuta esta simulación. Siempre que se selecciona un cliente para realizar algún trabajo, ``start_simulation`` llama a la función ``numpyclient_fn`` para crear una instancia de nuestro ``FlowerNumPyClient`` (junto con cargar el modelo y los datos).

source: But here's the perhaps surprising part: Flower doesn't actually use the ``FlowerNumPyClient`` object directly. Instead, it wraps the object to makes it look like a subclass of ``flwr.client.Client``, not ``flwr.client.NumPyClient``. In fact, the Flower core framework doesn't know how to handle ``NumPyClient``'s, it only knows how to handle ``Client``'s. ``NumPyClient`` is just a convenience abstraction built on top of ``Client``.
es: Pero aquí está la parte quizás sorprendente: Flower en realidad no usa el objeto ``FlowerNumPyClient`` directamente. En lugar de eso, envuelve el objeto para que parezca una subclase de ``flwr.client.Client``, no ``flwr.client.NumPyClient``. De hecho, el marco central de Flower no sabe cómo manejar ``NumPyClient``, solo sabe cómo manejar ``Client``. ``NumPyClient`` es solo una abstracción de conveniencia construida sobre ``Client``.

source: Instead of building on top of ``NumPyClient``, we can directly build on top of ``Client``.
es: En lugar de construir sobre ``NumPyClient``, podemos construir directamente sobre ``Client``.

source: Step 2: Moving from ``NumPyClient`` to ``Client``
es: Paso 2: Pasar de ``NumPyClient`` a ``Cliente``

source: Let's try to do the same thing using ``Client`` instead of ``NumPyClient``.
es: Intentemos hacer lo mismo usando ``Client`` en lugar de ``NumPyClient``.

source: Before we discuss the code in more detail, let's try to run it! Gotta make sure our new ``Client``-based client works, right?
es: Antes de analizar el código con más detalle, ¡intentemos ejecutarlo! Tenemos que asegurarnos de que nuestro nuevo cliente basado en "Cliente" funcione, ¿verdad?

source: That's it, we're now using ``Client``. It probably looks similar to what we've done with ``NumPyClient``. So what's the difference?
es: Eso es todo, ahora estamos usando ``Cliente``. Probablemente se parezca a lo que hemos hecho con ``NumPyClient``. Entonces, ¿cuál es la diferencia?

source: First of all, it's more code. But why? The difference comes from the fact that ``Client`` expects us to take care of parameter serialization and deserialization. For Flower to be able to send parameters over the network, it eventually needs to turn these parameters into ``bytes``. Turning parameters (e.g., NumPy ``ndarray``'s) into raw bytes is called serialization. Turning raw bytes into something more useful (like NumPy ``ndarray``'s) is called deserialization. Flower needs to do both: it needs to serialize parameters on the server-side and send them to the client, the client needs to deserialize them to use them for local training, and then serialize the updated parameters again to send them back to the server, which (finally!) deserializes them again in order to aggregate them with the updates received from other clients.
es: En primer lugar, es más código. ¿Pero por qué? La diferencia proviene del hecho de que el "Cliente" espera que nos encarguemos de la serialización y deserialización de los parámetros. Para que Flower pueda enviar parámetros a través de la red, eventualmente necesita convertir estos parámetros en ``bytes``. Convertir parámetros (por ejemplo, NumPy ``ndarray``'s) en bytes sin formato se denomina serialización. Convertir bytes sin procesar en algo más útil (como NumPy ``ndarray``'s) se llama deserialización. Flower necesita hacer ambas cosas: necesita serializar los parámetros en el lado del servidor y enviarlos al cliente, el cliente necesita deserializarlos para usarlos para el entrenamiento local y luego serializar los parámetros actualizados nuevamente para enviarlos de regreso al servidor. , que (¡por fin!) los deserializa nuevamente para agregarlos con las actualizaciones recibidas de otros clientes.

source: The only *real* difference between Client and NumPyClient is that NumPyClient takes care of serialization and deserialization for you. It can do so because it expects you to return parameters as NumPy ndarray's, and it knows how to handle these. This makes working with machine learning libraries that have good NumPy support (most of them) a breeze.
es: La única diferencia *real* entre Client y NumPyClient es que NumPyClient se encarga de la serialización y deserialización por usted. Puede hacerlo porque espera que usted devuelva parámetros como los de NumPy ndarray y sabe cómo manejarlos. Esto hace que trabajar con bibliotecas de aprendizaje automático que tienen un buen soporte para NumPy (la mayoría de ellas) sea muy sencillo.

source: In terms of API, there's one major difference: all methods in Client take exactly one argument (e.g., ``FitIns`` in ``Client.fit``) and return exactly one value (e.g., ``FitRes`` in ``Client.fit``). The methods in ``NumPyClient`` on the other hand have multiple arguments (e.g., ``parameters`` and ``config`` in ``NumPyClient.fit``) and multiple return values (e.g., ``parameters``, ``num_example``, and ``metrics`` in ``NumPyClient.fit``) if there are multiple things to handle. These ``*Ins`` and ``*Res`` objects in ``Client`` wrap all the individual values you're used to from ``NumPyClient``.
es: En términos de API, hay una diferencia importante: todos los métodos en Client toman exactamente un argumento (por ejemplo, ``FitIns`` en ``Client.fit``) y devuelven exactamente un valor (por ejemplo, ``FitRes`` en `` `Cliente.fit``). Los métodos en ``NumPyClient``, por otro lado, tienen múltiples argumentos (por ejemplo, ``parameters`` y ``config`` en ``NumPyClient.fit``) y múltiples valores de retorno (por ejemplo, ``parameters`` , ``num_example`` y ``metrics`` en ``NumPyClient.fit``) si hay varias cosas que manejar. Estos objetos ``*Ins`` y ``*Res`` en ``Client`` envuelven todos los valores individuales a los que estás acostumbrado desde ``NumPyClient``.

source: Step 3: Custom serialization
es: Paso 3: serialización personalizada

source: Here we will explore how to implement custom serialization with a simple example.
es: Aquí exploraremos cómo implementar la serialización personalizada con un ejemplo simple.

source: But first what is serialization? Serialization is just the process of converting an object into raw bytes, and equally as important, deserialization is the process of converting raw bytes back into an object. This is very useful for network communication. Indeed, without serialization, you could not just a Python object through the internet.
es: Pero primero ¿qué es la serialización? La serialización es simplemente el proceso de convertir un objeto en bytes sin formato y, igualmente importante, la deserialización es el proceso de convertir bytes sin formato nuevamente en un objeto. Esto es muy útil para la comunicación en red. De hecho, sin serialización, no se podría simplemente un objeto Python a través de Internet.

source: Federated Learning relies heavily on internet communication for training by sending Python objects back and forth between the clients and the server. This means that serialization is an essential part of Federated Learning.
es: El aprendizaje federado depende en gran medida de la comunicación por Internet para la capacitación mediante el envío de objetos Python de un lado a otro entre los clientes y el servidor. Esto significa que la serialización es una parte esencial del aprendizaje federado.

source: In the following section, we will write a basic example where instead of sending a serialized version of our ``ndarray``\ s containing our parameters, we will first convert the ``ndarray`` into sparse matrices, before sending them. This technique can be used to save bandwidth, as in certain cases where the weights of a model are sparse (containing many 0 entries), converting them to a sparse matrix can greatly improve their bytesize.
es: En la siguiente sección, escribiremos un ejemplo básico donde en lugar de enviar una versión serializada de nuestros ``ndarray``\ que contengan nuestros parámetros, primero convertiremos el ``ndarray`` en matrices dispersas, antes de enviarlas. Esta técnica se puede utilizar para ahorrar ancho de banda, ya que en ciertos casos donde los pesos de un modelo son escasos (contienen muchas entradas 0), convertirlos en una matriz dispersa puede mejorar en gran medida su tamaño de bytes.

source: Our custom serialization/deserialization functions
es: Nuestras funciones personalizadas de serialización/deserialización

source: This is where the real serialization/deserialization will happen, especially in ``ndarray_to_sparse_bytes`` for serialization and ``sparse_bytes_to_ndarray`` for deserialization.
es: Aquí es donde ocurrirá la serialización/deserialización real, especialmente en ``ndarray_to_sparse_bytes`` para la serialización y ``sparse_bytes_to_ndarray`` para la deserialización.

source: Note that we imported the ``scipy.sparse`` library in order to convert our arrays.
es: Tenga en cuenta que importamos la biblioteca ``scipy.sparse`` para convertir nuestras matrices.

source: Client-side
es: Lado del cliente

source: To be able to able to serialize our ``ndarray``\ s into sparse parameters, we will just have to call our custom functions in our ``flwr.client.Client``.
es: Para poder serializar nuestros ``ndarray``\ s en parámetros dispersos, sólo tendremos que llamar a nuestras funciones personalizadas en nuestro ``flwr.client.Client``.

source: Indeed, in ``get_parameters`` we need to serialize the parameters we got from our network using our custom ``ndarrays_to_sparse_parameters`` defined above.
es: De hecho, en ``get_parameters`` necesitamos serializar los parámetros que obtuvimos de nuestra red usando nuestros ``ndarrays_to_sparse_parameters`` personalizados definidos anteriormente.
