Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Warning when `min_available_clients` is misconfigured ([#830](https://github.com/adap/flower/pull/830))
es: Advertencia cuando `min_available_clients` está mal configurado ([#830](https://github.com/adap/flower/pull/830))

source: Improved gRPC server docs ([#841](https://github.com/adap/flower/pull/841))
es: Documentos del servidor gRPC mejorados ([#841](https://github.com/adap/flower/pull/841))

source: Improved error message in `NumPyClient` ([#851](https://github.com/adap/flower/pull/851))
es: Mensaje de error mejorado en `NumPyClient` ([#851](https://github.com/adap/flower/pull/851))

source: Improved PyTorch quickstart code example ([#852](https://github.com/adap/flower/pull/852))
es: Ejemplo de código de inicio rápido de PyTorch mejorado ([#852](https://github.com/adap/flower/pull/852))

source: **Disabled final distributed evaluation** ([#800](https://github.com/adap/flower/pull/800))
es: **Evaluación distribuida final deshabilitada** ([#800](https://github.com/adap/flower/pull/800))

source: Prior behaviour was to perform a final round of distributed evaluation on all connected clients, which is often not required (e.g., when using server-side evaluation). The prior behaviour can be enabled by passing `force_final_distributed_eval=True` to `start_server`.
es: El comportamiento anterior era realizar una ronda final de evaluación distribuida en todos los clientes conectados, lo que a menudo no es necesario (por ejemplo, cuando se utiliza la evaluación del lado del servidor). El comportamiento anterior se puede habilitar pasando `force_final_distributed_eval=True` a `start_server`.

source: **Renamed q-FedAvg strategy** ([#802](https://github.com/adap/flower/pull/802))
es: **Renombrada estrategia q-FedAvg** ([#802](https://github.com/adap/flower/pull/802))

source: The strategy named `QffedAvg` was renamed to `QFedAvg` to better reflect the notation given in the original paper (q-FFL is the optimization objective, q-FedAvg is the proposed solver). Note the the original (now deprecated) `QffedAvg` class is still available for compatibility reasons (it will be removed in a future release).
es: La estrategia denominada "QffedAvg" pasó a llamarse "QFedAvg" para reflejar mejor la notación dada en el artículo original (q-FFL es el objetivo de optimización, q-FedAvg es el solucionador propuesto). Tenga en cuenta que la clase `QffedAvg` original (ahora obsoleta) todavía está disponible por razones de compatibilidad (se eliminará en una versión futura).

source: **Deprecated and renamed code example** `simulation_pytorch` **to** `simulation_pytorch_legacy` ([#791](https://github.com/adap/flower/pull/791))
es: **Ejemplo de código obsoleto y renombrado** `simulation_pytorch` **a** `simulation_pytorch_legacy` ([#791](https://github.com/adap/flower/pull/791))

source: This example has been replaced by a new example. The new example is based on the experimental virtual client engine, which will become the new default way of doing most types of large-scale simulations in Flower. The existing example was kept for reference purposes, but it might be removed in the future.
es: Este ejemplo ha sido reemplazado por un nuevo ejemplo. El nuevo ejemplo se basa en el motor de cliente virtual experimental, que se convertirá en la nueva forma predeterminada de realizar la mayoría de los tipos de simulaciones a gran escala en Flower. El ejemplo existente se mantuvo como referencia, pero es posible que se elimine en el futuro.

source: **New built-in strategies** ([#549](https://github.com/adap/flower/pull/549))
es: **Nuevas estrategias integradas** ([#549](https://github.com/adap/flower/pull/549))

source: (abstract) FedOpt
es: (resumen) FedOpt

source: **Custom metrics for server and strategies** ([#717](https://github.com/adap/flower/pull/717))
es: **Métricas personalizadas para servidor y estrategias** ([#717](https://github.com/adap/flower/pull/717))

source: The Flower server is now fully task-agnostic, all remaining instances of task-specific metrics (such as `accuracy`) have been replaced by custom metrics dictionaries. Flower 0.15 introduced the capability to pass a dictionary containing custom metrics from client to server. As of this release, custom metrics replace task-specific metrics on the server.
es: El servidor Flower ahora es totalmente independiente de las tareas; todas las instancias restantes de métricas específicas de tareas (como "precisión") han sido reemplazadas por diccionarios de métricas personalizados. Flower 0.15 introdujo la capacidad de pasar un diccionario que contiene métricas personalizadas del cliente al servidor. A partir de esta versión, las métricas personalizadas reemplazan las métricas específicas de tareas en el servidor.

source: Custom metric dictionaries are now used in two user-facing APIs: they are returned from Strategy methods `aggregate_fit`/`aggregate_evaluate` and they enable evaluation functions passed to build-in strategies (via `eval_fn`) to return more than two evaluation metrics. Strategies can even return *aggregated* metrics dictionaries for the server to keep track of.
es: Los diccionarios de métricas personalizados ahora se utilizan en dos API orientadas al usuario: se devuelven desde los métodos de estrategia `aggregate_fit`/`aggregate_evaluate` y permiten que las funciones de evaluación pasadas a estrategias integradas (a través de `eval_fn`) devuelvan más de dos métricas de evaluación. . Las estrategias pueden incluso devolver diccionarios de métricas *agregadas* para que el servidor realice un seguimiento.

source: Stratey implementations should migrate their `aggregate_fit` and `aggregate_evaluate` methods to the new return type (e.g., by simply returning an empty `{}`), server-side evaluation functions should migrate from `return loss, accuracy` to `return loss, {"accuracy": accuracy}`.
es: Las implementaciones estratégicas deben migrar sus métodos `aggregate_fit` y `aggregate_evaluate` al nuevo tipo de retorno (por ejemplo, simplemente devolviendo un `{}` vacío), las funciones de evaluación del lado del servidor deben migrar de `pérdida de retorno, precisión` a `pérdida de retorno , {"precisión": precisión}`.

source: Flower 0.15-style return types are deprecated (but still supported), compatibility will be removed in a future release.
es: Los tipos de retorno de estilo Flower 0.15 están en desuso (pero aún son compatibles); la compatibilidad se eliminará en una versión futura.

source: **Migration warnings for deprecated functionality** ([#690](https://github.com/adap/flower/pull/690))
es: **Advertencias de migración para funciones obsoletas** ([#690](https://github.com/adap/flower/pull/690))

source: Earlier versions of Flower were often migrated to new APIs, while maintaining compatibility with legacy APIs. This release introduces detailed warning messages if usage of deprecated APIs is detected. The new warning messages often provide details on how to migrate to more recent APIs, thus easing the transition from one release to another.
es: Las versiones anteriores de Flower a menudo se migraban a nuevas API, manteniendo la compatibilidad con las API heredadas. Esta versión presenta mensajes de advertencia detallados si se detecta el uso de API obsoletas. Los nuevos mensajes de advertencia a menudo brindan detalles sobre cómo migrar a API más recientes, facilitando así la transición de una versión a otra.

source: Improved docs and docstrings ([#691](https://github.com/adap/flower/pull/691) [#692](https://github.com/adap/flower/pull/692) [#713](https://github.com/adap/flower/pull/713))
es: Documentos y cadenas de documentos mejorados ([#691](https://github.com/adap/flower/pull/691) [#692](https://github.com/adap/flower/pull/692) [#713 ](https://github.com/adap/flower/pull/713))

source: MXNet example and documentation
es: Ejemplo y documentación de MXNet

source: FedBN implementation in example PyTorch: From Centralized To Federated ([#696](https://github.com/adap/flower/pull/696) [#702](https://github.com/adap/flower/pull/702) [#705](https://github.com/adap/flower/pull/705))
es: Implementación de FedBN en el ejemplo PyTorch: de centralizado a federado ([#696](https://github.com/adap/flower/pull/696) [#702](https://github.com/adap/flower/pull /702) [#705](https://github.com/adap/flower/pull/705))

source: **Serialization-agnostic server** ([#721](https://github.com/adap/flower/pull/721))
es: **Servidor independiente de serialización** ([#721](https://github.com/adap/flower/pull/721))

source: The Flower server is now fully serialization-agnostic. Prior usage of class `Weights` (which represents parameters as deserialized NumPy ndarrays) was replaced by class `Parameters` (e.g., in `Strategy`). `Parameters` objects are fully serialization-agnostic and represents parameters as byte arrays, the `tensor_type` attributes indicates how these byte arrays should be interpreted (e.g., for serialization/deserialization).
es: El servidor Flower ahora es totalmente independiente de la serialización. El uso anterior de la clase "Pesos" (que representa parámetros como ndarrays NumPy deserializados) fue reemplazado por la clase "Parámetros" (por ejemplo, en "Estrategia"). Los objetos `Parameters` son totalmente independientes de la serialización y representan parámetros como matrices de bytes; los atributos `tensor_type` indican cómo se deben interpretar estas matrices de bytes (por ejemplo, para serialización/deserialización).

source: Built-in strategies implement this approach by handling serialization and deserialization to/from `Weights` internally. Custom/3rd-party Strategy implementations should update to the slighly changed Strategy method definitions. Strategy authors can consult PR [#721](https://github.com/adap/flower/pull/721) to see how strategies can easily migrate to the new format.
es: Las estrategias integradas implementan este enfoque manejando la serialización y deserialización hacia/desde "Weights" internamente. Las implementaciones de estrategias personalizadas/de terceros deben actualizarse a las definiciones de métodos de estrategia ligeramente modificadas. Los autores de estrategias pueden consultar PR [#721](https://github.com/adap/flower/pull/721) para ver cómo las estrategias pueden migrar fácilmente al nuevo formato.

source: Deprecated `flwr.server.Server.evaluate`, use `flwr.server.Server.evaluate_round` instead ([#717](https://github.com/adap/flower/pull/717))
es: `flwr.server.Server.evaluate` está en desuso, use `flwr.server.Server.evaluate_round` en su lugar ([#717](https://github.com/adap/flower/pull/717))

source: **Server-side parameter initialization** ([#658](https://github.com/adap/flower/pull/658))
es: **Inicialización de parámetros del lado del servidor** ([#658](https://github.com/adap/flower/pull/658))

source: Model parameters can now be initialized on the server-side. Server-side parameter initialization works via a new `Strategy` method called `initialize_parameters`.
es: Los parámetros del modelo ahora se pueden inicializar en el lado del servidor. La inicialización de parámetros del lado del servidor funciona a través de un nuevo método de "Estrategia" llamado "initialize_parameters".

source: Built-in strategies support a new constructor argument called `initial_parameters` to set the initial parameters. Built-in strategies will provide these initial parameters to the server on startup and then delete them to free the memory afterwards.
es: Las estrategias integradas admiten un nuevo argumento de constructor llamado `initial_parameters` para establecer los parámetros iniciales. Las estrategias integradas proporcionarán estos parámetros iniciales al servidor al inicio y luego los eliminarán para liberar memoria posteriormente.

source: If no initial parameters are provided to the strategy, the server will continue to use the current behaviour (namely, it will ask one of the connected clients for its parameters and use these as the initial global parameters).
es: Si no se proporcionan parámetros iniciales a la estrategia, el servidor continuará usando el comportamiento actual (es decir, solicitará sus parámetros a uno de los clientes conectados y los utilizará como parámetros globales iniciales).

source: Deprecations
es: Depreciaciones

source: Deprecate `flwr.server.strategy.DefaultStrategy` (migrate to `flwr.server.strategy.FedAvg`, which is equivalent)
es: Desaprobar `flwr.server.strategy.DefaultStrategy` (migrar a `flwr.server.strategy.FedAvg`, que es equivalente)

source: **Generalized** `Client.fit` **and** `Client.evaluate` **return values** ([#610](https://github.com/adap/flower/pull/610) [#572](https://github.com/adap/flower/pull/572) [#633](https://github.com/adap/flower/pull/633))
es: **Generalizado** `Client.fit` **y** `Client.evaluate` **valores de retorno** ([#610](https://github.com/adap/flower/pull/610) [# 572](https://github.com/adap/flower/pull/572) [#633](https://github.com/adap/flower/pull/633))

source: Clients can now return an additional dictionary mapping `str` keys to values of the following types: `bool`, `bytes`, `float`, `int`, `str`. This means one can return almost arbitrary values from `fit`/`evaluate` and make use of them on the server side!
es: Los clientes ahora pueden devolver un diccionario adicional que asigna claves `str` a valores de los siguientes tipos: `bool`, `bytes`, `float`, `int`, `str`. ¡Esto significa que uno puede devolver valores casi arbitrarios de `fit`/`evaluate` y utilizarlos en el lado del servidor!

source: This improvement also allowed for more consistent return types between `fit` and `evaluate`: `evaluate` should now return a tuple `(float, int, dict)` representing the loss, number of examples, and a dictionary holding arbitrary problem-specific values like accuracy.
es: Esta mejora también permitió tipos de retorno más consistentes entre "fit" y "evaluate": "evaluate" ahora debería devolver una tupla "(float, int, dict)" que representa la pérdida, el número de ejemplos y un diccionario que contiene problemas arbitrarios. valores específicos como la precisión.

source: In case you wondered: this feature is compatible with existing projects, the additional dictionary return value is optional. New code should however migrate to the new return types to be compatible with upcoming Flower releases (`fit`: `List[np.ndarray], int, Dict[str, Scalar]`, `evaluate`: `float, int, Dict[str, Scalar]`). See the example below for details.
es: En caso de que se lo pregunte: esta función es compatible con proyectos existentes, el valor de retorno del diccionario adicional es opcional. Sin embargo, el nuevo código debería migrar a los nuevos tipos de retorno para que sea compatible con los próximos lanzamientos de Flower (`fit`: `List[np.ndarray], int, Dict[str, Scalar]`, `evaluate`: `float, int, Dict [cadena, escalar]`). Consulte el ejemplo siguiente para obtener más detalles.

source: *Code example:* note the additional dictionary return values in both `FlwrClient.fit` and `FlwrClient.evaluate`:
es: *Ejemplo de código:* tenga en cuenta los valores de retorno del diccionario adicionales tanto en `FlwrClient.fit` como en `FlwrClient.evaluate`:

source: **Generalized** `config` **argument in** `Client.fit` **and** `Client.evaluate` ([#595](https://github.com/adap/flower/pull/595))
es: **Generalizado** `config` **argumento en** `Client.fit` **y** `Client.evaluate` ([#595](https://github.com/adap/flower/pull/595 ))

source: The `config` argument used to be of type `Dict[str, str]`, which means that dictionary values were expected to be strings. The new release generalizes this to enable values of the following types: `bool`, `bytes`, `float`, `int`, `str`.
es: El argumento `config` solía ser del tipo `Dict[str, str]`, lo que significa que se esperaba que los valores del diccionario fueran cadenas. La nueva versión generaliza esto para habilitar valores de los siguientes tipos: `bool`, `bytes`, `float`, `int`, `str`.

source: This means one can now pass almost arbitrary values to `fit`/`evaluate` using the `config` dictionary. Yay, no more `str(epochs)` on the server-side and `int(config["epochs"])` on the client side!
es: Esto significa que ahora se pueden pasar valores casi arbitrarios a `fit`/`evaluate` usando el diccionario `config`. ¡Sí, no más `str(epochs)` en el lado del servidor e `int(config["epochs"])` en el lado del cliente!

source: *Code example:* note that the `config` dictionary now contains non-`str` values in both `Client.fit` and `Client.evaluate`:
es: *Ejemplo de código:* tenga en cuenta que el diccionario `config` ahora contiene valores que no son `str` tanto en `Client.fit` como en `Client.evaluate`:

source: New example: PyTorch From Centralized To Federated ([#549](https://github.com/adap/flower/pull/549))
es: Nuevo ejemplo: PyTorch de centralizado a federado ([#549](https://github.com/adap/flower/pull/549))

source: Improved documentation
es: Documentación mejorada

source: New documentation theme ([#551](https://github.com/adap/flower/pull/551))
es: Nuevo tema de documentación ([#551](https://github.com/adap/flower/pull/551))

source: New API reference ([#554](https://github.com/adap/flower/pull/554))
es: Nueva referencia de API ([#554](https://github.com/adap/flower/pull/554))

source: Updated examples documentation ([#549](https://github.com/adap/flower/pull/549))
es: Documentación de ejemplos actualizada ([#549](https://github.com/adap/flower/pull/549))

source: Removed obsolete documentation ([#548](https://github.com/adap/flower/pull/548))
es: Se eliminó documentación obsoleta ([#548](https://github.com/adap/flower/pull/548))

source: Bugfix:
es: Arreglo del fallo:

source: `Server.fit` does not disconnect clients when finished, disconnecting the clients is now handled in `flwr.server.start_server` ([#553](https://github.com/adap/flower/pull/553) [#540](https://github.com/adap/flower/issues/540)).
es: `Server.fit` no desconecta a los clientes cuando termina, la desconexión de los clientes ahora se maneja en `flwr.server.start_server` ([#553](https://github.com/adap/flower/pull/553) [# 540](https://github.com/adap/flower/issues/540)).

source: Important changes:
es: Cambios importantes:

source: Added an example for embedded devices ([#507](https://github.com/adap/flower/pull/507))
es: Se agregó un ejemplo para dispositivos integrados ([#507](https://github.com/adap/flower/pull/507))

source: Added a new NumPyClient (in addition to the existing KerasClient) ([#504](https://github.com/adap/flower/pull/504) [#508](https://github.com/adap/flower/pull/508))
es: Se agregó un nuevo NumPyClient (además del KerasClient existente) ([#504](https://github.com/adap/flower/pull/504) [#508](https://github.com/adap/flower /tirar/508))

source: Deprecated `flwr_example` package and started to migrate examples into the top-level `examples` directory ([#494](https://github.com/adap/flower/pull/494) [#512](https://github.com/adap/flower/pull/512))
es: Dejé de usar el paquete `flwr_example` y comencé a migrar ejemplos al directorio de nivel superior `examples` ([#494](https://github.com/adap/flower/pull/494) [#512](https:// github.com/adap/flower/pull/512))

source: v0.11.0 (2020-11-30)
es: v0.11.0 (30/11/2020)

source: Incompatible changes:
es: Cambios incompatibles:

source: Renamed strategy methods ([#486](https://github.com/adap/flower/pull/486)) to unify the naming of Flower's public APIs. Other public methods/functions (e.g., every method in `Client`, but also `Strategy.evaluate`) do not use the `on_` prefix, which is why we're removing it from the four methods in Strategy. To migrate rename the following `Strategy` methods accordingly:
es: Métodos de estrategia renombrados ([#486](https://github.com/adap/flower/pull/486)) para unificar el nombre de las API públicas de Flower. Otros métodos/funciones públicos (por ejemplo, todos los métodos en `Client`, pero también `Strategy.evaluate`) no usan el prefijo `on_`, por lo que lo eliminaremos de los cuatro métodos en Strategy. Para migrar, cambie el nombre de los siguientes métodos de "Estrategia" en consecuencia:

source: `on_aggregate_evaluate` => `aggregate_evaluate`
es: `on_aggregate_evaluate` => `agregado_evaluate`

source: Deprecated `DefaultStrategy` ([#479](https://github.com/adap/flower/pull/479)). To migrate use `FedAvg` instead.
es: `DefaultStrategy` en desuso ([#479](https://github.com/adap/flower/pull/479)). Para migrar, utilice `FedAvg` en su lugar.

source: Simplified examples and baselines ([#484](https://github.com/adap/flower/pull/484)).
es: Ejemplos simplificados y líneas de base ([#484](https://github.com/adap/flower/pull/484)).

source: Removed presently unused `on_conclude_round` from strategy interface ([#483](https://github.com/adap/flower/pull/483)).
es: Se eliminó `on_conclude_round` actualmente no utilizado de la interfaz de estrategia ([#483](https://github.com/adap/flower/pull/483)).

source: Set minimal Python version to 3.6.1 instead of 3.6.9 ([#471](https://github.com/adap/flower/pull/471)).
es: Establezca la versión mínima de Python en 3.6.1 en lugar de 3.6.9 ([#471](https://github.com/adap/flower/pull/471)).

source: Improved `Strategy` docstrings ([#470](https://github.com/adap/flower/pull/470)).
es: Cadenas de documentación de "Estrategia" mejoradas ([#470](https://github.com/adap/flower/pull/470)).

source: Example projects
es: Proyectos de ejemplo

source: Flower comes with a number of usage examples. The examples demonstrate how Flower can be used to federate different kinds of existing machine learning pipelines, usually leveraging popular machine learning frameworks such as `PyTorch <https://pytorch.org/>`_ or `TensorFlow <https://www.tensorflow.org/>`_.
es: Flower viene con varios ejemplos de uso. Los ejemplos demuestran cómo se puede utilizar Flower para federar diferentes tipos de canales de aprendizaje automático existentes, generalmente aprovechando marcos de trabajo de aprendizaje automático populares como `PyTorch <https://pytorch.org/>`_ o `TensorFlow <https://www. tensorflow.org/>`_.

source: Flower usage examples used to be bundled with Flower in a package called ``flwr_example``. We are migrating those examples to standalone projects to make them easier to use. All new examples are based in the directory `examples <https://github.com/adap/flower/tree/main/examples>`_.
es: Los ejemplos de uso de Flower solían incluirse con Flower en un paquete llamado ``flwr_example``. Estamos migrando esos ejemplos a proyectos independientes para que sean más fáciles de usar. Todos los ejemplos nuevos se basan en el directorio `examples <https://github.com/adap/flower/tree/main/examples>`_.

source: The following examples are available as standalone projects.
es: Los siguientes ejemplos están disponibles como proyectos independientes.

source: Quickstart TensorFlow/Keras
es: Inicio rápido TensorFlow/Keras

source: The TensorFlow/Keras quickstart example shows CIFAR-10 image classification with MobileNetV2:
es: El ejemplo de inicio rápido de TensorFlow/Keras muestra la clasificación de imágenes CIFAR-10 con MobileNetV2:

source: `Quickstart TensorFlow (Code) <https://github.com/adap/flower/tree/main/examples/quickstart-tensorflow>`_
es: `Inicio rápido de TensorFlow (Código) <https://github.com/adap/flower/tree/main/examples/quickstart-tensorflow>`_

source: `Quickstart TensorFlow (Tutorial) <https://flower.dev/docs/quickstart-tensorflow.html>`_
es: `Inicio rápido de TensorFlow (Tutorial) <https://flower.dev/docs/quickstart-tensorflow.html>`_

source: `Quickstart TensorFlow (Blog Post) <https://flower.dev/blog/2020-12-11-federated-learning-in-less-than-20-lines-of-code>`_
es: `Inicio rápido de TensorFlow (entrada de blog) <https://flower.dev/blog/2020-12-11-federated-learning-in-less-than-20-lines-of-code>`_

source: Quickstart PyTorch
es: Inicio rápido de PyTorch
