Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: **General improvements** ([#1638](https://github.com/adap/flower/pull/1638), [#1634](https://github.com/adap/flower/pull/1634), [#1636](https://github.com/adap/flower/pull/1636), [#1635](https://github.com/adap/flower/pull/1635), [#1633](https://github.com/adap/flower/pull/1633), [#1632](https://github.com/adap/flower/pull/1632), [#1631](https://github.com/adap/flower/pull/1631), [#1630](https://github.com/adap/flower/pull/1630), [#1627](https://github.com/adap/flower/pull/1627), [#1593](https://github.com/adap/flower/pull/1593), [#1616](https://github.com/adap/flower/pull/1616), [#1615](https://github.com/adap/flower/pull/1615), [#1607](https://github.com/adap/flower/pull/1607), [#1609](https://github.com/adap/flower/pull/1609), [#1608](https://github.com/adap/flower/pull/1608), [#1603](https://github.com/adap/flower/pull/1603), [#1590](https://github.com/adap/flower/pull/1590), [#1580](https://github.com/adap/flower/pull/1580), [#1599](https://github.com/adap/flower/pull/1599), [#1600](https://github.com/adap/flower/pull/1600), [#1601](https://github.com/adap/flower/pull/1601), [#1597](https://github.com/adap/flower/pull/1597), [#1595](https://github.com/adap/flower/pull/1595), [#1591](https://github.com/adap/flower/pull/1591), [#1588](https://github.com/adap/flower/pull/1588), [#1589](https://github.com/adap/flower/pull/1589), [#1587](https://github.com/adap/flower/pull/1587), [#1573](https://github.com/adap/flower/pull/1573), [#1581](https://github.com/adap/flower/pull/1581), [#1578](https://github.com/adap/flower/pull/1578), [#1574](https://github.com/adap/flower/pull/1574), [#1572](https://github.com/adap/flower/pull/1572), [#1586](https://github.com/adap/flower/pull/1586))
es: **Mejoras generales** ([#1638](https://github.com/adap/flower/pull/1638), [#1634](https://github.com/adap/flower/pull/1634) , [#1636](https://github.com/adap/flower/pull/1636), [#1635](https://github.com/adap/flower/pull/1635), [#1633]( https://github.com/adap/flower/pull/1633), [#1632](https://github.com/adap/flower/pull/1632), [#1631](https://github. com/adap/flower/pull/1631), [#1630](https://github.com/adap/flower/pull/1630), [#1627](https://github.com/adap/flower/ pull/1627), [#1593](https://github.com/adap/flower/pull/1593), [#1616](https://github.com/adap/flower/pull/1616), [ #1615](https://github.com/adap/flower/pull/1615), [#1607](https://github.com/adap/flower/pull/1607), [#1609](https: //github.com/adap/flower/pull/1609), [#1608](https://github.com/adap/flower/pull/1608), [#1603](https://github.com/ adapta/flower/pull/1603), [#1590](https://github.com/adap/flower/pull/1590), [#1580](https://github.com/adap/flower/pull/ 1580), [#1599](https://github.com/adap/flower/pull/1599), [#1600](https://github.com/adap/flower/pull/1600), [#1601 ](https://github.com/adap/flower/pull/1601), [#1597](https://github.com/adap/flower/pull/1597), [#1595](https:// github.com/adap/flower/pull/1595), [#1591](https://github.com/adap/flower/pull/1591), [#1588](https://github.com/adap/ flor/pull/1588), [#1589](https://github.com/adap/flower/pull/1589), [#1587](https://github.com/adap/flower/pull/1587) , [#1573](https://github.com/adap/flower/pull/1573), [#1581](https://github.com/adap/flower/pull/1581), [#1578]( https://github.com/adap/flower/pull/1578), [#1574](https://github.com/adap/flower/pull/1574), [#1572](https://github. com/adap/flower/pull/1572), [#1586](https://github.com/adap/flower/pull/1586))

source: **Updated documentation** ([#1629](https://github.com/adap/flower/pull/1629), [#1628](https://github.com/adap/flower/pull/1628), [#1620](https://github.com/adap/flower/pull/1620), [#1618](https://github.com/adap/flower/pull/1618), [#1617](https://github.com/adap/flower/pull/1617), [#1613](https://github.com/adap/flower/pull/1613), [#1614](https://github.com/adap/flower/pull/1614))
es: **Documentación actualizada** ([#1629](https://github.com/adap/flower/pull/1629), [#1628](https://github.com/adap/flower/pull/1628) , [#1620](https://github.com/adap/flower/pull/1620), [#1618](https://github.com/adap/flower/pull/1618), [#1617]( https://github.com/adap/flower/pull/1617), [#1613](https://github.com/adap/flower/pull/1613), [#1614](https://github. com/adap/flower/pull/1614))

source: As usual, the documentation has improved quite a bit. It is another step in our effort to make the Flower documentation the best documentation of any project. Stay tuned and as always, feel free to provide feedback!
es: Como es habitual, la documentación ha mejorado bastante. Es un paso más en nuestro esfuerzo por hacer de la documentación de Flower la mejor documentación de cualquier proyecto. ¡Estén atentos y, como siempre, no duden en enviarnos sus comentarios!

source: **Introduce new Flower Baseline: FedAvg MNIST** ([#1497](https://github.com/adap/flower/pull/1497), [#1552](https://github.com/adap/flower/pull/1552))
es: **Presentar una nueva línea base de flores: FedAvg MNIST** ([#1497](https://github.com/adap/flower/pull/1497), [#1552](https://github.com/adap/flower /pull/1552))

source: Over the coming weeks, we will be releasing a number of new reference implementations useful especially to FL newcomers. They will typically revisit well known papers from the literature, and be suitable for integration in your own application or for experimentation, in order to deepen your knowledge of FL in general. Today's release is the first in this series. [Read more.](https://flower.dev/blog/2023-01-12-fl-starter-pack-fedavg-mnist-cnn/)
es: En las próximas semanas, lanzaremos una serie de nuevas implementaciones de referencia útiles especialmente para los recién llegados a FL. Por lo general, revisarán artículos conocidos de la literatura y serán adecuados para integrarlos en su propia aplicación o para experimentar, con el fin de profundizar su conocimiento de FL en general. El lanzamiento de hoy es el primero de esta serie. [Leer más.](https://flower.dev/blog/2023-01-12-fl-starter-pack-fedavg-mnist-cnn/)

source: **Improve GPU support in simulations** ([#1555](https://github.com/adap/flower/pull/1555))
es: **Mejorar la compatibilidad con GPU en simulaciones** ([#1555](https://github.com/adap/flower/pull/1555))

source: The Ray-based Virtual Client Engine (`start_simulation`) has been updated to improve GPU support. The update includes some of the hard-earned lessons from scaling simulations in GPU cluster environments. New defaults make running GPU-based simulations substantially more robust.
es: El motor de cliente virtual basado en Ray ("start_simulation") se ha actualizado para mejorar la compatibilidad con GPU. La actualización incluye algunas de las lecciones aprendidas con tanto esfuerzo a partir de simulaciones de escalado en entornos de clústeres de GPU. Los nuevos valores predeterminados hacen que la ejecución de simulaciones basadas en GPU sea sustancialmente más sólida.

source: **Improve GPU support in Jupyter Notebook tutorials** ([#1527](https://github.com/adap/flower/pull/1527), [#1558](https://github.com/adap/flower/pull/1558))
es: **Mejore la compatibilidad con GPU en los tutoriales de Jupyter Notebook** ([#1527](https://github.com/adap/flower/pull/1527), [#1558](https://github.com/adap/flower /pull/1558))

source: Some users reported that Jupyter Notebooks have not always been easy to use on GPU instances. We listened and made improvements to all of our Jupyter notebooks! Check out the updated notebooks here:
es: Algunos usuarios informaron que los Jupyter Notebooks no siempre han sido fáciles de usar en instancias de GPU. ¡Escuchamos e hicimos mejoras en todos nuestros cuadernos Jupyter! Consulte los cuadernos actualizados aquí:

source: [An Introduction to Federated Learning](https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html)
es: [Introducción al aprendizaje federado](https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html)

source: [Strategies in Federated Learning](https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html)
es: [Estrategias de aprendizaje federado](https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html)

source: [Building a Strategy](https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html)
es: [Construyendo una estrategia](https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html)

source: [Client and NumPyClient](https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html)
es: [Cliente y NumPyClient](https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html)

source: **Introduce optional telemetry** ([#1533](https://github.com/adap/flower/pull/1533), [#1544](https://github.com/adap/flower/pull/1544), [#1584](https://github.com/adap/flower/pull/1584))
es: **Introducir telemetría opcional** ([#1533](https://github.com/adap/flower/pull/1533), [#1544](https://github.com/adap/flower/pull/1544 ), [#1584](https://github.com/adap/flower/pull/1584))

source: After a [request for feedback](https://github.com/adap/flower/issues/1534) from the community, the Flower open-source project introduces optional collection of *anonymous* usage metrics to make well-informed decisions to improve Flower. Doing this enables the Flower team to understand how Flower is used and what challenges users might face.
es: Después de una [solicitud de comentarios](https://github.com/adap/flower/issues/1534) de la comunidad, el proyecto de código abierto Flower introduce una colección opcional de métricas de uso *anónimas* para tomar decisiones bien informadas para mejorar Flor. Hacer esto permite al equipo de Flower comprender cómo se utiliza Flower y qué desafíos pueden enfrentar los usuarios.

source: **Flower is a friendly framework for collaborative AI and data science.** Staying true to this statement, Flower makes it easy to disable telemetry for users that do not want to share anonymous usage metrics. [Read more.](https://flower.dev/docs/telemetry.html).
es: **Flower es un marco amigable para la IA colaborativa y la ciencia de datos.** Manteniéndose fiel a esta afirmación, Flower facilita la desactivación de la telemetría para los usuarios que no desean compartir métricas de uso anónimas. [Leer más.](https://flower.dev/docs/telemetry.html).

source: **Introduce (experimental) Driver API** ([#1520](https://github.com/adap/flower/pull/1520), [#1525](https://github.com/adap/flower/pull/1525), [#1545](https://github.com/adap/flower/pull/1545), [#1546](https://github.com/adap/flower/pull/1546), [#1550](https://github.com/adap/flower/pull/1550), [#1551](https://github.com/adap/flower/pull/1551), [#1567](https://github.com/adap/flower/pull/1567))
es: **Introducir API de controlador (experimental)** ([#1520](https://github.com/adap/flower/pull/1520), [#1525](https://github.com/adap/flower/ pull/1525), [#1545](https://github.com/adap/flower/pull/1545), [#1546](https://github.com/adap/flower/pull/1546), [ #1550](https://github.com/adap/flower/pull/1550), [#1551](https://github.com/adap/flower/pull/1551), [#1567](https: //github.com/adap/flower/pull/1567))

source: Flower now has a new (experimental) Driver API which will enable fully programmable, async, and multi-tenant Federated Learning and Federated Analytics applications. Phew, that's a lot! Going forward, the Driver API will be the abstraction that many upcoming features will be built on - and you can start building those things now, too.
es: Flower ahora tiene una nueva API de controlador (experimental) que permitirá aplicaciones de aprendizaje federado y análisis federado totalmente programables, asíncronas y multiinquilino. ¡Uf, eso es mucho! En el futuro, Driver API será la abstracción sobre la que se construirán muchas funciones futuras, y usted también puede comenzar a crear esas cosas ahora.

source: The Driver API also enables a new execution mode in which the server runs indefinitely. Multiple individual workloads can run concurrently and start and stop their execution independent of the server. This is especially useful for users who want to deploy Flower in production.
es: La API del controlador también habilita un nuevo modo de ejecución en el que el servidor se ejecuta indefinidamente. Se pueden ejecutar varias cargas de trabajo individuales al mismo tiempo e iniciar y detener su ejecución independientemente del servidor. Esto es especialmente útil para usuarios que desean implementar Flower en producción.

source: To learn more, check out the `mt-pytorch` code example. We look forward to you feedback!
es: Para obtener más información, consulte el ejemplo de código `mt-pytorch`. ¡Esperamos sus comentarios!

source: Please note: *The Driver API is still experimental and will likely change significantly over time.*
es: Tenga en cuenta: *La API del controlador aún es experimental y probablemente cambiará significativamente con el tiempo.*

source: **Add new Federated Analytics with Pandas example** ([#1469](https://github.com/adap/flower/pull/1469), [#1535](https://github.com/adap/flower/pull/1535))
es: **Agregar nuevo ejemplo de Federated Analytics with Pandas** ([#1469](https://github.com/adap/flower/pull/1469), [#1535](https://github.com/adap/flower /pull/1535))

source: A new code example (`quickstart_pandas`) demonstrates federated analytics with Pandas and Flower. You can find it here: [quickstart_pandas](https://github.com/adap/flower/tree/main/examples/quickstart_pandas).
es: Un nuevo ejemplo de código (`quickstart_pandas`) demuestra análisis federados con Pandas y Flower. Puede encontrarlo aquí: [quickstart_pandas](https://github.com/adap/flower/tree/main/examples/quickstart_pandas).

source: **Add new strategies: Krum and MultiKrum** ([#1481](https://github.com/adap/flower/pull/1481))
es: **Agregar nuevas estrategias: Krum y MultiKrum** ([#1481](https://github.com/adap/flower/pull/1481))

source: Edoardo, a computer science student at the Sapienza University of Rome, contributed a new `Krum` strategy that enables users to easily use Krum and MultiKrum in their workloads.
es: Edoardo, estudiante de informática en la Universidad Sapienza de Roma, contribuyó con una nueva estrategia "Krum" que permite a los usuarios utilizar fácilmente Krum y MultiKrum en sus cargas de trabajo.

source: **Update C++ example to be compatible with Flower v1.2.0** ([#1495](https://github.com/adap/flower/pull/1495))
es: **Actualice el ejemplo de C++ para que sea compatible con Flower v1.2.0** ([#1495](https://github.com/adap/flower/pull/1495))

source: The C++ code example has received a substantial update to make it compatible with the latest version of Flower.
es: El ejemplo de código C++ ha recibido una actualización sustancial para hacerlo compatible con la última versión de Flower.

source: **General improvements** ([#1491](https://github.com/adap/flower/pull/1491), [#1504](https://github.com/adap/flower/pull/1504), [#1506](https://github.com/adap/flower/pull/1506), [#1514](https://github.com/adap/flower/pull/1514), [#1522](https://github.com/adap/flower/pull/1522), [#1523](https://github.com/adap/flower/pull/1523), [#1526](https://github.com/adap/flower/pull/1526), [#1528](https://github.com/adap/flower/pull/1528), [#1547](https://github.com/adap/flower/pull/1547), [#1549](https://github.com/adap/flower/pull/1549), [#1560](https://github.com/adap/flower/pull/1560), [#1564](https://github.com/adap/flower/pull/1564), [#1566](https://github.com/adap/flower/pull/1566))
es: **Mejoras generales** ([#1491](https://github.com/adap/flower/pull/1491), [#1504](https://github.com/adap/flower/pull/1504) , [#1506](https://github.com/adap/flower/pull/1506), [#1514](https://github.com/adap/flower/pull/1514), [#1522]( https://github.com/adap/flower/pull/1522), [#1523](https://github.com/adap/flower/pull/1523), [#1526](https://github. com/adap/flower/pull/1526), [#1528](https://github.com/adap/flower/pull/1528), [#1547](https://github.com/adap/flower/ pull/1547), [#1549](https://github.com/adap/flower/pull/1549), [#1560](https://github.com/adap/flower/pull/1560), [ #1564](https://github.com/adap/flower/pull/1564), [#1566](https://github.com/adap/flower/pull/1566))

source: **Updated documentation** ([#1494](https://github.com/adap/flower/pull/1494), [#1496](https://github.com/adap/flower/pull/1496), [#1500](https://github.com/adap/flower/pull/1500), [#1503](https://github.com/adap/flower/pull/1503), [#1505](https://github.com/adap/flower/pull/1505), [#1524](https://github.com/adap/flower/pull/1524), [#1518](https://github.com/adap/flower/pull/1518), [#1519](https://github.com/adap/flower/pull/1519), [#1515](https://github.com/adap/flower/pull/1515))
es: **Documentación actualizada** ([#1494](https://github.com/adap/flower/pull/1494), [#1496](https://github.com/adap/flower/pull/1496) , [#1500](https://github.com/adap/flower/pull/1500), [#1503](https://github.com/adap/flower/pull/1503), [#1505]( https://github.com/adap/flower/pull/1505), [#1524](https://github.com/adap/flower/pull/1524), [#1518](https://github. com/adap/flower/pull/1518), [#1519](https://github.com/adap/flower/pull/1519), [#1515](https://github.com/adap/flower/ tirar/1515))

source: One highlight is the new [first time contributor guide](https://flower.dev/docs/first-time-contributors.html): if you've never contributed on GitHub before, this is the perfect place to start!
es: Lo más destacado es la nueva [guía para contribuyentes por primera vez](https://flower.dev/docs/first-time-contributors.html): si nunca antes has contribuido en GitHub, ¡este es el lugar perfecto para comenzar!

source: We would like to give our **special thanks** to all the contributors who made the new version of Flower possible (in `git shortlog` order):
es: Nos gustaría dar nuestro **agradecimiento especial** a todos los contribuyentes que hicieron posible la nueva versión de Flower (en orden `git shortlog`):

source: **Introduce Differential Privacy wrappers (preview)** ([#1357](https://github.com/adap/flower/pull/1357), [#1460](https://github.com/adap/flower/pull/1460))
es: **Introducir contenedores de privacidad diferencial (vista previa)** ([#1357](https://github.com/adap/flower/pull/1357), [#1460](https://github.com/adap/flower /pull/1460))

source: The first (experimental) preview of pluggable Differential Privacy wrappers enables easy configuration and usage of differential privacy (DP). The pluggable DP wrappers enable framework-agnostic **and** strategy-agnostic usage of both client-side DP and server-side DP. Head over to the Flower docs, a new explainer goes into more detail.
es: La primera vista previa (experimental) de contenedores de privacidad diferencial conectables permite una fácil configuración y uso de la privacidad diferencial (DP). Los contenedores de DP conectables permiten el uso independiente del marco ** y ** de la estrategia tanto del DP del lado del cliente como del DP del lado del servidor. Dirígete a los documentos de Flower, una nueva explicación entra en más detalles.

source: **New iOS CoreML code example** ([#1289](https://github.com/adap/flower/pull/1289))
es: **Nuevo ejemplo de código iOS CoreML** ([#1289](https://github.com/adap/flower/pull/1289))

source: Flower goes iOS! A massive new code example shows how Flower clients can be built for iOS. The code example contains both Flower iOS SDK components that can be used for many tasks, and one task example running on CoreML.
es: ¡Flor se vuelve iOS! Un nuevo ejemplo de código enorme muestra cómo se pueden crear clientes Flower para iOS. El ejemplo de código contiene componentes Flower iOS SDK que se pueden usar para muchas tareas y un ejemplo de tarea que se ejecuta en CoreML.

source: **New FedMedian strategy** ([#1461](https://github.com/adap/flower/pull/1461))
es: **Nueva estrategia FedMedian** ([#1461](https://github.com/adap/flower/pull/1461))

source: The new `FedMedian` strategy implements Federated Median (FedMedian) by [Yin et al., 2018](https://arxiv.org/pdf/1803.01498v1.pdf).
es: La nueva estrategia "FedMedian" implementa la Mediana Federada (FedMedian) por [Yin et al., 2018](https://arxiv.org/pdf/1803.01498v1.pdf).

source: **Log** `Client` **exceptions in Virtual Client Engine** ([#1493](https://github.com/adap/flower/pull/1493))
es: **Registro** `Cliente` **excepciones en Virtual Client Engine** ([#1493](https://github.com/adap/flower/pull/1493))

source: All `Client` exceptions happening in the VCE are now logged by default and not just exposed to the configured `Strategy` (via the `failures` argument).
es: Todas las excepciones del "Cliente" que ocurren en VCE ahora se registran de forma predeterminada y no solo se exponen a la "Estrategia" configurada (a través del argumento "fallos").

source: **Improve Virtual Client Engine internals** ([#1401](https://github.com/adap/flower/pull/1401), [#1453](https://github.com/adap/flower/pull/1453))
es: **Mejorar los aspectos internos del Virtual Client Engine** ([#1401](https://github.com/adap/flower/pull/1401), [#1453](https://github.com/adap/flower/pull /1453))

source: Some internals of the Virtual Client Engine have been revamped. The VCE now uses Ray 2.0 under the hood, the value type of the `client_resources` dictionary changed to `float` to allow fractions of resources to be allocated.
es: Se han renovado algunas partes internas del Virtual Client Engine. VCE ahora usa Ray 2.0 internamente, el tipo de valor del diccionario `client_resources` cambió a `float` para permitir que se asignen fracciones de recursos.

source: **Support optional** `Client`**/**`NumPyClient` **methods in Virtual Client Engine**
es: **Soporte opcional** `Client`**/**`NumPyClient` **métodos en Virtual Client Engine**

source: The Virtual Client Engine now has full support for optional `Client` (and `NumPyClient`) methods.
es: Virtual Client Engine ahora tiene soporte completo para los métodos opcionales `Client` (y `NumPyClient`).

source: **Provide type information to packages using** `flwr` ([#1377](https://github.com/adap/flower/pull/1377))
es: **Proporcione información de tipo a los paquetes usando** `flwr` ([#1377](https://github.com/adap/flower/pull/1377))

source: The package `flwr` is now bundled with a `py.typed` file indicating that the package is typed. This enables typing support for projects or packages that use `flwr` by enabling them to improve their code using static type checkers like `mypy`.
es: El paquete `flwr` ahora incluye un archivo `py.typed` que indica que el paquete está escrito. Esto permite escribir soporte para proyectos o paquetes que usan `flwr` al permitirles mejorar su código usando verificadores de tipo estático como `mypy`.

source: **Updated code example** ([#1344](https://github.com/adap/flower/pull/1344), [#1347](https://github.com/adap/flower/pull/1347))
es: **Ejemplo de código actualizado** ([#1344](https://github.com/adap/flower/pull/1344), [#1347](https://github.com/adap/flower/pull/1347 ))

source: The code examples covering scikit-learn and PyTorch Lightning have been updated to work with the latest version of Flower.
es: Los ejemplos de código que cubren scikit-learn y PyTorch Lightning se han actualizado para que funcionen con la última versión de Flower.
