Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: If you open a new terminal you can activate the previously created virtual environment with the following command:
es: Si abres una nueva terminal podrás activar el entorno virtual creado previamente con el siguiente comando:

source: Virtualenv with Anaconda
es: Virtualenv con Anaconda

source: If you prefer to use Anaconda for your virtual environment then install and setup the `conda <https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html>`_ package. After setting it up you can create a virtual environment with:
es: Si prefiere utilizar Anaconda para su entorno virtual, instale y configure el paquete `conda <https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html>`_. Después de configurarlo puedes crear un entorno virtual con:

source: and activate the virtual environment with:
es: y activar el entorno virtual con:

source: And then?
es: ¿Y luego?

source: As soon as you created your virtual environment you clone one of the `Flower examples <https://github.com/adap/flower/tree/main/examples/>`_.
es: Tan pronto como creó su entorno virtual, clonó uno de los `Ejemplos de flores <https://github.com/adap/flower/tree/main/examples/>`_.

source: Write documentation
es: Escribir documentación

source: Project layout
es: Diseño del proyecto

source: The Flower documentation lives in the ``doc`` directory. The Sphinx-based documentation system supports both reStructuredText (``.rst`` files) and Markdown (``.md`` files).
es: La documentación de Flower se encuentra en el directorio ``doc``. El sistema de documentación basado en Sphinx admite tanto reStructuredText (archivos ``.rst``) como Markdown (archivos ``.md``).

source: Note that, in order to build the documentation locally (with ``poetry run make html``, like described below), `Pandoc <https://pandoc.org/installing.html>_` needs to be installed on the system.
es: Tenga en cuenta que, para crear la documentación localmente (con ``poetry run make html``, como se describe a continuación), es necesario instalar `Pandoc <https://pandoc.org/installing.html>_` en el sistema. .

source: Edit an existing page
es: Editar una página existente

source: Edit an existing ``.rst`` (or ``.md``) file under ``doc/source/``
es: Edite un archivo ``.rst`` (o ``.md``) existente en ``doc/source/``

source: Compile the docs: ``cd doc``, then ``poetry run make html``
es: Compile los documentos: ``cd doc``, luego ``poetry run make html``

source: Open ``doc/build/html/index.html`` in the browser to check the result
es: Abra ``doc/build/html/index.html`` en el navegador para comprobar el resultado.

source: Create a new page
es: Crear una nueva página

source: Add new ``.rst`` file under ``doc/source/``
es: Agregue un nuevo archivo ``.rst`` en ``doc/source/``

source: Add content to the new ``.rst`` file
es: Agregue contenido al nuevo archivo ``.rst``

source: Link to the new rst from ``index.rst``
es: Enlace al nuevo primero desde ``index.rst``

source: Good first contributions
es: Buenos primeros aportes

source: We welcome contributions to Flower! However, it is not always easy to know where to start. We therefore put together a few recommendations on where to start to increase your chances of getting your PR accepted into the Flower codebase.
es: ¡Agradecemos las contribuciones a Flower! Sin embargo, no siempre es fácil saber por dónde empezar. Por lo tanto, reunimos algunas recomendaciones sobre por dónde empezar para aumentar sus posibilidades de que su PR sea aceptado en el código base de Flower.

source: Where to start
es: Donde empezar

source: Until the Flower core library matures it will be easier to get PR's accepted if they only touch non-core areas of the codebase. Good candidates to get started are:
es: Hasta que la biblioteca central de Flower madure, será más fácil lograr que se acepten las relaciones públicas si solo tocan áreas no centrales del código base. Buenos candidatos para empezar son:

source: Documentation: What's missing? What could be expressed more clearly?
es: Documentación: ¿Qué falta? ¿Qué se podría expresar más claramente?

source: Baselines: See below.
es: Líneas de base: ver más abajo.

source: Examples: See below.
es: Ejemplos: ver más abajo.

source: Request for Flower Baselines
es: Solicitud de líneas base de flores

source: If you are not familiar with Flower Baselines, you should probably check-out our `contributing guide for baselines <https://flower.dev/docs/contributing-baselines.html>`_.
es: Si no está familiarizado con Flower Baselines, probablemente debería consultar nuestra `guía de contribución para líneas base <https://flower.dev/docs/contributing-baselines.html>`_.

source: You should then check out the open `issues <https://github.com/adap/flower/issues?q=is%3Aopen+is%3Aissue+label%3A%22new+baseline%22>`_ for baseline requests. If you find a baseline that you'd like to work on and that has no assignes, feel free to assign it to yourself and start working on it!
es: Luego, debe consultar los `problemas abiertos <https://github.com/adap/flower/issues?q=is%3Aopen+is%3Aissue+label%3A%22new+baseline%22>`_ para conocer las solicitudes de referencia. Si encuentra una línea de base en la que le gustaría trabajar y que no tiene asignaciones, ¡no dude en asignársela usted mismo y comenzar a trabajar en ella!

source: Otherwise, if you don't find a baseline you'd like to work on, be sure to open a new issue with the baseline request template!
es: De lo contrario, si no encuentra una línea de base en la que le gustaría trabajar, asegúrese de abrir una nueva edición con la plantilla de solicitud de línea de base.

source: Request for examples
es: Solicitud de ejemplos

source: We wish we had more time to write usage examples because we believe they help users to get started with building what they want to build. Here are a few ideas where we'd be happy to accept a PR:
es: Deseamos tener más tiempo para escribir ejemplos de uso porque creemos que ayudan a los usuarios a comenzar a crear lo que quieren. Aquí hay algunas ideas en las que estaremos encantados de aceptar un PR:

source: Llama 2 fine-tuning, with Hugging Face Transformers and PyTorch
es: Ajuste de Llama 2, con Hugging Face Transformers y PyTorch

source: Android ONNX on-device training
es: Capacitación en el dispositivo Android ONNX

source: Secure Aggregation Protocols
es: Protocolos de agregación seguros

source: Include SecAgg, SecAgg+, and LightSecAgg protocol. The LightSecAgg protocol has not been implemented yet, so its diagram and abstraction may not be accurate in practice. The SecAgg protocol can be considered as a special case of the SecAgg+ protocol.
es: Incluye los protocolos SecAgg, SecAgg+ y LightSecAgg. El protocolo LightSecAgg aún no se ha implementado, por lo que su diagrama y abstracción pueden no ser precisos en la práctica. El protocolo SecAgg puede considerarse como un caso especial del protocolo SecAgg+.

source: The :code:`SecAgg+` abstraction
es: La abstracción :code:`SecAgg+`

source: In this implementation, each client will be assigned with a unique index (int) for secure aggregation, and thus many python dictionaries used have keys of int type rather than ClientProxy type.
es: En esta implementación, a cada cliente se le asignará un índice único (int) para una agregación segura y, por lo tanto, muchos diccionarios de Python utilizados tienen claves de tipo int en lugar de tipo ClientProxy.

source: The Flower server will execute and process received results in the following order:
es: El servidor Flower ejecutará y procesará los resultados recibidos en el siguiente orden:

source: The :code:`LightSecAgg` abstraction
es: La abstracción :code:`LightSecAgg`

source: Types
es: Tipos

source: Contribute on GitHub
es: Contribuir en GitHub

source: This guide is for people who want to get involved with Flower, but who are not used to contributing to GitHub projects.
es: Esta guía es para personas que quieren involucrarse con Flower, pero que no están acostumbradas a contribuir en proyectos de GitHub.

source: If you're familiar with how contributing on GitHub works, you can directly checkout our `getting started guide for contributors <https://flower.dev/docs/getting-started-for-contributors.html>`_ and examples of `good first contributions <https://flower.dev/docs/good-first-contributions.html>`_.
es: Si está familiarizado con cómo funciona la contribución en GitHub, puede consultar directamente nuestra `guía de introducción para colaboradores <https://flower.dev/docs/getting-started-for-contributors.html>`_ y ejemplos de ` buenas primeras contribuciones <https://flower.dev/docs/good-first-contributions.html>`_.

source: Setting up the repository
es: Configurando el repositorio

source: **Create a GitHub account and setup Git**
es: **Crea una cuenta de GitHub y configura Git**

source: Git is a distributed version control tool. This allows for an entire codebase's history to be stored and every developer's machine. It is a software that will need to be installed on your local machine, you can follow this `guide <https://docs.github.com/en/get-started/quickstart/set-up-git>`_ to set it up.
es: Git es una herramienta de control de versiones distribuida. Esto permite almacenar el historial completo de una base de código y la máquina de cada desarrollador. Es un software que deberá instalarse en su máquina local. Puede seguir esta `guía <https://docs.github.com/en/get-started/quickstart/set-up-git>`_ para configurar arriba.

source: GitHub, itself, is a code hosting platform for version control and collaboration. It allows for everyone to collaborate and work from anywhere on remote repositories.
es: GitHub, en sí mismo, es una plataforma de alojamiento de código para control de versiones y colaboración. Permite que todos colaboren y trabajen desde cualquier lugar en repositorios remotos.

source: If you haven't already, you will need to create an account on `GitHub <https://github.com/signup>`_.
es: Si aún no lo ha hecho, deberá crear una cuenta en `GitHub <https://github.com/signup>`_.

source: The idea behind the generic Git and GitHub workflow boils down to this: you download code from a remote repository on GitHub, make changes locally and keep track of them using Git and then you upload your new history back to GitHub.
es: La idea detrás del flujo de trabajo genérico de Git y GitHub se reduce a esto: descargas el código de un repositorio remoto en GitHub, realizas cambios localmente y realizas un seguimiento de ellos usando Git y luego cargas tu nuevo historial nuevamente en GitHub.

source: **Forking the Flower repository**
es: **Bifurcando el repositorio de flores**

source: A fork is a personal copy of a GitHub repository. To create one for Flower, you must navigate to https://github.com/adap/flower (while connected to your GitHub account) and click the ``Fork`` button situated on the top right of the page.
es: Una bifurcación es una copia personal de un repositorio de GitHub. Para crear uno para Flower, debe navegar a https://github.com/adap/flower (mientras está conectado a su cuenta de GitHub) y hacer clic en el botón ``Fork`` situado en la parte superior derecha de la página.

source: You can change the name if you want, but this is not necessary as this version of Flower will be yours and will sit inside your own account (i.e., in your own list of repositories). Once created, you should see on the top left corner that you are looking at your own version of Flower.
es: Puede cambiar el nombre si lo desea, pero esto no es necesario ya que esta versión de Flower será suya y se ubicará dentro de su propia cuenta (es decir, en su propia lista de repositorios). Una vez creado, deberías ver en la esquina superior izquierda que estás viendo tu propia versión de Flower.

source: **Cloning your forked repository**
es: **Clonando tu repositorio bifurcado**

source: The next step is to download the forked repository on your machine to be able to make changes to it. On your forked repository page, you should first click on the ``Code`` button on the right, this will give you the ability to copy the HTTPS link of the repository.
es: El siguiente paso es descargar el repositorio bifurcado en su máquina para poder realizar cambios en él. En la página de su repositorio bifurcado, primero debe hacer clic en el botón ``Código`` a la derecha, esto le permitirá copiar el enlace HTTPS del repositorio.

source: Once you copied the \<URL\>, you can open a terminal on your machine, navigate to the place you want to download the repository to and type:
es: Una vez que haya copiado la \<URL\>, puede abrir una terminal en su máquina, navegar hasta el lugar donde desea descargar el repositorio y escribir:

source: This will create a `flower/` (or the name of your fork if you renamed it) folder in the current working directory.
es: Esto creará una carpeta `flower/` (o el nombre de su bifurcación si le cambió el nombre) en el directorio de trabajo actual.

source: **Add origin**
es: **Agregar origen**

source: You can then go into the repository folder:
es: Luego puede ir a la carpeta del repositorio:

source: And here we will need to add an origin to our repository. The origin is the \<URL\> of the remote fork repository. To obtain it, we can do as previously mentioned by going to our fork repository on our GitHub account and copying the link.
es: Y aquí necesitaremos agregar un origen a nuestro repositorio. El origen es la \<URL\> del repositorio de bifurcación remoto. Para obtenerlo podemos hacer lo mencionado anteriormente yendo a nuestro repositorio fork en nuestra cuenta de GitHub y copiando el enlace.

source: Once the \<URL\> is copied, we can type the following command in our terminal:
es: Una vez copiada la \<URL\>, podemos escribir el siguiente comando en nuestra terminal:

source: **Add upstream**
es: **Agregar aguas arriba**

source: Now we will add an upstream address to our repository. Still in the same directroy, we must run the following command:
es: Ahora agregaremos una dirección ascendente a nuestro repositorio. Aún en el mismo directorio, debemos ejecutar el siguiente comando:

source: The following diagram visually explains what we did in the previous steps:
es: El siguiente diagrama explica visualmente lo que hicimos en los pasos anteriores:

source: The upstream is the GitHub remote address of the parent repository (in this case Flower), i.e. the one we eventually want to contribute to and therefore need an up-to-date history of. The origin is just the GitHub remote address of the forked repository we created, i.e. the copy (fork) in our own account.
es: El upstream es la dirección remota de GitHub del repositorio principal (en este caso Flower), es decir, en el que finalmente queremos contribuir y, por lo tanto, necesitamos un historial actualizado. El origen es simplemente la dirección remota de GitHub del repositorio bifurcado que creamos, es decir, la copia (bifurcación) en nuestra propia cuenta.

source: To make sure our local version of the fork is up-to-date with the latest changes from the Flower repository, we can execute the following command:
es: Para asegurarnos de que nuestra versión local del fork esté actualizada con los últimos cambios del repositorio de Flower, podemos ejecutar el siguiente comando:

source: Setting up the coding environment
es: Configurar el entorno de codificación

source: This can be achieved by following this `getting started guide for contributors`_ (note that you won't need to clone the repository). Once you are able to write code and test it, you can finally start making changes!
es: Esto se puede lograr siguiendo esta `guía de introducción para colaboradores`_ (tenga en cuenta que no necesitará clonar el repositorio). Una vez que puedas escribir código y probarlo, ¡finalmente podrás comenzar a realizar cambios!

source: Making changes
es: Haciendo cambios

source: Before making any changes make sure you are up-to-date with your repository:
es: Antes de realizar cualquier cambio, asegúrese de estar actualizado con su repositorio:

source: And with Flower's repository:
es: Y con el repositorio de Flower:

source: **Create a new branch**
es: **Crear una nueva sucursal**

source: To make the history cleaner and easier to work with, it is good practice to create a new branch for each feature/project that needs to be implemented.
es: Para que el historial sea más limpio y más fácil de trabajar, es una buena práctica crear una nueva rama para cada característica/proyecto que deba implementarse.

source: To do so, just run the following command inside the repository's directory:
es: Para hacerlo, simplemente ejecute el siguiente comando dentro del directorio del repositorio:

source: **Make changes**
es: **Hacer cambios**

source: Write great code and create wonderful changes using your favorite editor!
es: ¡Escribe código excelente y crea cambios maravillosos usando tu editor favorito!

source: **Test and format your code**
es: **Prueba y formatea tu código**

source: Don't forget to test and format your code! Otherwise your code won't be able to be merged into the Flower repository. This is done so the codebase stays consistent and easy to understand.
es: ¡No olvides probar y formatear tu código! De lo contrario, su código no podrá fusionarse en el repositorio de Flower. Esto se hace para que el código base se mantenga coherente y fácil de entender.

source: To do so, we have written a few scripts that you can execute:
es: Para hacerlo, hemos escrito algunos scripts que puede ejecutar:

source: **Stage changes**
es: **Cambios de escenario**

source: Before creating a commit that will update your history, you must specify to Git which files it needs to take into account.
es: Antes de crear una confirmación que actualizará su historial, debe especificarle a Git qué archivos debe tener en cuenta.

source: This can be done with:
es: Esto se puede hacer con:

source: To check which files have been modified compared to the last version (last commit) and to see which files are staged for commit, you can use the :code:`git status` command.
es: Para verificar qué archivos se han modificado en comparación con la última versión (última confirmación) y ver qué archivos están preparados para la confirmación, puede usar el comando :code:`git status`.

source: **Commit changes**
es: **Cometer cambios**

source: Once you have added all the files you wanted to commit using :code:`git add`, you can finally create your commit using this command:
es: Una vez que haya agregado todos los archivos que deseaba confirmar usando :code:`git add`, finalmente puede crear su confirmación usando este comando:

source: The \<commit_message\> is there to explain to others what the commit does. It should be written in an imperative style and be concise. An example would be :code:`git commit -m "Add images to README"`.
es: El \<commit_message\> está ahí para explicar a los demás lo que hace el compromiso. Debe estar escrito en estilo imperativo y ser conciso. Un ejemplo sería :code:`git commit -m "Agregar imágenes a README"`.

source: **Push the changes to the fork**
es: **Empuje los cambios a la bifurcación**

source: Once we have committed our changes, we have effectively updated our local history, but GitHub has no way of knowing this unless we push our changes to our origin's remote address:
es: Una vez que hayamos confirmado nuestros cambios, hemos actualizado efectivamente nuestro historial local, pero GitHub no tiene forma de saberlo a menos que enviemos nuestros cambios a la dirección remota de nuestro origen:

source: Once this is done, you will see on the GitHub that your forked repo was updated with the changes you have made.
es: Una vez hecho esto, verá en GitHub que su repositorio bifurcado se actualizó con los cambios que realizó.

source: Creating and merging a pull request (PR)
es: Crear y fusionar una solicitud de extracción (PR)

source: **Create the PR**
es: **Crear el PR**

source: Once you have pushed changes, on the GitHub webpage of your repository you should see the following message:
es: Una vez que haya enviado los cambios, en la página web de GitHub de su repositorio debería ver el siguiente mensaje:

source: Otherwise you can always find this option in the `Branches` page.
es: De lo contrario, siempre podrás encontrar esta opción en la página "Sucursales".

source: Once you click the `Compare & pull request` button, you should see something similar to this:
es: Una vez que hagas clic en el botón "Comparar y solicitar extracción", deberías ver algo similar a esto:

source: At the top you have an explanation of which branch will be merged where:
es: En la parte superior tienes una explicación de qué rama se fusionará donde:

source: In this example you can see that the request is to merge the branch ``doc-fixes`` from my forked repository to branch ``main`` from the Flower repository.
es: En este ejemplo puedes ver que la solicitud es fusionar la rama ``doc-fixes`` de mi repositorio bifurcado con la rama ``main`` del repositorio Flower.

source: The input box in the middle is there for you to describe what your PR does and to link it to existing issues. We have placed comments (that won't be rendered once the PR is opened) to guide you through the process.
es: El cuadro de entrada en el medio está ahí para que usted describa lo que hace su RP y lo vincule con problemas existentes. Hemos colocado comentarios (que no se mostrarán una vez que se abra el PR) para guiarlo a través del proceso.

source: At the bottom you will find the button to open the PR. This will notify reviewers that a new PR has been opened and that they should look over it to merge or to request changes.
es: En la parte inferior encontrarás el botón para abrir el PR. Esto notificará a los revisores que se ha abierto un nuevo RP y que deben revisarlo para fusionarlo o solicitar cambios.

source: If your PR is not yet ready for review, and you don't want to notify anyone, you have the option to create a draft pull request:
es: Si su PR aún no está listo para su revisión y no desea notificar a nadie, tiene la opción de crear un borrador de solicitud de extracción:

source: **Making new changes**
es: **Haciendo nuevos cambios**

source: Once the PR has been opened (as draft or not), you can still push new commits to it the same way we did before, by making changes to the branch associated with the PR.
es: Una vez que se ha abierto el PR (como borrador o no), aún puede enviar nuevas confirmaciones de la misma manera que lo hicimos antes, realizando cambios en la rama asociada con el PR.

source: **Review the PR**
es: **Revise las relaciones públicas**

source: Once the PR has been opened or once the draft PR has been marked as ready, a review from code owners will be automatically requested:
es: Una vez que se haya abierto el PR o una vez que el borrador del PR se haya marcado como listo, se solicitará automáticamente una revisión a los propietarios del código:

source: Code owners will then look into the code, ask questions, request changes or validate the PR.
es: Los propietarios del código luego lo examinarán, harán preguntas, solicitarán cambios o validarán el PR.

source: Merging will be blocked if there are ongoing requested changes.
es: La fusión se bloqueará si hay cambios solicitados en curso.

source: To resolve them, just push the necessary changes to the branch associated with the PR:
es: Para resolverlos, simplemente envíe los cambios necesarios a la rama asociada con el PR:

source: And resolve the conversation:
es: Y resuelve la conversación:

source: Once all the conversations have been resolved, you can re-request a review.
es: Una vez resueltas todas las conversaciones, puedes volver a solicitar una revisión.

source: **Once the PR is merged**
es: **Una vez que el PR se fusiona**
