Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Configuration values are represented as a dictionary with ``str`` keys and values of type ``bool``, ``bytes``, ``double`` (64-bit precision float), ``int``, or ``str`` (or equivalent types in different languages). Here is an example of a configuration dictionary in Python:
es: Los valores de configuración se representan como un diccionario con claves ``str`` y valores de tipo ``bool``, ``bytes``, ``double`` (precisión flotante de 64 bits), ``int`` o ``str`` (o tipos equivalentes en diferentes idiomas). A continuación se muestra un ejemplo de un diccionario de configuración en Python:

source: Flower serializes these configuration dictionaries (or *config dict* for short) to their ProtoBuf representation, transports them to the client using gRPC, and then deserializes them back to Python dictionaries.
es: Flower serializa estos diccionarios de configuración (o *config dict* para abreviar) a su representación ProtoBuf, los transporta al cliente usando gRPC y luego los deserializa nuevamente a diccionarios Python.

source: Currently, there is no support for directly sending collection types (e.g., ``Set``, ``List``, ``Map``) as values in configuration dictionaries. There are several workarounds to send collections as values by converting them to one of the supported value types (and converting them back on the client-side).
es: Actualmente, no hay soporte para enviar directamente tipos de colección (por ejemplo, ``Set``, ``List``, ``Map``) como valores en diccionarios de configuración. Existen varias soluciones para enviar colecciones como valores convirtiéndolas a uno de los tipos de valores admitidos (y convirtiéndolas nuevamente en el lado del cliente).

source: One can, for example, convert a list of floating-point numbers to a JSON string, then send the JSON string using the configuration dictionary, and then convert the JSON string back to a list of floating-point numbers on the client.
es: Se puede, por ejemplo, convertir una lista de números de punto flotante en una cadena JSON, luego enviar la cadena JSON usando el diccionario de configuración y luego convertir la cadena JSON nuevamente en una lista de números de punto flotante en el cliente.

source: Configuration through built-in strategies
es: Configuración a través de estrategias integradas

source: The easiest way to send configuration values to clients is to use a built-in strategy like :code:`FedAvg`. Built-in strategies support so-called configuration functions. A configuration function is a function that the built-in strategy calls to get the configuration dictionary for the current round. It then forwards the configuration dictionary to all the clients selected during that round.
es: La forma más sencilla de enviar valores de configuración a los clientes es utilizar una estrategia integrada como :code:`FedAvg`. Las estrategias integradas admiten las llamadas funciones de configuración. Una función de configuración es una función que la estrategia integrada llama para obtener el diccionario de configuración para la ronda actual. Luego reenvía el diccionario de configuración a todos los clientes seleccionados durante esa ronda.

source: Let's start with a simple example. Imagine we want to send (a) the batch size that the client should use, (b) the current global round of federated learning, and (c) the number of epochs to train on the client-side. Our configuration function could look like this:
es: Comencemos con un ejemplo simple. Imagine que queremos enviar (a) el tamaño de lote que el cliente debe usar, (b) la ronda global actual de aprendizaje federado y (c) la cantidad de épocas para entrenar en el lado del cliente. Nuestra función de configuración podría verse así:

source: To make the built-in strategies use this function, we can pass it to ``FedAvg`` during initialization using the parameter :code:`on_fit_config_fn`:
es: Para que las estrategias integradas utilicen esta función, podemos pasarla a ``FedAvg`` durante la inicialización usando el parámetro :code:`on_fit_config_fn`:

source: One the client side, we receive the configuration dictionary in ``fit``:
es: Del lado del cliente, recibimos el diccionario de configuración en ``fit``:

source: There is also an `on_evaluate_config_fn` to configure evaluation, which works the same way. They are separate functions because one might want to send different configuration values to `evaluate` (for example, to use a different batch size).
es: También hay un `on_evaluate_config_fn` para configurar la evaluación, que funciona de la misma manera. Son funciones separadas porque es posible que desee enviar diferentes valores de configuración para "evaluar" (por ejemplo, para usar un tamaño de lote diferente).

source: The built-in strategies call this function every round (that is, every time `Strategy.configure_fit` or `Strategy.configure_evaluate` runs). Calling `on_evaluate_config_fn` every round allows us to vary/change the config dict over consecutive rounds. If we wanted to implement a hyperparameter schedule, for example, to increase the number of local epochs during later rounds, we could do the following:
es: Las estrategias integradas llaman a esta función en cada ronda (es decir, cada vez que se ejecuta `Strategy.configure_fit` o `Strategy.configure_evaluate`). Llamar a `on_evaluate_config_fn` en cada ronda nos permite variar/cambiar el dictado de configuración en rondas consecutivas. Si quisiéramos implementar una programación de hiperparámetros, por ejemplo, para aumentar el número de épocas locales durante rondas posteriores, podríamos hacer lo siguiente:

source: The :code:`FedAvg` strategy will call this function *every round*.
es: La estrategia :code:`FedAvg` llamará a esta función *en cada ronda*.

source: Configuring individual clients
es: Configurar clientes individuales

source: In some cases, it is necessary to send different configuration values to different clients.
es: En algunos casos, es necesario enviar diferentes valores de configuración a diferentes clientes.

source: This can be achieved by customizing an existing strategy or by `implementing a custom strategy from scratch <https://flower.dev/docs/implementing-strategies.html>`_. Here's a nonsensical example that customizes :code:`FedAvg` by adding a custom ``"hello": "world"`` configuration key/value pair to the config dict of a *single client* (only the first client in the list, the other clients in this round to not receive this "special" config value):
es: Esto se puede lograr personalizando una estrategia existente o `implementando una estrategia personalizada desde cero <https://flower.dev/docs/implementing-strategies.html>`_. Aquí hay un ejemplo sin sentido que personaliza :code:`FedAvg` agregando un par clave/valor de configuración ``"hello": "world"`` personalizado al dictado de configuración de un *único cliente* (solo el primer cliente en la lista , los otros clientes en esta ronda no recibirán este valor de configuración "especial":

source: Configure logging
es: Configurar el registro

source: The Flower logger keeps track of all core events that take place in federated learning workloads. It presents information by default following a standard message format:
es: El registrador Flower realiza un seguimiento de todos los eventos principales que tienen lugar en las cargas de trabajo de aprendizaje federado. Presenta información por defecto siguiendo un formato de mensaje estándar:

source: containing relevant information including: log message level (e.g. :code:`INFO`, :code:`DEBUG`), a timestamp, the line where the logging took place from, as well as the log message itself. In this way, the logger would typically display information on your terminal as follows:
es: que contiene información relevante que incluye: nivel de mensaje de registro (por ejemplo, :code:`INFO`, :code:`DEBUG`), una marca de tiempo, la línea desde donde se realizó el registro, así como el mensaje de registro en sí. De esta manera, el registrador normalmente mostrará información en su terminal de la siguiente manera:

source: Saving log to file
es: Guardar registro en archivo

source: By default, the Flower log is outputted to the terminal where you launch your Federated Learning workload from. This applies for both gRPC-based federation (i.e. when you do :code:`fl.server.start_server`) and when using the :code:`VirtualClientEngine` (i.e. when you do :code:`fl.simulation.start_simulation`). In some situations you might want to save this log to disk. You can do so by calling the `fl.common.logger.configure() <https://github.com/adap/flower/blob/main/src/py/flwr/common/logger.py>`_ function. For example:
es: De forma predeterminada, el registro de Flower se envía al terminal desde donde inicia su carga de trabajo de Aprendizaje federado. Esto se aplica tanto a la federación basada en gRPC (es decir, cuando haces :code:`fl.server.start_server`) como cuando usas :code:`VirtualClientEngine` (es decir, cuando haces :code:`fl.simulation.start_simulation`) . En algunas situaciones, es posible que desee guardar este registro en el disco. Puede hacerlo llamando a la función `fl.common.logger.configure() <https://github.com/adap/flower/blob/main/src/py/flwr/common/logger.py>`_. Por ejemplo:

source: With the above, Flower will record the log you see on your terminal to :code:`log.txt`. This file will be created in the same directory as were you are running the code from. If we inspect we see the log above is also recorded but prefixing with :code:`identifier` each line:
es: Con lo anterior, Flower registrará el registro que vea en su terminal en :code:`log.txt`. Este archivo se creará en el mismo directorio desde donde está ejecutando el código. Si inspeccionamos, vemos que el registro anterior también está registrado pero con el prefijo :code:`identifier` en cada línea:

source: Log your own messages
es: Registra tus propios mensajes

source: You might expand the information shown by default with the Flower logger by adding more messages relevant to your application. You can achieve this easily as follows.
es: Puede ampliar la información que se muestra de forma predeterminada con el registrador de flores agregando más mensajes relevantes para su aplicación. Puede lograr esto fácilmente de la siguiente manera.

source: In this way your logger will show, in addition to the default messages, the ones introduced by the clients as specified above.
es: De esta forma tu registrador mostrará, además de los mensajes predeterminados, los introducidos por los clientes tal y como se especifica anteriormente.

source: Log to a remote service
es: Iniciar sesión en un servicio remoto

source: The :code:`fl.common.logger.configure` function, also allows specifying a host to which logs can be pushed (via :code:`POST`) through a native Python :code:`logging.handler.HTTPHandler`. This is a particularly useful feature in :code:`gRPC`-based Federated Learning workloads where otherwise gathering logs from all entities (i.e. the server and the clients) might be cumbersome. Note that in Flower simulation, the server automatically displays all logs. You can still specify a :code:`HTTPHandler` should you whish to backup or analyze the logs somewhere else.
es: La función :code:`fl.common.logger.configure` también permite especificar un host al que se pueden enviar los registros (a través de :code:`POST`) a través de un :code:`logging.handler.HTTPHandler` nativo de Python. Esta es una característica particularmente útil en cargas de trabajo de aprendizaje federado basadas en :code:`gRPC` donde, de lo contrario, recopilar registros de todas las entidades (es decir, el servidor y los clientes) podría resultar engorroso. Tenga en cuenta que en la simulación de flores, el servidor muestra automáticamente todos los registros. Aún puede especificar un :code:`HTTPHandler` si desea realizar una copia de seguridad o analizar los registros en otro lugar.

source: Enable SSL connections
es: Habilitar conexiones SSL

source: This guide describes how to a SSL-enabled secure Flower server can be started and how a Flower client can establish a secure connections to it.
es: Esta guía describe cómo se puede iniciar un servidor Flower seguro habilitado para SSL y cómo un cliente Flower puede establecer conexiones seguras con él.

source: A complete code example demonstrating a secure connection can be found `here <https://github.com/adap/flower/tree/main/examples/advanced-tensorflow>`_.
es: Puede encontrar un ejemplo de código completo que demuestra una conexión segura `aquí <https://github.com/adap/flower/tree/main/examples/advanced-tensorflow>`_.

source: The code example comes with a README.md file which will explain how to start it. Although it is already SSL-enabled, it might be less descriptive on how. Stick to this guide for a deeper introduction to the topic.
es: El código de ejemplo viene con un archivo README.md que explicará cómo iniciarlo. Aunque ya está habilitado para SSL, podría ser menos descriptivo sobre cómo hacerlo. Siga esta guía para obtener una introducción más profunda al tema.

source: Certificates
es: Certificados

source: Using SSL-enabled connections requires certificates to be passed to the server and client. For the purpose of this guide we are going to generate self-signed certificates. As this can become quite complex we are going to ask you to run the script in :code:`examples/advanced-tensorflow/certificates/generate.sh`
es: El uso de conexiones habilitadas para SSL requiere que se pasen certificados al servidor y al cliente. A los efectos de esta guía, generaremos certificados autofirmados. Como esto puede volverse bastante complejo, le pediremos que ejecute el script en :code:`examples/advanced-tensorflow/certificates/generate.sh`

source: with the following command sequence:
es: con la siguiente secuencia de comandos:

source: This will generate the certificates in :code:`examples/advanced-tensorflow/.cache/certificates`.
es: Esto generará los certificados en: código:`examples/advanced-tensorflow/.cache/certificates`.

source: The approach how the SSL certificates are generated in this example can serve as an inspiration and starting point but should not be taken as complete for production environments. Please refer to other sources regarding the issue of correctly generating certificates for production environments.
es: El enfoque sobre cómo se generan los certificados SSL en este ejemplo puede servir como inspiración y punto de partida, pero no debe tomarse como completo para entornos de producción. Consulte otras fuentes sobre la cuestión de la generación correcta de certificados para entornos de producción.

source: In case you are a researcher you might be just fine using the self-signed certificates generated using the scripts which are part of this guide.
es: En caso de que sea un investigador, puede que le convenga utilizar los certificados autofirmados generados mediante los scripts que forman parte de esta guía.

source: Server
es: Servidor

source: We are now going to show how to write a sever which uses the previously generated scripts.
es: Ahora vamos a mostrar cómo escribir un servidor que utilice los scripts generados anteriormente.

source: When providing certificates, the server expects a tuple of three certificates. :code:`Path` can be used to easily read the contents of those files into byte strings, which is the data type :code:`start_server` expects.
es: Al proporcionar certificados, el servidor espera una tupla de tres certificados. :code:`Path` se puede utilizar para leer fácilmente el contenido de esos archivos en cadenas de bytes, que es el tipo de datos que :code:`start_server` espera.

source: Client
es: Cliente

source: We are now going to show how to write a client which uses the previously generated scripts:
es: Ahora vamos a mostrar cómo escribir un cliente que utilice los scripts generados anteriormente:

source: When setting :code:`root_certificates`, the client expects the PEM-encoded root certificates as a byte string. We are again using :code:`Path` to simplify reading those as byte strings.
es: Al configurar :code:`root_certificates`, el cliente espera los certificados raíz codificados en PEM como una cadena de bytes. Nuevamente estamos usando :code:`Path` para simplificar su lectura como cadenas de bytes.

source: Conclusion
es: Conclusión

source: You should now have learned how to generate self-signed certificates using the given script, start a SSL-enabled server, and have a client establish a secure connection to it.
es: Ahora debería haber aprendido cómo generar certificados autofirmados utilizando el script proporcionado, iniciar un servidor habilitado para SSL y hacer que un cliente establezca una conexión segura con él.

source: Additional resources
es: Recursos adicionales

source: These additional sources might be relevant if you would like to dive deeper into the topic of certificates:
es: Estas fuentes adicionales pueden ser relevantes si desea profundizar en el tema de los certificados:

source: `Let's Encrypt <https://letsencrypt.org/docs/>`_
es: `Vamos a cifrar <https://letsencrypt.org/docs/>`_

source: Implement strategies
es: Implementar estrategias

source: The strategy abstraction enables implementation of fully custom strategies. A strategy is basically the federated learning algorithm that runs on the server. Strategies decide how to sample clients, how to configure clients for training, how to aggregate updates, and how to evaluate models. Flower provides a few built-in strategies which are based on the same API described below.
es: La abstracción de estrategias permite la implementación de estrategias totalmente personalizadas. Una estrategia es básicamente el algoritmo de aprendizaje federado que se ejecuta en el servidor. Las estrategias deciden cómo muestrear clientes, cómo configurar clientes para capacitación, cómo agregar actualizaciones y cómo evaluar modelos. Flower proporciona algunas estrategias integradas que se basan en la misma API que se describe a continuación.

source: The :code:`Strategy` abstraction
es: La abstracción :code:`Strategy`

source: All strategy implementation are derived from the abstract base class :code:`flwr.server.strategy.Strategy`, both built-in implementations and third party implementations. This means that custom strategy implementations have the exact same capabilities at their disposal as built-in ones.
es: Todas las implementaciones de estrategias se derivan de la clase base abstracta :code:`flwr.server.strategy.Strategy`, tanto las implementaciones integradas como las implementaciones de terceros. Esto significa que las implementaciones de estrategias personalizadas tienen exactamente las mismas capacidades a su disposición que las integradas.

source: The strategy abstraction defines a few abstract methods that need to be implemented:
es: La abstracción de estrategia define algunos métodos abstractos que deben implementarse:

source: Creating a new strategy means implementing a new :code:`class` (derived from the abstract base class :code:`Strategy`) that implements for the previously shown abstract methods:
es: Crear una nueva estrategia significa implementar una nueva :code:`class` (derivada de la clase base abstracta :code:`Strategy`) que implementa los métodos abstractos mostrados anteriormente:

source: The Flower server calls these methods in the following order:
es: El servidor Flower llama a estos métodos en el siguiente orden:

source: The following sections describe each of those methods in more detail.
es: Las siguientes secciones describen cada uno de esos métodos con más detalle.

source: The :code:`initialize_parameters` method
es: El método :code:`initialize_parameters`

source: :code:`initialize_parameters` is called only once, at the very beginning of an execution. It is responsible for providing the initial global model parameters in a serialized form (i.e., as a :code:`Parameters` object).
es: :code:`initialize_parameters` se llama solo una vez, al comienzo de una ejecución. Es responsable de proporcionar los parámetros del modelo global inicial en forma serializada (es decir, como un objeto :code:`Parameters`).

source: Built-in strategies return user-provided initial parameters. The following example shows how initial parameters can be passed to :code:`FedAvg`:
es: Las estrategias integradas devuelven parámetros iniciales proporcionados por el usuario. El siguiente ejemplo muestra cómo se pueden pasar los parámetros iniciales a :code:`FedAvg`:

source: The Flower server will call :code:`initialize_parameters`, which either returns the parameters that were passed to :code:`initial_parameters`, or :code:`None`. If no parameters are returned from :code:`initialize_parameters` (i.e., :code:`None`), the server will randomly select one client and ask it to provide its parameters. This is a convenience feature and not recommended in practice, but it can be useful for prototyping. In practice, it is recommended to always use server-side parameter initialization.
es: El servidor Flower llamará a :code:`initialize_parameters`, que devuelve los parámetros que se pasaron a :code:`initial_parameters` o :code:`None`. Si no se devuelven parámetros de :code:`initialize_parameters` (es decir, :code:`None`), el servidor seleccionará aleatoriamente un cliente y le pedirá que proporcione sus parámetros. Esta es una característica conveniente y no se recomienda en la práctica, pero puede resultar útil para la creación de prototipos. En la práctica, se recomienda utilizar siempre la inicialización de parámetros del lado del servidor.

source: Server-side parameter initialization is a powerful mechanism. It can be used, for example, to resume training from a previously saved checkpoint. It is also the fundamental capability needed to implement hybrid approaches, for example, to fine-tune a pre-trained model using federated learning.
es: La inicialización de parámetros del lado del servidor es un mecanismo poderoso. Se puede utilizar, por ejemplo, para reanudar el entrenamiento desde un punto de control previamente guardado. También es la capacidad fundamental necesaria para implementar enfoques híbridos, por ejemplo, para ajustar un modelo previamente entrenado utilizando el aprendizaje federado.

source: The :code:`configure_fit` method
es: El método :code:`configure_fit`

source: :code:`configure_fit` is responsible for configuring the upcoming round of training. What does *configure* mean in this context? Configuring a round means selecting clients and deciding what instructions to send to these clients. The signature of :code:`configure_fit` makes this clear:
es: :code:`configure_fit` es responsable de configurar la próxima ronda de entrenamiento. ¿Qué significa *configurar* en este contexto? Configurar una ronda significa seleccionar clientes y decidir qué instrucciones enviarles. La firma de :code:`configure_fit` deja esto claro:

source: The return value is a list of tuples, each representing the instructions that will be sent to a particular client. Strategy implementations usually perform the following steps in :code:`configure_fit`:
es: El valor de retorno es una lista de tuplas, cada una de las cuales representa las instrucciones que se enviarán a un cliente en particular. Las implementaciones de estrategias generalmente realizan los siguientes pasos en :code:`configure_fit`:

source: Use the :code:`client_manager` to randomly sample all (or a subset of) available clients (each represented as a :code:`ClientProxy` object)
es: Utilice :code:`client_manager` para muestrear aleatoriamente todos (o un subconjunto de) los clientes disponibles (cada uno representado como un objeto :code:`ClientProxy`)
