Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: We would like to give our special thanks to all the contributors who made the new version of Flower possible (in `git shortlog` order):
es: Nos gustaría agradecer especialmente a todos los contribuyentes que hicieron posible la nueva versión de Flower (en orden `git shortlog`):

source: **Introduce support for XGBoost (**`FedXgbNnAvg` **strategy and example)** ([#1694](https://github.com/adap/flower/pull/1694), [#1709](https://github.com/adap/flower/pull/1709), [#1715](https://github.com/adap/flower/pull/1715), [#1717](https://github.com/adap/flower/pull/1717), [#1763](https://github.com/adap/flower/pull/1763), [#1795](https://github.com/adap/flower/pull/1795))
es: **Introducir soporte para XGBoost (**`FedXgbNnAvg` **estrategia y ejemplo)** ([#1694](https://github.com/adap/flower/pull/1694), [#1709](https: //github.com/adap/flower/pull/1709), [#1715](https://github.com/adap/flower/pull/1715), [#1717](https://github.com/ adapta/flower/pull/1717), [#1763](https://github.com/adap/flower/pull/1763), [#1795](https://github.com/adap/flower/pull/ 1795))

source: XGBoost is a tree-based ensemble machine learning algorithm that uses gradient boosting to improve model accuracy. We added a new `FedXgbNnAvg` [strategy](https://github.com/adap/flower/tree/main/src/py/flwr/server/strategy/fedxgb_nn_avg.py), and a [code example](https://github.com/adap/flower/tree/main/examples/quickstart_xgboost_horizontal) that demonstrates the usage of this new strategy in an XGBoost project.
es: XGBoost es un algoritmo de aprendizaje automático conjunto basado en árboles que utiliza aumento de gradiente para mejorar la precisión del modelo. Agregamos una nueva [estrategia] `FedXgbNnAvg`(https://github.com/adap/flower/tree/main/src/py/flwr/server/strategy/fedxgb_nn_avg.py) y un [ejemplo de código](https ://github.com/adap/flower/tree/main/examples/quickstart_xgboost_horizontal) que demuestra el uso de esta nueva estrategia en un proyecto XGBoost.

source: **Introduce iOS SDK (preview)** ([#1621](https://github.com/adap/flower/pull/1621), [#1764](https://github.com/adap/flower/pull/1764))
es: **Presentar iOS SDK (vista previa)** ([#1621](https://github.com/adap/flower/pull/1621), [#1764](https://github.com/adap/flower/ tirar/1764))

source: This is a major update for anyone wanting to implement Federated Learning on iOS mobile devices. We now have a swift iOS SDK present under [src/swift/flwr](https://github.com/adap/flower/tree/main/src/swift/flwr) that will facilitate greatly the app creating process. To showcase its use, the [iOS example](https://github.com/adap/flower/tree/main/examples/ios) has also been updated!
es: Esta es una actualización importante para cualquiera que desee implementar el aprendizaje federado en dispositivos móviles iOS. Ahora tenemos un rápido SDK de iOS presente en [src/swift/flwr](https://github.com/adap/flower/tree/main/src/swift/flwr) que facilitará enormemente el proceso de creación de aplicaciones. Para mostrar su uso, el [ejemplo de iOS](https://github.com/adap/flower/tree/main/examples/ios) también se ha actualizado.

source: **Introduce new "What is Federated Learning?" tutorial** ([#1657](https://github.com/adap/flower/pull/1657), [#1721](https://github.com/adap/flower/pull/1721))
es: **Introduzca el nuevo "¿Qué es el aprendizaje federado?" tutorial** ([#1657](https://github.com/adap/flower/pull/1657), [#1721](https://github.com/adap/flower/pull/1721))

source: A new [entry-level tutorial](https://flower.dev/docs/framework/tutorial-what-is-federated-learning.html) in our documentation explains the basics of Fedetated Learning. It enables anyone who's unfamiliar with Federated Learning to start their journey with Flower. Forward it to anyone who's interested in Federated Learning!
es: Un nuevo [tutorial básico](https://flower.dev/docs/framework/tutorial-what-is-federated-learning.html) en nuestra documentación explica los conceptos básicos del aprendizaje federado. Permite que cualquiera que no esté familiarizado con Federated Learning comience su viaje con Flower. ¡Envíelo a cualquiera que esté interesado en el aprendizaje federado!

source: **Introduce new Flower Baseline: FedProx MNIST** ([#1513](https://github.com/adap/flower/pull/1513), [#1680](https://github.com/adap/flower/pull/1680), [#1681](https://github.com/adap/flower/pull/1681), [#1679](https://github.com/adap/flower/pull/1679))
es: **Presentar una nueva línea base de flores: FedProx MNIST** ([#1513](https://github.com/adap/flower/pull/1513), [#1680](https://github.com/adap/flower /pull/1680), [#1681](https://github.com/adap/flower/pull/1681), [#1679](https://github.com/adap/flower/pull/1679))

source: This new baseline replicates the MNIST+CNN task from the paper [Federated Optimization in Heterogeneous Networks (Li et al., 2018)](https://arxiv.org/abs/1812.06127). It uses the `FedProx` strategy, which aims at making convergence more robust in heterogenous settings.
es: Esta nueva línea de base replica la tarea MNIST+CNN del artículo [Optimización federada en redes heterogéneas (Li et al., 2018)] (https://arxiv.org/abs/1812.06127). Utiliza la estrategia "FedProx", cuyo objetivo es hacer que la convergencia sea más sólida en entornos heterogéneos.

source: **Introduce new Flower Baseline: FedAvg FEMNIST** ([#1655](https://github.com/adap/flower/pull/1655))
es: **Presentar una nueva línea base de flores: FedAvg FEMNIST** ([#1655](https://github.com/adap/flower/pull/1655))

source: This new baseline replicates an experiment evaluating the performance of the FedAvg algorithm on the FEMNIST dataset from the paper [LEAF: A Benchmark for Federated Settings (Caldas et al., 2018)](https://arxiv.org/abs/1812.01097).
es: Esta nueva línea de base replica un experimento que evalúa el rendimiento del algoritmo FedAvg en el conjunto de datos FEMNIST del artículo [LEAF: A Benchmark for Federated Settings (Caldas et al., 2018)](https://arxiv.org/abs/1812.01097) .

source: **Introduce (experimental) REST API** ([#1594](https://github.com/adap/flower/pull/1594), [#1690](https://github.com/adap/flower/pull/1690), [#1695](https://github.com/adap/flower/pull/1695), [#1712](https://github.com/adap/flower/pull/1712), [#1802](https://github.com/adap/flower/pull/1802), [#1770](https://github.com/adap/flower/pull/1770), [#1733](https://github.com/adap/flower/pull/1733))
es: **Presentar API REST (experimental)** ([#1594](https://github.com/adap/flower/pull/1594), [#1690](https://github.com/adap/flower/ pull/1690), [#1695](https://github.com/adap/flower/pull/1695), [#1712](https://github.com/adap/flower/pull/1712), [ #1802](https://github.com/adap/flower/pull/1802), [#1770](https://github.com/adap/flower/pull/1770), [#1733](https: //github.com/adap/flower/pull/1733))

source: A new REST API has been introduced as an alternative to the gRPC-based communication stack. In this initial version, the REST API only supports anonymous clients.
es: Se introdujo una nueva API REST como alternativa a la pila de comunicación basada en gRPC. En esta versión inicial, la API REST solo admite clientes anónimos.

source: Please note: The REST API is still experimental and will likely change significantly over time.
es: Tenga en cuenta: la API REST aún es experimental y probablemente cambiará significativamente con el tiempo.

source: **Improve the (experimental) Driver API** ([#1663](https://github.com/adap/flower/pull/1663), [#1666](https://github.com/adap/flower/pull/1666), [#1667](https://github.com/adap/flower/pull/1667), [#1664](https://github.com/adap/flower/pull/1664), [#1675](https://github.com/adap/flower/pull/1675), [#1676](https://github.com/adap/flower/pull/1676), [#1693](https://github.com/adap/flower/pull/1693), [#1662](https://github.com/adap/flower/pull/1662), [#1794](https://github.com/adap/flower/pull/1794))
es: **Mejorar la API del controlador (experimental)** ([#1663](https://github.com/adap/flower/pull/1663), [#1666](https://github.com/adap/flower /pull/1666), [#1667](https://github.com/adap/flower/pull/1667), [#1664](https://github.com/adap/flower/pull/1664), [#1675](https://github.com/adap/flower/pull/1675), [#1676](https://github.com/adap/flower/pull/1676), [#1693](https ://github.com/adap/flower/pull/1693), [#1662](https://github.com/adap/flower/pull/1662), [#1794](https://github.com /adap/flor/pull/1794))

source: The Driver API is still an experimental feature, but this release introduces some major upgrades. One of the main improvements is the introduction of an SQLite database to store server state on disk (instead of in-memory). Another improvement is that tasks (instructions or results) that have been delivered will now be deleted. This greatly improves the memory efficiency of a long-running Flower server.
es: La API del controlador sigue siendo una característica experimental, pero esta versión presenta algunas actualizaciones importantes. Una de las principales mejoras es la introducción de una base de datos SQLite para almacenar el estado del servidor en el disco (en lugar de en la memoria). Otra mejora es que ahora se eliminarán las tareas (instrucciones o resultados) que se hayan entregado. Esto mejora enormemente la eficiencia de la memoria de un servidor Flower de larga duración.

source: **Fix spilling issues related to Ray during simulations** ([#1698](https://github.com/adap/flower/pull/1698))
es: **Solucionar problemas de derrames relacionados con Ray durante las simulaciones** ([#1698](https://github.com/adap/flower/pull/1698))

source: While running long simulationa, `ray` was sometimes spilling huge amounts of data that would make the training unable to continue. This is now fixed! 🎉
es: Mientras ejecutaba simulaciones largas, "ray" a veces derramaba enormes cantidades de datos que hacían que el entrenamiento no pudiera continuar. ¡Esto ya está arreglado! 🎉

source: **Add new example using** `TabNet` **and Flower** ([#1725](https://github.com/adap/flower/pull/1725))
es: **Agregue un nuevo ejemplo usando** `TabNet` **y Flower** ([#1725](https://github.com/adap/flower/pull/1725))

source: TabNet is a powerful and flexible framework for training machine learning models on tabular data. We now have a federated example using Flower: [https://github.com/adap/flower/tree/main/examples/tabnet](https://github.com/adap/flower/tree/main/examples/quickstart_tabnet).
es: TabNet es un marco potente y flexible para entrenar modelos de aprendizaje automático en datos tabulares. Ahora tenemos un ejemplo federado usando Flower: [https://github.com/adap/flower/tree/main/examples/tabnet](https://github.com/adap/flower/tree/main/examples/quickstart_tabnet ).

source: **Add new how-to guide for monitoring simulations** ([#1649](https://github.com/adap/flower/pull/1649))
es: **Agregue una nueva guía práctica para monitorear simulaciones** ([#1649](https://github.com/adap/flower/pull/1649))

source: We now have a documentation guide to help users monitor their performance during simulations.
es: Ahora tenemos una guía de documentación para ayudar a los usuarios a monitorear su desempeño durante las simulaciones.

source: **Add training metrics to** `History` **object during simulations** ([#1696](https://github.com/adap/flower/pull/1696))
es: **Agregar métricas de entrenamiento al** `Historial` **objeto durante las simulaciones** ([#1696](https://github.com/adap/flower/pull/1696))

source: The `fit_metrics_aggregation_fn` can be used to aggregate training metrics, but previous releases did not save the results in the `History` object. This is now the case!
es: `fit_metrics_aggregation_fn` se puede utilizar para agregar métricas de entrenamiento, pero las versiones anteriores no guardaban los resultados en el objeto `History`. ¡Este es ahora el caso!

source: **General improvements** ([#1659](https://github.com/adap/flower/pull/1659), [#1646](https://github.com/adap/flower/pull/1646), [#1647](https://github.com/adap/flower/pull/1647), [#1471](https://github.com/adap/flower/pull/1471), [#1648](https://github.com/adap/flower/pull/1648), [#1651](https://github.com/adap/flower/pull/1651), [#1652](https://github.com/adap/flower/pull/1652), [#1653](https://github.com/adap/flower/pull/1653), [#1659](https://github.com/adap/flower/pull/1659), [#1665](https://github.com/adap/flower/pull/1665), [#1670](https://github.com/adap/flower/pull/1670), [#1672](https://github.com/adap/flower/pull/1672), [#1677](https://github.com/adap/flower/pull/1677), [#1684](https://github.com/adap/flower/pull/1684), [#1683](https://github.com/adap/flower/pull/1683), [#1686](https://github.com/adap/flower/pull/1686), [#1682](https://github.com/adap/flower/pull/1682), [#1685](https://github.com/adap/flower/pull/1685), [#1692](https://github.com/adap/flower/pull/1692), [#1705](https://github.com/adap/flower/pull/1705), [#1708](https://github.com/adap/flower/pull/1708), [#1711](https://github.com/adap/flower/pull/1711), [#1713](https://github.com/adap/flower/pull/1713), [#1714](https://github.com/adap/flower/pull/1714), [#1718](https://github.com/adap/flower/pull/1718), [#1716](https://github.com/adap/flower/pull/1716), [#1723](https://github.com/adap/flower/pull/1723), [#1735](https://github.com/adap/flower/pull/1735), [#1678](https://github.com/adap/flower/pull/1678), [#1750](https://github.com/adap/flower/pull/1750), [#1753](https://github.com/adap/flower/pull/1753), [#1736](https://github.com/adap/flower/pull/1736), [#1766](https://github.com/adap/flower/pull/1766), [#1760](https://github.com/adap/flower/pull/1760), [#1775](https://github.com/adap/flower/pull/1775), [#1776](https://github.com/adap/flower/pull/1776), [#1777](https://github.com/adap/flower/pull/1777), [#1779](https://github.com/adap/flower/pull/1779), [#1784](https://github.com/adap/flower/pull/1784), [#1773](https://github.com/adap/flower/pull/1773), [#1755](https://github.com/adap/flower/pull/1755), [#1789](https://github.com/adap/flower/pull/1789), [#1788](https://github.com/adap/flower/pull/1788), [#1798](https://github.com/adap/flower/pull/1798), [#1799](https://github.com/adap/flower/pull/1799), [#1739](https://github.com/adap/flower/pull/1739), [#1800](https://github.com/adap/flower/pull/1800), [#1804](https://github.com/adap/flower/pull/1804), [#1805](https://github.com/adap/flower/pull/1805))
es: **Mejoras generales** ([#1659](https://github.com/adap/flower/pull/1659), [#1646](https://github.com/adap/flower/pull/1646) , [#1647](https://github.com/adap/flower/pull/1647), [#1471](https://github.com/adap/flower/pull/1471), [#1648]( https://github.com/adap/flower/pull/1648), [#1651](https://github.com/adap/flower/pull/1651), [#1652](https://github. com/adap/flower/pull/1652), [#1653](https://github.com/adap/flower/pull/1653), [#1659](https://github.com/adap/flower/ pull/1659), [#1665](https://github.com/adap/flower/pull/1665), [#1670](https://github.com/adap/flower/pull/1670), [ #1672](https://github.com/adap/flower/pull/1672), [#1677](https://github.com/adap/flower/pull/1677), [#1684](https: //github.com/adap/flower/pull/1684), [#1683](https://github.com/adap/flower/pull/1683), [#1686](https://github.com/ adapta/flower/pull/1686), [#1682](https://github.com/adap/flower/pull/1682), [#1685](https://github.com/adap/flower/pull/ 1685), [#1692](https://github.com/adap/flower/pull/1692), [#1705](https://github.com/adap/flower/pull/1705), [#1708 ](https://github.com/adap/flower/pull/1708), [#1711](https://github.com/adap/flower/pull/1711), [#1713](https:// github.com/adap/flower/pull/1713), [#1714](https://github.com/adap/flower/pull/1714), [#1718](https://github.com/adap/ flor/pull/1718), [#1716](https://github.com/adap/flower/pull/1716), [#1723](https://github.com/adap/flower/pull/1723) , [#1735](https://github.com/adap/flower/pull/1735), [#1678](https://github.com/adap/flower/pull/1678), [#1750]( https://github.com/adap/flower/pull/1750), [#1753](https://github.com/adap/flower/pull/1753), [#1736](https://github. com/adap/flower/pull/1736), [#1766](https://github.com/adap/flower/pull/1766), [#1760](https://github.com/adap/flower/ pull/1760), [#1775](https://github.com/adap/flower/pull/1775), [#1776](https://github.com/adap/flower/pull/1776), [ #1777](https://github.com/adap/flower/pull/1777), [#1779](https://github.com/adap/flower/pull/1779), [#1784](https: //github.com/adap/flower/pull/1784), [#1773](https://github.com/adap/flower/pull/1773), [#1755](https://github.com/ adapta/flower/pull/1755), [#1789](https://github.com/adap/flower/pull/1789), [#1788](https://github.com/adap/flower/pull/ 1788), [#1798](https://github.com/adap/flower/pull/1798), [#1799](https://github.com/adap/flower/pull/1799), [#1739 ](https://github.com/adap/flower/pull/1739), [#1800](https://github.com/adap/flower/pull/1800), [#1804](https:// github.com/adap/flower/pull/1804), [#1805](https://github.com/adap/flower/pull/1805))

source: Flower received many improvements under the hood, too many to list here.
es: Flower recibió muchas mejoras internas, demasiadas para enumerarlas aquí.

source: **Add support for** `workload_id` **and** `group_id` **in Driver API** ([#1595](https://github.com/adap/flower/pull/1595))
es: **Agregue soporte para** `workload_id` **y** `group_id` **en la API del controlador** ([#1595](https://github.com/adap/flower/pull/1595))

source: The (experimental) Driver API now supports a `workload_id` that can be used to identify which workload a task belongs to. It also supports a new `group_id` that can be used, for example, to indicate the current training round. Both the `workload_id` and `group_id` enable client nodes to decide whether they want to handle a task or not.
es: La API del controlador (experimental) ahora admite un `workload_id` que se puede utilizar para identificar a qué carga de trabajo pertenece una tarea. También admite un nuevo `group_id` que se puede utilizar, por ejemplo, para indicar la ronda de entrenamiento actual. Tanto `workload_id` como `group_id` permiten a los nodos cliente decidir si quieren manejar una tarea o no.

source: **Make Driver API and Fleet API address configurable** ([#1637](https://github.com/adap/flower/pull/1637))
es: **Hacer que la dirección de Driver API y Fleet API sea configurable** ([#1637](https://github.com/adap/flower/pull/1637))

source: The (experimental) long-running Flower server (Driver API and Fleet API) can now configure the server address of both Driver API (via `--driver-api-address`) and Fleet API (via `--fleet-api-address`) when starting:
es: El servidor Flower (experimental) de larga ejecución (Driver API y Fleet API) ahora puede configurar la dirección del servidor tanto de Driver API (a través de `--driver-api-address`) como de Fleet API (a través de `--fleet-api- dirección`) al iniciar:

source: `flower-server --driver-api-address "0.0.0.0:8081" --fleet-api-address "0.0.0.0:8086"`
es: `servidor-flor --driver-api-address "0.0.0.0:8081" --fleet-api-address "0.0.0.0:8086"`

source: Both IPv4 and IPv6 addresses are supported.
es: Se admiten direcciones IPv4 e IPv6.

source: **Add new example of Federated Learning using fastai and Flower** ([#1598](https://github.com/adap/flower/pull/1598))
es: **Agregue un nuevo ejemplo de aprendizaje federado usando fastai y Flower** ([#1598](https://github.com/adap/flower/pull/1598))

source: A new code example (`quickstart_fastai`) demonstrates federated learning with [fastai](https://www.fast.ai/) and Flower. You can find it here: [quickstart_fastai](https://github.com/adap/flower/tree/main/examples/quickstart_fastai).
es: Un nuevo ejemplo de código (`quickstart_fastai`) demuestra el aprendizaje federado con [fastai](https://www.fast.ai/) y Flower. Puede encontrarlo aquí: [quickstart_fastai](https://github.com/adap/flower/tree/main/examples/quickstart_fastai).

source: **Make Android example compatible with** `flwr >= 1.0.0` **and the latest versions of Android** ([#1603](https://github.com/adap/flower/pull/1603))
es: **Hacer que el ejemplo de Android sea compatible con** `flwr >= 1.0.0` **y las últimas versiones de Android** ([#1603](https://github.com/adap/flower/pull/1603))

source: The Android code example has received a substantial update: the project is compatible with Flower 1.0 and later, the UI received a full refresh, and the project is updated to be compatible with newer Android tooling.
es: El ejemplo de código de Android recibió una actualización sustancial: el proyecto es compatible con Flower 1.0 y versiones posteriores, la interfaz de usuario recibió una actualización completa y el proyecto se actualizó para que sea compatible con las herramientas más nuevas de Android.

source: **Add new `FedProx` strategy** ([#1619](https://github.com/adap/flower/pull/1619))
es: **Agregar nueva estrategia `FedProx`** ([#1619](https://github.com/adap/flower/pull/1619))

source: This [strategy](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedprox.py) is almost identical to [`FedAvg`](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedavg.py), but helps users replicate what is described in this [paper](https://arxiv.org/abs/1812.06127). It essentially adds a parameter called `proximal_mu` to regularize the local models with respect to the global models.
es: Esta [estrategia](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedprox.py) es casi idéntica a [`FedAvg`](https://github .com/adap/flower/blob/main/src/py/flwr/server/strategy/fedavg.py), pero ayuda a los usuarios a replicar lo que se describe en este [documento](https://arxiv.org/abs/1812.06127 ). Básicamente agrega un parámetro llamado `proximal_mu` para regularizar los modelos locales con respecto a los modelos globales.

source: **Add new metrics to telemetry events** ([#1640](https://github.com/adap/flower/pull/1640))
es: **Agregar nuevas métricas a eventos de telemetría** ([#1640](https://github.com/adap/flower/pull/1640))

source: An updated event structure allows, for example, the clustering of events within the same workload.
es: Una estructura de eventos actualizada permite, por ejemplo, agrupar eventos dentro de la misma carga de trabajo.

source: **Add new custom strategy tutorial section** [#1623](https://github.com/adap/flower/pull/1623)
es: **Agregar nueva sección de tutorial de estrategia personalizada** [#1623](https://github.com/adap/flower/pull/1623)

source: The Flower tutorial now has a new section that covers implementing a custom strategy from scratch: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-build-a-strategy-from-scratch-pytorch.ipynb)
es: El tutorial de Flower ahora tiene una nueva sección que cubre la implementación de una estrategia personalizada desde cero: [Abrir en Colab](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial -construir-una-estrategia-desde-cero-pytorch.ipynb)

source: **Add new custom serialization tutorial section** ([#1622](https://github.com/adap/flower/pull/1622))
es: **Agregar nueva sección de tutorial de serialización personalizada** ([#1622](https://github.com/adap/flower/pull/1622))

source: The Flower tutorial now has a new section that covers custom serialization: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-customize-the-client-pytorch.ipynb)
es: El tutorial de Flower ahora tiene una nueva sección que cubre la serialización personalizada: [Abrir en Colab](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-customize-the -cliente-pytorch.ipynb)
