Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: Congratulations, you now understand the basics of federated learning. There's a lot more to discuss, of course, but that was federated learning in a nutshell. In later parts of this tutorial, we will go into more detail. Interesting questions include: How can we select the best client nodes that should participate in the next round? What's the best way to aggregate model updates? How can we handle failing client nodes (stragglers)?
es: Felicitaciones, ahora comprende los conceptos básicos del aprendizaje federado. Por supuesto, hay mucho más que discutir, pero en pocas palabras, eso fue aprendizaje federado. En partes posteriores de este tutorial, entraremos en más detalles. Las preguntas interesantes incluyen: ¿Cómo podemos seleccionar los mejores nodos de clientes que deberían participar en la próxima ronda? ¿Cuál es la mejor manera de agregar actualizaciones de modelos? ¿Cómo podemos manejar los nodos cliente fallidos (rezagados)?

source: Just like we can train a model on the decentralized data of different client nodes, we can also evaluate the model on that data to receive valuable metrics. This is called federated evaluation, sometimes abbreviated as FE. In fact, federated evaluation is an integral part of most federated learning systems.
es: Así como podemos entrenar un modelo con los datos descentralizados de diferentes nodos de clientes, también podemos evaluar el modelo con esos datos para recibir métricas valiosas. Esto se denomina evaluación federada, a veces abreviada como FE. De hecho, la evaluación federada es una parte integral de la mayoría de los sistemas de aprendizaje federados.

source: Federated analytics
es: Análisis federados

source: In many cases, machine learning isn't necessary to derive value from data. Data analysis can yield valuable insights, but again, there's often not enough data to get a clear answer. What's the average age at which people develop a certain type of health condition? Federated analytics enables such queries over multiple client nodes. It is usually used in conjunction with other privacy-enhancing technologies like secure aggregation to prevent the server from seeing the results submitted by individual client nodes.
es: En muchos casos, el aprendizaje automático no es necesario para obtener valor de los datos. El análisis de datos puede generar información valiosa, pero, una vez más, a menudo no hay datos suficientes para obtener una respuesta clara. ¿Cuál es la edad promedio a la que las personas desarrollan cierto tipo de condición de salud? El análisis federado permite este tipo de consultas en múltiples nodos de clientes. Por lo general, se usa junto con otras tecnologías que mejoran la privacidad, como la agregación segura, para evitar que el servidor vea los resultados enviados por nodos de clientes individuales.

source: Differential Privacy
es: Privacidad diferencial

source: Differential privacy (DP) is often mentioned in the context of Federated Learning. It is a privacy-preserving method used when analyzing and sharing statistical data, ensuring the privacy of individual participants. DP achieves this by adding statistical noise to the model updates, ensuring any individual participants’ information cannot be distinguished or re-identified. This technique can be considered an optimization that provides a quantifiable privacy protection measure.
es: La privacidad diferencial (DP) se menciona a menudo en el contexto del aprendizaje federado. Es un método de preservación de la privacidad que se utiliza al analizar y compartir datos estadísticos, garantizando la privacidad de los participantes individuales. DP logra esto agregando ruido estadístico a las actualizaciones del modelo, asegurando que la información de los participantes individuales no pueda distinguirse ni volverse a identificar. Esta técnica puede considerarse una optimización que proporciona una medida de protección de la privacidad cuantificable.

source: Flower
es: Flor

source: Federated learning, federated evaluation, and federated analytics require infrastructure to move machine learning models back and forth, train and evaluate them on local data, and then aggregate the updated models. Flower provides the infrastructure to do exactly that in an easy, scalable, and secure way. In short, Flower presents a unified approach to federated learning, analytics, and evaluation. It allows the user to federate any workload, any ML framework, and any programming language.
es: El aprendizaje federado, la evaluación federada y el análisis federado requieren infraestructura para mover modelos de aprendizaje automático de un lado a otro, entrenarlos y evaluarlos con datos locales y luego agregar los modelos actualizados. Flower proporciona la infraestructura para hacer exactamente eso de una manera fácil, escalable y segura. En resumen, Flower presenta un enfoque unificado para el aprendizaje, el análisis y la evaluación federados. Permite al usuario federar cualquier carga de trabajo, cualquier marco de aprendizaje automático y cualquier lenguaje de programación.

source: Flower federated learning server and client nodes (car, scooter, personal computer, roomba, and phone)
es: Servidor de aprendizaje federado de Flower y nodos cliente (automóvil, scooter, computadora personal, roomba y teléfono)

source: Congratulations, you just learned the basics of federated learning and how it relates to the classic (centralized) machine learning!
es: ¡Felicitaciones, acaba de aprender los conceptos básicos del aprendizaje federado y cómo se relaciona con el aprendizaje automático clásico (centralizado)!

source: In the next part of this tutorial, we are going to build a first federated learning system with Flower.
es: En la siguiente parte de este tutorial, crearemos un primer sistema de aprendizaje federado con Flower.

source: The `Flower Federated Learning Tutorial - Part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__ shows how to build a simple federated learning system with PyTorch and Flower.
es: El `Tutorial de aprendizaje federado de Flower - Parte 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__ muestra cómo construir un sistema de aprendizaje federado simple con PyTorch y Flor.
