Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: es

source: If all the automatic tests have passed and reviewers have no more changes to request, they can approve the PR and merge it.
es: Si todas las pruebas automáticas han pasado y los revisores no tienen más cambios que solicitar, pueden aprobar el PR y fusionarlo.

source: Once it is merged, you can delete the branch on GitHub (a button should appear to do so) and also delete it locally by doing:
es: Una vez fusionada, puedes eliminar la rama en GitHub (debería aparecer un botón para hacerlo) y también eliminarla localmente haciendo:

source: Then you should update your forked repository by doing:
es: Entonces deberías actualizar tu repositorio bifurcado haciendo:

source: Example of first contribution
es: Ejemplo de primera contribución

source: Problem
es: Problema

source: For our documentation, we’ve started to use the `Diàtaxis framework <https://diataxis.fr/>`_.
es: Para nuestra documentación, hemos comenzado a utilizar el `framework Diàtaxis <https://diataxis.fr/>`_.

source: Our “How to” guides should have titles that continue the sencence “How to …”, for example, “How to upgrade to Flower 1.0”.
es: Nuestras guías de “Cómo hacer” deben tener títulos que continúen con la frase “Cómo hacer…”, por ejemplo, “Cómo actualizar a Flower 1.0”.

source: Most of our guides do not follow this new format yet, and changing their title is (unfortunately) more involved than one might think.
es: La mayoría de nuestras guías aún no siguen este nuevo formato y cambiar su título es (desafortunadamente) más complicado de lo que uno podría pensar.

source: This issue is about changing the title of a doc from present continious to present simple.
es: Este número trata sobre cambiar el título de un documento del presente continuo al presente simple.

source: Let's take the example of “Saving Progress” which we changed to “Save Progress”. Does this pass our check?
es: Tomemos el ejemplo de "Guardar progreso" que cambiamos a "Guardar progreso". ¿Esto pasa nuestro control?

source: Before: ”How to saving progress” ❌
es: Antes: "Cómo guardar el progreso" ❌

source: After: ”How to save progress” ✅
es: Después: "Cómo guardar el progreso" ✅

source: Solution
es: Solución

source: This is a tiny change, but it’ll allow us to test your end-to-end setup. After cloning and setting up the Flower repo, here’s what you should do:
es: Este es un pequeño cambio, pero nos permitirá probar su configuración de un extremo a otro. Después de clonar y configurar el repositorio de Flower, esto es lo que debe hacer:

source: Find the source file in `doc/source`
es: Busque el archivo fuente en `doc/source`

source: Make the change in the `.rst` file (beware, the dashes under the title should be the same length as the title itself)
es: Realice el cambio en el archivo `.rst` (tenga cuidado, los guiones debajo del título deben tener la misma longitud que el título mismo)

source: Build the docs and check the result: `<https://flower.dev/docs/writing-documentation.html#edit-an-existing-page>`_
es: Compile los documentos y verifique el resultado: `<https://flower.dev/docs/writing-documentation.html#edit-an-existing-page>`_

source: Rename file
es: Renombrar archivo

source: You might have noticed that the file name still reflects the old wording. If we just change the file, then we break all existing links to it - it is **very important** to avoid that, breaking links can harm our search engine ranking.
es: Es posible que hayas notado que el nombre del archivo todavía refleja la redacción anterior. Si simplemente cambiamos el archivo, romperemos todos los enlaces existentes; es **muy importante** evitar eso, romper enlaces puede dañar nuestra clasificación en los motores de búsqueda.

source: Here’s how to change the file name:
es: A continuación se explica cómo cambiar el nombre del archivo:

source: Change the file name to `save-progress.rst`
es: Cambie el nombre del archivo a `save-progress.rst`

source: Add a redirect rule to `doc/source/conf.py`
es: Agregue una regla de redireccionamiento a `doc/source/conf.py`

source: This will cause a redirect from `saving-progress.html` to `save-progress.html`, old links will continue to work.
es: Esto provocará una redirección de ` Saving-progress.html` a `save-progress.html`, los enlaces antiguos seguirán funcionando.

source: Apply changes in the index file
es: Aplicar cambios en el archivo de índice.

source: For the lateral navigation bar to work properly, it is very important to update the `index.rst` file as well. This is where we define the whole arborescence of the navbar.
es: Para que la barra de navegación lateral funcione correctamente, es muy importante actualizar también el archivo `index.rst`. Aquí es donde definimos toda la arborescencia de la barra de navegación.

source: Find and modify the file name in `index.rst`
es: Busque y modifique el nombre del archivo en `index.rst`

source: Open PR
es: Relaciones públicas abiertas

source: Commit the changes (commit messages are always imperative: “Do something”, in this case “Change …”)
es: Confirmar los cambios (los mensajes de confirmación siempre son imperativos: "Hacer algo", en este caso "Cambiar...")

source: Push the changes to your fork
es: Empuja los cambios a tu bifurcación

source: Open a PR (as shown above)
es: Abra un PR (como se muestra arriba)

source: Wait for it to be approved!
es: ¡Espera a que se apruebe!

source: Congrats! 🥳 You're now officially a Flower contributor!
es: ¡Felicitaciones! 🥳 ¡Ahora eres oficialmente colaborador de Flower!

source: How to write a good PR title
es: Cómo escribir un buen título de relaciones públicas

source: A well-crafted PR title helps team members quickly understand the purpose and scope of the changes being proposed. Here's a guide to help you write a good GitHub PR title:
es: Un título de relaciones públicas bien elaborado ayuda a los miembros del equipo a comprender rápidamente el propósito y el alcance de los cambios propuestos. Aquí tienes una guía que te ayudará a escribir un buen título de relaciones públicas en GitHub:

source: 1. Be Clear and Concise: Provide a clear summary of the changes in a concise manner. 1. Use Actionable Verbs: Start with verbs like "Add," "Update," or "Fix" to indicate the purpose. 1. Include Relevant Information: Mention the affected feature or module for context. 1. Keep it Short: Avoid lengthy titles for easy readability. 1. Use Proper Capitalization and Punctuation: Follow grammar rules for clarity.
es: 1. Sea claro y conciso: proporcione un resumen claro de los cambios de manera concisa. 1. Utilice verbos procesables: comience con verbos como "Agregar", "Actualizar" o "Reparar" para indicar el propósito. 1. Incluya información relevante: mencione la función o módulo afectado para contextualizar. 1. Sea breve: evite títulos extensos para facilitar la lectura. 1. Utilice mayúsculas y puntuación adecuadas: siga las reglas gramaticales para mayor claridad.

source: Let's start with a few examples for titles that should be avoided because they do not provide meaningful information:
es: Comencemos con algunos ejemplos de títulos que se deben evitar porque no brindan información significativa:

source: Implement Algorithm
es: Implementar algoritmo

source: Database
es: Base de datos

source: Add my_new_file.py to codebase
es: Agregue my_new_file.py al código base

source: Improve code in module
es: Mejorar el código en el módulo.

source: Change SomeModule
es: Cambiar algún módulo

source: Here are a few positive examples which provide helpful information without repeating how they do it, as that is already visible in the "Files changed" section of the PR:
es: Aquí hay algunos ejemplos positivos que brindan información útil sin repetir cómo lo hacen, como ya está visible en la sección "Archivos modificados" del PR:

source: Update docs banner to mention Flower Summit 2023
es: Actualizar el banner de documentos para mencionar Flower Summit 2023

source: Remove unnecessary XGBoost dependency
es: Eliminar la dependencia innecesaria de XGBoost

source: Remove redundant attributes in strategies subclassing FedAvg
es: Eliminar atributos redundantes en estrategias que subclasifican FedAvg

source: Add CI job to deploy the staging system when the `main` branch changes
es: Agregue un trabajo de CI para implementar el sistema provisional cuando cambie la rama "principal"

source: Add new amazing library which will be used to improve the simulation engine
es: Agregue una nueva biblioteca sorprendente que se utilizará para mejorar el motor de simulación.

source: Next steps
es: Próximos pasos

source: Once you have made your first PR, and want to contribute more, be sure to check out the following :
es: Una vez que haya realizado su primer PR y desee contribuir más, asegúrese de consultar lo siguiente:

source: `Good first contributions <https://flower.dev/docs/framework/contributor-ref-good-first-contributions.html>`_, where you should particularly look into the :code:`baselines` contributions.
es: `Buenas primeras contribuciones <https://flower.dev/docs/framework/contributor-ref-good-first-contributions.html>`_, donde deberías examinar especialmente las contribuciones :code:`baselines`.

source: Get started as a contributor
es: Comience como colaborador

source: Prerequisites
es: Requisitos previos

source: `Python 3.7 <https://docs.python.org/3.7/>`_ or above
es: `Python 3.7 <https://docs.python.org/3.7/>`_ o superior

source: `Poetry 1.3 <https://python-poetry.org/>`_ or above
es: `Poesía 1.3 <https://python-poetry.org/>`_ o superior

source: (Optional) `pyenv <https://github.com/pyenv/pyenv>`_
es: (Opcional) `pyenv <https://github.com/pyenv/pyenv>`_

source: (Optional) `pyenv-virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_
es: (Opcional) `pyenv-virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_

source: Flower uses :code:`pyproject.toml` to manage dependencies and configure development tools (the ones which support it). Poetry is a build tool which supports `PEP 517 <https://www.python.org/dev/peps/pep-0517/>`_.
es: Flower usa :code:`pyproject.toml` para gestionar dependencias y configurar herramientas de desarrollo (las que lo admiten). Poetry es una herramienta de compilación que admite `PEP 517 <https://www.python.org/dev/peps/pep-0517/>`_.

source: Developer Machine Setup
es: Configuración de la máquina del desarrollador

source: First, clone the `Flower repository <https://github.com/adap/flower>`_ from GitHub::
es: Primero, clone el `Repositorio de flores <https://github.com/adap/flower>`_ de GitHub::

source: Second, create a virtual environment (and activate it). If you chose to use :code:`pyenv` (with the :code:`pyenv-virtualenv` plugin) and already have it installed , you can use the following convenience script (by default it will use :code:`Python 3.7.15`, but you can change it by providing a specific :code:`<version>`)::
es: En segundo lugar, cree un entorno virtual (y actívelo). Si elige usar :code:`pyenv` (con el complemento :code:`pyenv-virtualenv`) y ya lo tiene instalado, puede usar el siguiente script conveniente (de manera predeterminada usará :code:`Python 3.7. 15`, pero puedes cambiarlo proporcionando un :code:`<version>` específico::

source: If you don't have :code:`pyenv` installed, you can use the following script that will install pyenv, set it up and create the virtual environment (with :code:`Python 3.7.15` by default)::
es: Si no tiene :code:`pyenv` instalado, puede usar el siguiente script que instalará pyenv, lo configurará y creará el entorno virtual (con :code:`Python 3.7.15` por defecto)::

source: Third, install the Flower package in development mode (think :code:`pip install -e`) along with all necessary dependencies::
es: En tercer lugar, instale el paquete Flower en modo de desarrollo (piense en :code:`pip install -e`) junto con todas las dependencias necesarias::

source: Convenience Scripts
es: Guiones de conveniencia

source: The Flower repository contains a number of convenience scripts to make recurring development tasks easier and less error-prone. See the :code:`/dev` subdirectory for a full list. The following scripts are amonst the most important ones:
es: El repositorio de Flower contiene una serie de scripts convenientes para hacer que las tareas de desarrollo recurrentes sean más fáciles y menos propensas a errores. Consulte el subdirectorio :code:`/dev` para obtener una lista completa. Los siguientes scripts se encuentran entre los más importantes:

source: Create/Delete Virtual Environment
es: Crear/eliminar entorno virtual

source: Compile ProtoBuf Definitions
es: Compilar definiciones de ProtoBuf

source: Auto-Format Code
es: Código de formato automático

source: Run Linters and Tests
es: Ejecutar linters y pruebas

source: Run Github Actions (CI) locally
es: Ejecute acciones de Github (CI) localmente

source: Developers could run the full set of Github Actions workflows under their local environment by using `Act <https://github.com/nektos/act>_`. Please refer to the installation instructions under the linked repository and run the next command under Flower main cloned repository folder::
es: Los desarrolladores podrían ejecutar el conjunto completo de flujos de trabajo de Github Actions en su entorno local utilizando `Act <https://github.com/nektos/act>_`. Consulte las instrucciones de instalación en el repositorio vinculado y ejecute el siguiente comando en la carpeta principal del repositorio clonado de Flower::

source: The Flower default workflow would run by setting up the required Docker machines underneath.
es: El flujo de trabajo predeterminado de Flower se ejecutaría configurando las máquinas Docker requeridas debajo.

source: Build Release
es: Lanzamiento de compilación

source: Flower uses Poetry to build releases. The necessary command is wrapped in a simple script::
es: Flower utiliza la poesía para crear lanzamientos. El comando necesario está incluido en un script simple::

source: The resulting :code:`.whl` and :code:`.tar.gz` releases will be stored in the :code:`/dist` subdirectory.
es: Las versiones resultantes :code:`.whl` y :code:`.tar.gz` se almacenarán en el subdirectorio :code:`/dist`.

source: Build Documentation
es: Documentación de compilación

source: Flower's documentation uses `Sphinx <https://www.sphinx-doc.org/>`_. There's no convenience script to re-build the documentation yet, but it's pretty easy::
es: La documentación de Flower utiliza `Sphinx <https://www.sphinx-doc.org/>`_. Aún no existe un script conveniente para reconstruir la documentación, pero es bastante fácil:

source: This will generate HTML documentation in ``doc/build/html``.
es: Esto generará documentación HTML en ``doc/build/html``.

source: Example: FedBN in PyTorch - From Centralized To Federated
es: Ejemplo: FedBN en PyTorch: de centralizado a federado

source: This tutorial will show you how to use Flower to build a federated version of an existing machine learning workload with `FedBN <https://github.com/med-air/FedBN>`_, a federated training strategy designed for non-iid data. We are using PyTorch to train a Convolutional Neural Network(with Batch Normalization layers) on the CIFAR-10 dataset. When applying FedBN, only few changes needed compared to `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_.
es: Este tutorial le mostrará cómo usar Flower para crear una versión federada de una carga de trabajo de aprendizaje automático existente con `FedBN <https://github.com/med-air/FedBN>`_, una estrategia de capacitación federada diseñada para personas que no son iid. datos. Estamos utilizando PyTorch para entrenar una red neuronal convolucional (con capas de normalización por lotes) en el conjunto de datos CIFAR-10. Al aplicar FedBN, solo se necesitan algunos cambios en comparación con `Ejemplo: PyTorch: de centralizado a federado <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_.

source: Centralized Training
es: Formación centralizada

source: All files are revised based on `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. The only thing to do is modifying the file called :code:`cifar.py`, revised part is shown below:
es: Todos los archivos se revisan según el `Ejemplo: PyTorch: de centralizado a federado <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. Lo único que queda por hacer es modificar el archivo llamado :code:`cifar.py`, la parte revisada se muestra a continuación:

source: The model architecture defined in class Net() is added with Batch Normalization layers accordingly.
es: La arquitectura del modelo definida en la clase Net() se agrega con capas de normalización por lotes en consecuencia.

source: You can now run your machine learning workload:
es: Ahora puede ejecutar su carga de trabajo de aprendizaje automático:

source: So far this should all look fairly familiar if you've used PyTorch before. Let's take the next step and use what we've built to create a federated learning system within FedBN, the sytstem consists of one server and two clients.
es: Hasta ahora, todo esto debería resultarle bastante familiar si ha utilizado PyTorch antes. Demos el siguiente paso y usemos lo que hemos creado para crear un sistema de aprendizaje federado dentro de FedBN. El sistema consta de un servidor y dos clientes.

source: Federated Training
es: Entrenamiento Federado

source: If you have read `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_, the following parts are easy to follow, onyl :code:`get_parameters` and :code:`set_parameters` function in :code:`client.py` needed to revise. If not, please read the `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. first.
es: Si ha leído `Ejemplo: PyTorch: de centralizado a federado <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_, las siguientes partes son fáciles de seguir, solo Las funciones :code:`get_parameters` y :code:`set_parameters` en :code:`client.py` son necesarias para revisar. De lo contrario, lea el `Ejemplo: PyTorch: de centralizado a federado <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. primero.

source: Our example consists of one *server* and two *clients*. In FedBN, :code:`server.py` keeps unchanged, we can start the server directly.
es: Nuestro ejemplo consta de un *servidor* y dos *clientes*. En FedBN, :code:`server.py` se mantiene sin cambios, podemos iniciar el servidor directamente.

source: Finally, we will revise our *client* logic by changing :code:`get_parameters` and :code:`set_parameters` in :code:`client.py`, we will exclude batch normalization parameters from model parameter list when sending to or receiving from the server.
es: Finalmente, revisaremos nuestra lógica de *cliente* cambiando :code:`get_parameters` y :code:`set_parameters` en :code:`client.py`, excluiremos los parámetros de normalización por lotes de la lista de parámetros del modelo al enviar o recibir desde el servidor.

source: Now, you can now open two additional terminal windows and run
es: Ahora, puede abrir dos ventanas de terminal adicionales y ejecutar

source: in each window (make sure that the server is still running before you do so) and see your (previously centralized) PyTorch project run federated learning with FedBN strategy across two clients. Congratulations!
es: en cada ventana (asegúrese de que el servidor aún esté ejecutándose antes de hacerlo) y vea su proyecto PyTorch (previamente centralizado) ejecutar aprendizaje federado con la estrategia FedBN en dos clientes. ¡Felicidades!

source: Next Steps
es: Próximos pasos

source: The full source code for this example can be found `here <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Our example is of course somewhat over-simplified because both clients load the exact same dataset, which isn't realistic. You're now prepared to explore this topic further. How about using different subsets of CIFAR-10 on each client? How about adding more clients?
es: El código fuente completo de este ejemplo se puede encontrar `aquí <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Por supuesto, nuestro ejemplo está algo demasiado simplificado porque ambos clientes cargan exactamente el mismo conjunto de datos, lo cual no es realista. Ahora está preparado para explorar este tema más a fondo. ¿Qué tal si utilizamos diferentes subconjuntos de CIFAR-10 en cada cliente? ¿Qué tal agregar más clientes?

source: Example: JAX - Run JAX Federated
es: Ejemplo: JAX: ejecutar JAX federado

source: This tutorial will show you how to use Flower to build a federated version of an existing JAX workload. We are using JAX to train a linear regression model on a scikit-learn dataset. We will structure the example similar to our `PyTorch - From Centralized To Federated <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ walkthrough. First, we build a centralized training approach based on the `Linear Regression with JAX <https://coax.readthedocs.io/en/latest/examples/linear_regression/jax.html>`_ tutorial`. Then, we build upon the centralized training code to run the training in a federated fashion.
es: Este tutorial le mostrará cómo utilizar Flower para crear una versión federada de una carga de trabajo JAX existente. Estamos utilizando JAX para entrenar un modelo de regresión lineal en un conjunto de datos de scikit-learn. Estructuraremos el ejemplo de manera similar a nuestro tutorial `PyTorch - De centralizado a federado <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Primero, creamos un enfoque de capacitación centralizado basado en el `Tutorial de regresión lineal con JAX <https://coax.readthedocs.io/en/latest/examples/linear_regression/jax.html>`. Luego, nos basamos en el código de capacitación centralizado para ejecutar la capacitación de forma federada.

source: Before we start building our JAX example, we need install the packages :code:`jax`, :code:`jaxlib`, :code:`scikit-learn`, and :code:`flwr`:
es: Antes de comenzar a construir nuestro ejemplo JAX, necesitamos instalar los paquetes :code:`jax`, :code:`jaxlib`, :code:`scikit-learn` y :code:`flwr`:

source: Linear Regression with JAX
es: Regresión lineal con JAX

source: We begin with a brief description of the centralized training code based on a :code:`Linear Regression` model. If you want a more in-depth explanation of what's going on then have a look at the official `JAX documentation <https://jax.readthedocs.io/>`_.
es: Comenzamos con una breve descripción del código de entrenamiento centralizado basado en un modelo :code:`Regresión lineal`. Si desea una explicación más detallada de lo que está sucediendo, eche un vistazo a la `documentación oficial de JAX <https://jax.readthedocs.io/>`_.
