Repository: adap/flower
Catalog: doc/locales/*/LC_MESSAGES/tutorial-quickstart-mxnet.po
Languages: fr

source: Quickstart MXNet
fr: Démarrage rapide de MXNet

source: In this tutorial, we will learn how to train a :code:`Sequential` model on MNIST using Flower and MXNet.
fr: Dans ce tutoriel, nous allons apprendre à former un modèle :code:`Sequential` sur MNIST à l'aide de Flower et de MXNet.

source: Our example consists of one *server* and two *clients* all having the same model.
fr: Notre exemple consiste en un *serveur* et deux *clients* ayant tous le même modèle.

source: *Clients* are responsible for generating individual model parameter updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce an updated global model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of parameters updates is called a *round*.
fr: *Les clients* sont chargés de générer des mises à jour individuelles des paramètres du modèle en fonction de leurs ensembles de données locales. Ces mises à jour sont ensuite envoyées au *serveur* qui les agrège pour produire un modèle global mis à jour. Enfin, le *serveur* renvoie cette version améliorée du modèle à chaque *client*. Un cycle complet de mises à jour des paramètres s'appelle un *round*.

source: Now that we have a rough idea of what is going on, let's get started. We first need to install Flower. You can do this by running:
fr: Maintenant que nous avons une idée approximative de ce qui se passe, commençons. Nous devons d'abord installer Flower. Tu peux le faire en lançant :

source: Since we want to use MXNet, let's go ahead and install it:
fr: Puisque nous voulons utiliser MXNet, allons-y et installons-le :

source: Flower Client
fr: Client de la fleur

source: In a file called :code:`client.py`, import Flower and MXNet related packages:
fr: Dans un fichier appelé :code:`client.py`, importe Flower et les paquets liés au MXNet :

source: In addition, define the device allocation in MXNet with:
fr: En outre, définis l'attribution de l'appareil dans MXNet avec :

source: We use MXNet to load MNIST, a popular image classification dataset of handwritten digits for machine learning. The MXNet utility :code:`mx.test_utils.get_mnist()` downloads the training and test data.
fr: Nous utilisons MXNet pour charger MNIST, un ensemble de données de classification d'images populaire de chiffres manuscrits pour l'apprentissage automatique. L'utilitaire MXNet :code:`mx.test_utils.get_mnist()` télécharge les données d'entraînement et de test.

source: Define the training and loss with MXNet. We train the model by looping over the dataset, measure the corresponding loss, and optimize it.
fr: Définis l'entraînement et la perte avec MXNet. Nous entraînons le modèle en parcourant en boucle l'ensemble des données, nous mesurons la perte correspondante et nous l'optimisons.

source: Next, we define the validation of our machine learning model. We loop over the test set and measure both loss and accuracy on the test set.
fr: Ensuite, nous définissons la validation de notre modèle d'apprentissage automatique. Nous effectuons une boucle sur l'ensemble de test et mesurons à la fois la perte et la précision sur l'ensemble de test.

source: After defining the training and testing of a MXNet machine learning model, we use these functions to implement a Flower client.
fr: Après avoir défini la formation et le test d'un modèle d'apprentissage automatique MXNet, nous utilisons ces fonctions pour mettre en œuvre un client Flower.

source: Our Flower clients will use a simple :code:`Sequential` model:
fr: Nos clients Flower utiliseront un modèle simple :code:`Sequential` :

source: After loading the dataset with :code:`load_data()` we perform one forward propagation to initialize the model and model parameters with :code:`model(init)`. Next, we implement a Flower client.
fr: Après avoir chargé l'ensemble de données avec :code:`load_data()`, nous effectuons une propagation vers l'avant pour initialiser le modèle et les paramètres du modèle avec :code:`model(init)`. Ensuite, nous implémentons un client Flower.

source: The Flower server interacts with clients through an interface called :code:`Client`. When the server selects a particular client for training, it sends training instructions over the network. The client receives those instructions and calls one of the :code:`Client` methods to run your code (i.e., to train the neural network we defined earlier).
fr: Le serveur Flower interagit avec les clients par le biais d'une interface appelée :code:`Client`. Lorsque le serveur sélectionne un client particulier pour la formation, il envoie des instructions de formation sur le réseau. Le client reçoit ces instructions et appelle l'une des méthodes :code:`Client` pour exécuter ton code (c'est-à-dire pour former le réseau neuronal que nous avons défini plus tôt).

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses MXNet. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
fr: Flower fournit une classe de commodité appelée :code:`NumPyClient` qui facilite l'implémentation de l'interface :code:`Client` lorsque ta charge de travail utilise MXNet. L'implémentation de :code:`NumPyClient` signifie généralement la définition des méthodes suivantes (:code:`set_parameters` est cependant facultatif) :

source: return the model weight as a list of NumPy ndarrays
fr: renvoie le poids du modèle sous la forme d'une liste de ndarrays NumPy

source: :code:`set_parameters` (optional)
fr: :code:`set_parameters` (optionnel)

source: update the local model weights with the parameters received from the server
fr: mettre à jour les poids du modèle local avec les paramètres reçus du serveur

source: set the local model weights
fr: fixe les poids du modèle local

source: train the local model
fr: entraîne le modèle local

source: receive the updated local model weights
fr: recevoir les poids du modèle local mis à jour

source: :code:`evaluate`
fr: :code:`évaluer`

source: test the local model
fr: teste le modèle local

source: They can be implemented in the following way:
fr: Ils peuvent être mis en œuvre de la manière suivante :

source: We can now create an instance of our class :code:`MNISTClient` and add one line to actually run this client:
fr: Nous pouvons maintenant créer une instance de notre classe :code:`MNISTClient` et ajouter une ligne pour exécuter ce client :

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()` or :code:`fl.client.start_numpy_client()`. The string :code:`"0.0.0.0:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"0.0.0.0:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we pass to the client.
fr: C'est tout pour le client. Il nous suffit d'implémenter :code:`Client` ou :code:`NumPyClient` et d'appeler :code:`fl.client.start_client()` ou :code:`fl.client.start_numpy_client()`. La chaîne :code:`"0.0.0:8080"` indique au client à quel serveur se connecter. Dans notre cas, nous pouvons exécuter le serveur et le client sur la même machine, c'est pourquoi nous utilisons :code:`"0.0.0:8080"`. Si nous exécutons une charge de travail véritablement fédérée avec le serveur et les clients s'exécutant sur des machines différentes, tout ce qui doit changer est :code:`server_address` que nous transmettons au client.

source: Flower Server
fr: Serveur de fleurs

source: For simple workloads we can start a Flower server and leave all the configuration possibilities at their default values. In a file named :code:`server.py`, import Flower and start the server:
fr: Pour les charges de travail simples, nous pouvons démarrer un serveur Flower et laisser toutes les possibilités de configuration à leurs valeurs par défaut. Dans un fichier nommé :code:`server.py`, importe Flower et démarre le serveur :

source: Train the model, federated!
fr: Entraîne le modèle, fédéré !

source: With both client and server ready, we can now run everything and see federated learning in action. Federated learning systems usually have a server and multiple clients. We therefore have to start the server first:
fr: Le client et le serveur étant prêts, nous pouvons maintenant tout exécuter et voir l'apprentissage fédéré en action. Les systèmes d'apprentissage fédéré ont généralement un serveur et plusieurs clients. Nous devons donc commencer par démarrer le serveur :

source: Once the server is running we can start the clients in different terminals. Open a new terminal and start the first client:
fr: Une fois que le serveur fonctionne, nous pouvons démarrer les clients dans différents terminaux. Ouvre un nouveau terminal et démarre le premier client :

source: Open another terminal and start the second client:
fr: Ouvre un autre terminal et démarre le deuxième client :

source: Each client will have its own dataset. You should now see how the training does in the very first terminal (the one that started the server):
fr: Chaque client aura son propre ensemble de données. Tu devrais maintenant voir comment la formation se déroule dans le tout premier terminal (celui qui a démarré le serveur) :
